[
  {
    "aggregateRating": {
      "reviewCount": 213,
      "@type": "AggregateRating",
      "ratingValue": 4.0
    },
    "review": [
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-03-17",
        "description": "SO FN PERFECT. Just sooo fn good in so many ways. I've been here too many times to count since they've open..also brought many friends+fam here WHO have now also made this their new FAVE place! This place is pretty much, Spanish tapas just done so damn right!!\n\nThis tasty place is smack right in the middle of a very busy plaza (Trader Joe's/Gott's/etc), kind of hidden & boring on the outside yet carries a nice modern & rustic ambiance inside. Service has always been A1, super friendly & fast. Owner sometimes pops by to check on you & or even pours some house liquor down your throat (which I'm all for)!! The menu has a wide variety of tapas + cocktails with delish & refreshing flavor profiles. Please note: you can make reservations ahead which I highly suggest, since this place is a hot topic rn with legit prime dinner times already booked out weeks in advance!\n\nFoodtalk:\n(1) Ham Croquetas - rich cheesy balls of ham goodness, 2 sauces to dip - love the red one with a sweet tang, the other is a usual mayo aioli\n(2) Crab Croquetas - tasty & really rich in crab flavor, small raw tuna sashimi on top adds a refreshing texture/touch\n(3) Jamon Iberico De Bellota - thin beautiful slices of cured ham + bread with tomato like jam on it, just wished the bread was warmed/toasted\n(4) Pulpo Teleferic - the best octopus I've had in so long, super tender yet crispy with an amazing flavor + potato puree. A FN MUST HERE!\n(5) Patatas Bravas - fried yummy tiny potato pieces *Tip ask for sauce on the side so potatoes stay crispy AF\n(6) Chicken Empanadas - unique and tasty! More like a won ton exterior but so crispy + juicy & flavorful filling!\n(7) Crispy Porca - beautifully crunchy, yet super tender & juicy pork belly, tasty sauce and great veggies to compliment the flavor!\n(8) El Corte Iberico - grilled steak with roasted bone marrow, this was my least favorite but still good overall. Hanger steak usual tougher than I like and bone marrow was OK in flavor and richness - not the best I've had. \n(9) Premium Tomahawk - NOW this is a must steak dish! Legit go with a big party just to share this thicc thang, best deal for quality & size! It's huge, boned in...shown to your face - then they taken to the back & diced up for you. So much rich flavor that it doesn't even need the sauce, but if anything - that chimchurri green sauce hella bomb! \n(10) Brussels Sprouts - charred to perfection with so many tasty flavors, especially the salsa verde foam - unique & so tasty!\n(11) Veggie board - special for the day, array of veggies tossed in olive oil + salt/pepper and roasted. Super tasty & would def. order again!\n(12) La Burrata - rich & cranny Burrata + nice sweet digs on top of a salad with a light dressing. \n(13) Paella De Carne Y Setas - meat paella with chicken, pork, mushrooms, and green beans. Love the taste and flavor overall, but def. needs to be a little more hot to get that crispy bottom layer. \n(14) Paella Negra - sooo bomb!! Tasty squid ink with fresh shrimp + clams + cuttlefish! Def. still needs to be hotter again for that crispy bottom layer that was missing. \n(15) Dessert Trio - churros were hot & lightly sweet + chocolate cream was not too sweet at all and perfect for dipping, Choco Majic was a super rich chocolate gananche (little too sweet for me), and the Torrijas was so fn goood - pretty much a light citrus french toast!\n\nCocktails:\n(1) Sangria Barceloneta - white sangria with fresh fruit like pear + berries with rosemary lemonade. Super light, sweet, and refreshing!\n(2) Spicy sangria - sooooooo fn good & unique! White wine + vodka + triple sec & elder flower + hella Jalapenos with that real kick!!\n(3) Unkown egg white cocktail - forgot what this was but it was refreshing and perfect, nice citrus flavor + great egg white froth for a creamy touch!\n(4) Catalan G&T- THIS IS THE WINNER! I make the classic G&T at my house pretty often & pretty well, so I usually don't order out unless it's really special - & this one is! So tasty + many flavor profiles yet still refreshing & not overly sweet or strong! My fave drink here!\n(5) The Tourist - this was my least favorite and kind of odd to me in flavor. I love Lychee, but was really taken back by the raspberries/mint/honey combo with it - not my style but others liked it.",
        "author": "Saleen L."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-04-13",
        "description": "Overall, the food was decent but the salmon seemed overpriced and paella was a bit plain. We are definitely willing to try it again because it does seem like an authentic restaurant deserving another chance.  \nWe were excited about trying this authentic Spanish restaurant in the area as it's only about 10 minutes from our new home. \nThe restaurant is attached to the \"market\" which sells some awesome Spanish inspired goodies. \nThe salmon dish was a bit small for the price, but the paella was a great portion. \nThe salmon tasted we cooked and the quinoa salad on the side was tasty.  \nThe paella negra tasted a bit plain & may have been better if paired with something.  \nThe sangria was sweeter than anticipated, but easy to drink.",
        "author": "Samantha K."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-03-17",
        "description": "We were around town and stopped by for dinner. My friends and I were in the neighborhood during the coronavirus spread. We were impressed but also surprised they were open due to so many restrictions in the city and counties. \n\nWe got seated and ordered immediately. We got the lobster paella, squid ink pasta, empanadas and grilled octopus. Each dish had its own taste and flavor but my ultimate fave was the paella. It brought so much memories from Barcelona. Give them a try! They accept cards and also have a little gift shop next for small goods as wine to take home.",
        "author": "Stephanie Y."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-03-10",
        "description": "It's nearly impossible to get a reservation for this place for dinner, but finally with COVID-19 and all, was able to check this place out on a weekday for lunch with my husband.\n\nThe service was very attentive and friendly from the moment we sat down. I was a sucker and got still bottled water for the table, which is $5.50 btw (not told upfront about that and didn't find out til we got our check, but I should've known it was going to be extra).\nDrinks seemed very appetizing as well and I got the bubbly sangria which was delicious.  \n\nWe decided to get tapas to maximize the number of dishes we could try. \n-Grilled octopus (pulpo): delicious, I highly recommend this dish and will get this dish every time I am here. The octopus was cooked perfectly and the potatoes? truffled? sweet potato? its service with is amazing.\n-Patatas bravas: a must when in Barcelona, so a must here. The red and white sauce were classic, good, but I do say I like crispier potatoes with the bravas \n-Cauliflower: roasted cauliflower with a romesco sauce that's addictive\n-Crab croquetas: probably the least tasty of the lunch, the sashimi was a bit fishy and I thought the croquetes would have pieces of crab but it was really all just liquidy with hardly any crab flavor \n \nThe tapas are truly tapas size, meaning they are smaller plates. \nTotal our bill came out to around $45 a person, including a drink. A litle $$$ is right. We were moderately full and did not have dessert. \n\nOverall, would definitely return! It took me back to our honeymoon where we spent a few days in Barcelona.",
        "author": "Sara S."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-29",
        "description": "4.5 stars - the food and service were excellent! I loved the design of the restaurant too, the atmosphere had a great feel to it (good music too!) \n\nThe food came out so quick! I'll start with my negative critique first..I wasn't a huge fan of the squid ink paella, due to personal preference. I thought it was a bit salty but my friends liked it a lot. I do have to say it was pretty fresh and a huge portion. The cauliflower and brussel sprouts were good but not super impressive. I wasn't so big on the lemon undertone that was in the sauce of the sprouts. The creme brulee was also a bit too creamy and could've been a little more solid, but I still really loved how it tasted.\n\nHighlights- \n\n*The octopus was grilled to perfection. The crispy edges tasted so much like bacon that I had to look twice. The potato purée under it was so much better than I imagined it to be.\n*The sangria teleferic tasted wonderful, loved the extra flavor from the cinnamon stick.\n*The crab croquettes were excellent, crispy outside & creamy filling. Wonderful. The sashimi added a fresh contrast.\n*The garlic shrimp was meaty and full of flavor. I loved soaking up the sauce with the bread it came with.\n* I didn't eat the hanger steak (pescatarian) but the potato was some of the best I've ever had. \n*Everything about the trio dessert was great. The french toast was exellente.\n\nI REALLY really liked this restaurant. Aside from my little complaints, I would absolutely return and recommend this place to others without a doubt.",
        "author": "Sheila C."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-03-10",
        "description": "Stellar!\n\nJamon Iberico Bellota - This needed to be more red, more fresh. Now I've been to Spain. This doesn't quite compare, but it's damn near close enough and I'll take what I can get on this side of the world as an imported item. It needed to be more glossy with natural fats oozing out, and the taste is supposed to melt more like butter. This ALMOST did that, but didn't. Still, I'll take this over Jamon Serrano any day (usually way more salty). I'm giving this 3/5.\n\nPulpo Teleferic - The octopus is TERRIFIC. Cooked perfectly and tastes absolutely amazing! Incredibly tender, and also had enough of that bite for it to be texturably pleasant. The potato puree is also a nice touch and balances it perfectly.\n\nSquid Ink Paella: I'm a fan of squid ink paella in general, and it's challenging to make right as it's easy to make this overly salty with the combination of savory ingredients. Luckily, this was not the case here and the collection of octopi, shrimp, cuttlefish made this super delicious! I did liberally douse the paella with lemon, which helps brighten the flavor more. Also, be sure to check your smile after. There may be evidence of your savagery.\n\nGin & Tonic. Okay, Spanish G&T is just on another level. The aromatics and taste is light and refreshing where it's easy to get carried away if you're not careful. Take a whiff, enjoy the subtle aire of the garnishes: lemongrass, basil, elderflower, rosemary, the nuanced aroma and then guzzle the sparkly, delectable taste...now repeat. It's easy to repeat.\n\nOverall, I need to do a second take. Coming back for sure.",
        "author": "Dararith L."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-03-09",
        "description": "My friend and I sat at the bar for Saturday lunch.\nWe didn't make a reservation so there was limited seatings available for us as the weekend seems busy for them.\nWe had Grilled Octopus, Brussel Sprout, and Gambas. Octopus was cooked perfectly and the Brussel sprouts were seasoned just right. They go very well with Sangria I ordered.\nThey have great modern atmosphere inside and also outside seatings available.\nI would love to come back and try some of their bigger dishes next time.",
        "author": "Jen C."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-02-17",
        "description": "I'd been wanting to visit Teleferic Barcelona for weeks now upon hearing rave reviews from others who had dined here previously. I was pleasantly surprised to find out we had valentine's day reservations, as I usually prefer to stay in and avoid the crowds. We were seated quickly and the staff was very accommodating by providing us with a table that was easily accessible for my injured partner on crutches. \n\nWe started with their signature sangria and the ham and cheese croquettes- they melt in your mouth. So gooey, so delicious. Next up- the patatas bravas which were hot and crispy and paired with a delicious aioli. The chicken empanadas were unlike any I'd previously tried. They weren't as dense and were shaped more like a crispy pancake instead of the typical crescent shape. Savory but not as similar to traditional argentine empanadas. The highlight of the meal for me was the pulpo! That grilled octopus and potato puree were to die for! Perfectly sauteed and seasoned. \n\nFinally, we finished with the meat and mushroom paella. Now, I've never been to Spain so I'm not sure how this compares but this was the only letdown of our meal. The rice to meat/mushroom ratio was laughable. There were probably four thinly sliced mushrooms in the entire thing. It was mostly crispy rice. I would not recommend this dish and would never order it again. $34 for a heaping pile of rice with a bite of meat and mushrooms? Yeahhhh, no thanks. I'd think the paella would be the star at a Spanish restaurant but not the case. I'll just keep thinking about that octopus.",
        "author": "Amanda R."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-18",
        "description": "EXCELLENTE TRABAJO.\n\nThese are the precise words that sputter from my mouth after every bite I had at Telefèric Barcelona.\n\nI have no choice but to give my stomach and jaw credit where credit is due; after all without them I wouldn't have the luxury of chewing and digesting the amazing Spanish food that comes from Telefèric's blessed kitchen.\n\nChurros as an appetizer kicks things off, and then a culinary adventure welcomes paella and a combination of groovy tapas including but not limited to: octopus, croquettes & meatballs.\n\nTop it all off with some delightfully refreshing sangria and you've got me wanting to swim across the Atlantic Ocean to Spain to satisfy an insatiable craving.\n\nEXCELLENTE TRABAJO.",
        "author": "Danny S."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-03-07",
        "description": "Major thumbs up to the food\n\nNew place, only 5 months open and they are killing it! Busy place, make a reservation. They do have some disconnect - the servers basically asked the main lead the whole night which table did this dish belong to. Giving them some slack bc they are newly operating.\n\nFood here was delicious - every dish was so flavorful - even the veggie dishes! Favorites of the night were jamon, brussel sprouts. Def need to try jamon since that's a Spain classic! The pig only eats acorns so it gives off a really unique flavor. \n\nThe place itself is a very nice restaurant and the people here are super friendly (and they're all from Spain! Whaaa?!) Definitely seems as authentic it can be within CA.",
        "author": "Vivian H."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-09",
        "description": "I have to say this might be the best Spanish food I've had in my life (and in the Bay Area- sorry Coqueta!)\n\nI first found this place from the abc7 news reporter, Dion Lim, posting on her food Instagram page, and she was damn right about this place lol. \n\nThe food is tapas style so everything is shared. We chose to quickly order our meat paella as it took 30 minutes to make, but the wait can be much longer if the restaurant is more packed (I went right at opening at 11am and by 1130am it was packed on a Sunday early afternoon). So plan accordingly and look up the menu ahead of time! We also ordered the iberico jamon de bellota, croquetas de jamon, salmon tartar, and sangria teleferic. \n\nThe paella was clearly the star and the dish was perfectly cooked and seasoned (not too salty, and the rice wasn't mushy or undercooked, just right!) I would probably skip the jamon iberico de bellota, and stick to the other tapas I mentioned, but really order the paella as it's their specialty! \n\nI was too full for dessert, but I will order it next time I'm here! \n\nI wish I could give this place 10 stars because the food and service were great!",
        "author": "Ricardo R."
      },
      {
        "reviewRating": {
          "ratingValue": 2
        },
        "datePublished": "2020-02-09",
        "description": "A group of us came here for lunch, and, despite  knowing this is the latest hot spot, we were blown away by the noise level. One moment after entering, we turned around and went outside where we could at least talk and hear each other. Actually, eating outside on a sunny day was a pleasure. \n\nThe menu was not for light eaters. As it turned out every dish was heavy with oIl. I had the vegetable paella, hoping that would be somewhat light, but it was soakiing in a tomato sauce reminiscent of Campbell's tomato soup. I kid you not. The others in my party tasted it and agreed. \n\nThe taquitos de tuna were excellent and beautifully presented; the roasted vegetable platter was laughable in terms of quantity, given the price; and the kale salad was tasty but very heavy with avocado cream, etc.\n\nThe dessert we had was vanilla ills ice cream it's crumbled chocolate wafers. A delicious idea but we had never tasted such a bland vanilla before. \n\nHigh prices. None of us are going back.",
        "author": "Karne N."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-22",
        "description": "Everything was delicious.\nYou have to be sure to book a reservation at least a couple weeks in advance if you want to be able to get in here. We were only able to get a reservation at 4:45 on a weekend. The place was already half full as well.\nTheir service was very good and the food was delicious.",
        "author": "Lawrence T."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-01-16",
        "description": "Lovely addition to Town & Country Village, that transports you out of Palo Alto and into a very cosmopolitan-feeling type of space. It's larger than expected, made up of an elegant, spacious restaurant with an adjoining market space that sells specialty Spanish gins and other treats. The menu consists of various tapas + larger entrée type dishes. Went with a group of 6 so was happily able to try an array of items and highly recommend doing that if possible. We shared the following. Note that these aren't the exact/official names, and exceptional items indicated with a *. There were a few stellar dishes, many mediocre ones, and a few duds.\n\nOctopus* - one of my (and unanimously the group's) favorites of the night. The presentation was delightful, with a nice portion of octopus on top of pureed/mashed potatoes. The octopus was so fresh and perfectly prepared, lightly seasoned and served with a very well complementing mashed potatoes. \n\nCrab coquetas - presentation again was lovely, cute little fried coquetas nicely displayed. I believe each order is 3? And we ordered x2. The table felt these were good, not remarkable.\n\nCauliflower - very yummy though not particularly special. Tasted deep fried and was decadent in a delicious way, though it does start to feel a bit heavy after a few bites from all the oil and heavy sauce.\n\nBurrata - everyone liked this but how can you really mess up burrata? Again, a dish well enjoyed but not particularly noteworthy.\n\nCorn kale salad - yummy, healthy accompaniment to all the heavier dishes we were consuming. The grilled corn and dressing added so much flavor and made the dish stand on its own, though the popcorn was a very unusual and imo unnecessary addition to the dish.\n\nSalmon - was not a fan and perhaps my least favorite item. As a huge salmon lover, was disappointed in how the salmon was prepared. It was heavily drenched in a tomato sauce and tasted dry yet wet (from the sauce) at the same time? Hard pass/do not recommend.\n\nSteak - super deliciously fatty and well-seasoned steak. A little on the salty side but very good and loved the sauces that accompanied this.\n\nLobster paella* - HUGE HIT. The paella was so delicious and full of so many yummy seafood ingredients, with the lobster obvi the star. The flavor was on point and everything you'd want from paella, with those little crispy bits mixed into the dish as well. The only thing is this portion is deceivingly small. It's pretty pricey and you think you're getting more judging from the pan, but the actual paella is only the very top, thin layer.\n\nCrème brulee - ok. \n\nChurros - was sad about these. I LOVE churros, and was so looking forward to ending the delicious meal with some churros. We added on extras so that everyone at the table could get their own churro stick (which was not necessary). The churros were oddly not sweet at all, and really desperately needed the chocolate dipping sauce it was served with to even be considered a dessert item. The texture was alright but left a bit to be desired. Would probably pass on these next time.\n\nWhile the overall experience and food were very enjoyable, have to call out the service. THE SERVICE WAS SO FRUSTRATING. Our main waiter was very nice and personable, but clearly stretched too thin between tables because he was so hard to track down... repeatedly. We ordered a lot and were trying to add orders and refresh our drinks... with a lot of difficulty. Ambiance alone would be a strong 4 stars, and food is between 3-4 stars, but the poor service and lack of attention definitely left a bit to be desired and damped the overall experience.\n\nI expect a bit more attention and better service at a $$$ type of restaurant like this. Hopefully this will be sorted out in the future as know this is a newer restaurant.",
        "author": "Kell S."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-02-18",
        "description": "Food/ambience: 4 stars\nValue: 2 1/2 stars\n\nTook my son to lunch where we were able to walk-in to get a table with a bench.\n\nPrior when we called for a dinner table, it was all booked till after 9 pm!\n\nBest to come here if someone is footing the bill... It must be the most expensive like the Mayfield next door which has been in the T&C for a long time.\n\nWe ordered 2 grilled appetizer & an entry with tasty cinnamon Vanilla creme brûlée. With taxes & tips, it came up to about $40 per person. \n\nIt's high for a casual lunch (price is not casual) & I left still a bit hungry b/c my son had most of the steak which satisfied his protein need. \n\nThe portions are small, though they call every dish as \"family size,\" it's easily consumed by one pers\n\nMost of employees seem to be native Spanish- or Portugal- speakers. Its 1st international outpost is at Walnut Creek which is unusual.\n\nWould love to go back to try a few more dishes if someone will take me lol.\n\n.........\n\nReview of 2nd visit... this time for dinner. Couldn't get a reservation so my son & I stopped by around 7 pm on a raining Sat night & saw empty tables  outside the restaurant & @ the bar.\n\nWe were led to the prime location, in front of the open kitchen! Highly recommended to witness the kitchen staff making some dishes & the executive chef Oscar checking each dish before it was served.\n\nWhen he noticed us, he asked what dishes we ordered (see photos). After we told him, he commented that, \"I respect that you know what to order (you know the dishes)!\" Lol.\n\nHe also came over to talk with us & that he'd share where to visit when we'd go visit his hometown of Barcelona. Social & calm when a staff accidentally drop a paella dish to the floor near him, he proceeded to pick up broken porcelain dish to throw it away.\n\nI like that there are plenty of staff that seem to have shifts. The waiters are friendly when you need their attention.\n\nThat night there was a special assorted seafood platter that looked interesting but the waiter said that was a lot of food (that was fit for more people in order to finish it).\n\nThe food came quickly after we ordered which made a quick meal possible. Bravo to that in a popular new eatery & may it keep the momentum!\n\nBoth boy & I thought the pork steak dish could be done less greasy.\n\nAfter the dessert, we were no longer hungry.\n\nBy the time we left, after an hour later, there was a line waiting to be seated! \nThis upscale eatery is popular than ever as reservations are highly recommended, otherwise doing the walk-in for a table is a risk as we've found out in one evening. Patrons have to be turned away.\n\n\n\nPeople do come in late for dinner. Go eat earlier if you can, better chance to get a table sooner. Have fun seating by the open kitchen area watching all the action happening in front of your eyes.\n\nPaella takes about 45 minutes (!), perhaps pre-order it before your arrival if you have a reservation. So hopefully we'll get to taste it on the next visit with others' wallet as it is an upscale place, price wise. It was about $50 per person for dinner, with a non-alcoholic be",
        "author": "Christine H."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-01-03",
        "description": "We found Teleferic Barcelona by both good fortune and excellent service.  I had seen it on Yelp's Hot List and had been recommended to try by several friends. \n\nThis New Year's Eve, I had to work late, but found out that I would be free later in the evening.  \n\nLast minute reservations aren't what you expect at a popular, newly opened restaurant like Telefèric Barcelona, but by pure happenstance, I saw an opening and made a same day reservation. \n\nI was very skeptical of it being correct and more so when I received a phone call regarding the credit card reservation prix fixe meal and the possibility of a table used in the patio.  I tried calling back but I was working and the line was either busy or went to a voicemail that I didn't expect to be checked until after the busy restaurant day. \n\nWe decided to show up early, see what happened, and I'm so happy we did.  \n\nThe hostess quickly found our reservation, informed us of the prix fixe meal (which we were ok with as it looked delicious) and then had a puzzled look on her face.   It was clear that we may have been an extra party and they discussed internally and somehow found an extra table.  No, we weren't outside in the cold (which I had been preparing myself for) but in the middle in a great table among other lively and excited guests. \n\nShortly before reservation time (again I had only chosen 8:15 pm as I worked late or I would have chosen the 6 or 7 pm time also shown), we were all lead in and the restaurant was packed with many in a festive mood.  As soon as I saw the menu, I could see why.  Our great Barcelona Bash menu:\n\n* Complimentary Beer, Wine or Cava (like champagne)\n\n* 40 month aged Jamon Iberico Bellota with Spanish Cheese selections \n\n* Iberian Steamboat Oysters with Jamon\n\n* King Crab Croquetas with Ahi Sashimi and Caviar\n\n* Galician Octopus with Smoked Mashed Potatoes \n\n * Beef Carpaccio with Shaved Manchego Cheese\n\n* Catalan Steak with Demiglace and Jamon Iberico \n\n* Basque Salmon Stew with Gulf Prawn, Clams and Potato \n\n* Trio of Dessert with Churro, Chocolate and Torrija\n\nWe loved our server, who invited us to return for other signature dishes like the paella, and the food was delicious and very authentic.  For those that don't know, Teleferic is from Barcelona where they have several locations (my brother visited one which we found out by happenstance on his Spain trip) and this Palo Alto location is their second US outpost after their successful one in Walnut Creek. \n\nOverall, we had a great experience and really loved our meal here.   It's a significant upgrade from the prior tenant (Calafia) both in terms of food type and energy.  Oftentimes, it's the little things and this time we were very happy to celebrate New Year here. \n\nLook forward to returning soon.  Teleferic Barcelona accepts credit cards including American Express.",
        "author": "Randy F."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-03-13",
        "description": "I wanted to like this place a lot. I went into it with high expectations but unfortunately left with a taste of mediocrity. At first glance it was a lively restaurant on a Thursday night and the menu items seemed like a typical Spanish tapas place. I've been to quite a few and really love tapas in any cuisine but Teleferic just couldn't cut it for me. I would not say this place was bad or anything, it just wasn't great. None of the dishes made me go wow that was really memorable or I must come back here to try that again!\n\nWe ordered the octopus (pulpo), brussel sprouts, chicken empanadas, oysters, and the pork belly. That was what I would rank from best to last in terms of favorite items. The octopus had a nice smoky truffle flavor to it with the purée and the texture of the octopus was crispy on the outside but juicy on the inside. It was just one tentacle though for 18$.. places like these you get quality over quantity. Which brings me to the chicken empanadas that was nice and crunchy on the outside but not much meat on the inside. The oysters were minuscule and tasted like cucumbers. Refreshing but not worth it. I liked the brussel sprouts because the aged cheese and lemon was a nice touch to it but you really can't mess up brussel sprouts. I really didn't care for the pork belly as it was a little dry to me and the flavor was very ordinary. \n\nI probably won't make a trip out here again but I'm glad I tried it out. Service was good and the vibe was nice, but maybe I'm spoiled by Lolinda in SF.",
        "author": "Denise W."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-01-01",
        "description": "I've been really missing Spanish tapas and am so glad my friend told me about this place. I was so sad after our meal because I didn't want to leave. \n\nOn google it says reservations required but I asked about it and they said it's recommended but not required. They do accept walk in  but it's not guaranteed if it's busy. We came right when they opened for lunch and there was no wait. You can also do reservations via open table. \n\nI love the atmosphere, the booths were so comfy! Everything from food and drinks were visually stunning. I got to try my friends drinks 'the Catalan G &T' and it smelled and tasted wonderful. I would totally order that next time I go. \n\nMy favorite dish was octopus, it was perfectly cooked and the sauces complemented it. Highly recommend it!\nAnother recommended dish is the squid ink paella. We ordered that right when we arrived because it takes 35-45 minutes to cook. Our dishes slowly arrived one at a time and the waitress did say that their dishes purposely come out one at a time because that's the way tapas are meant to be eaten. Sooo if your impatient like me and want everything out at once or you don't care about how they time it, I would have just asked them to bring it all out.",
        "author": "Marlana Y."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-03-13",
        "description": "Recently went to lunch here.   Had the lobster croquettes, roasted cauliflower, kale and corn salad and the garlic shrimp dish.  There were two of us and this was about the right amount.  We probably could have done with one more dish but we were satisfied with sharing these.\n\nThe croquettes come in a pair.  I seriously could've eaten both myself.  Lightly breaded with a bit of ahi on top.  They are small and bite sizes but a nice appetizer to get the palate going.\n\nThe roasted cauliflower was the most flavorful\nOf the tapas we ordered.  There's this cheese foam.  Literally like a foam or mousse on top.  Really delicious dish.\n\nThe kale and corn was fun--they even put pop corn on top as a garnish.  This is a great sized salad to\nShare if you want to make sure to get some greens on the table.  Kale was delicious and not bitter like some places.  The roasted corn added a different texture and flavor and there were some crunchy chickpeas in lieu of croutons.\n\nThe underwhelming dish was the giant prawns.  The server suggested we get it with the bread because the butter/oil and garlic was supposedly so delicious we'd want to dip the bread in it.  Nope!  It was just a bowl of oil with barely any garlic flavor.  The prawns didn't really taste garlicky even if I tried to swirl the segment in the oily sauce.   If the prawns were savory and garlicky delicious, I would've given this review 5 stars.\n\nThat said, the staff were attentive and I saw other dishes pass me that I know I will want to try when I return.",
        "author": "R M."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-01-21",
        "description": "4.5 stars!\n\nCame here on a Tuesday for a team lunch! We made a reservation for 11, but it wasn't really necessary because the restaurant is decently large! Overall the food was fantastic, service and staff was friendly, and the decor (modern) and ambience inside was great!\n\nSince this is tapas, we shared almost everything! We shared the regular tapas and the large tapas! I had the fortune of being able to try many dishes including the Patatas Bravas, Pulpo Teleferic (grilled octopus), Catalan Flatbread, Catalan Premium Tomahawk (40 oz), Brussel Sprouts and the La Burrata! They all exceeded my expectations and were extremely delicious, well balanced flavors and presented very aesthetically. \n\nThe Patatas Bravas was surprisingly good! It's just crispy potatoes with Brava sauce and aioli. It was savory and rich and we couldn't get enough of it. The pulpo teleferic (grilled octopus) was great too, maybe a bit slightly overcooked, but still grilled very nice, it was crispy and crunchy on the outside with a nice soft chewy layer on the inside with a pretty tasty puree made from truffle oil, paprika and potatoes. Finally, the la burrata and the brussel sprouts stood out because they were beyond what I expected, the la burrata had figs, nuts / seeds and basil dressing that made it tastier than usual and the brussel sprouts came with aged cheese, whipped butter and a lemon & honey dressing that stood out as well.\n\nFor dessert we had the top trio selection which comes with the churros, choco magic and the Torrijas (french toast). The choco magic (chocolate ganache) was the winner of the desserts, it had the perfect sweetness, texture and tastiness, while the churro was my next favorite because it was crunchy on the outside, seasoned well and you dip it in a chocolate sauce that makes it taste magical!\n\nOh yes, the drinks were fantastic too! Almost forgot to mention them! I had the Sangria Teleferic and it was really good, you didn't even taste the alcohol but it came with red wine, gin, brandy, berries, cinnamon and mint! They also had a few other tasty looking drinks!\n\nOverall, it was a great experience and I'd definitely come back! The price is definitely a bit more than I expected, but when you share everything it comes out okay in the end!",
        "author": "Christopher L."
      }
    ],
    "servesCuisine": "Spanish",
    "priceRange": "$31-60",
    "name": "Telefèric Barcelona",
    "address": {
      "addressLocality": "Palo Alto",
      "addressRegion": "CA",
      "streetAddress": "855 El Camino Real\nSte 130",
      "postalCode": "94301",
      "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media0.fl.yelpcdn.com/bphoto/CDwz1S4eiNWOJhdMhPuLjQ/ls.jpg",
    "@type": "Restaurant",
    "telephone": "+16503210512"
  },
  {
    "aggregateRating": {
      "reviewCount": 41,
      "@type": "AggregateRating",
      "ratingValue": 4.0
    },
    "review": [
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-03-15",
        "description": "We ate here Friday night. Ordered a ton of items because everything sounded so good. We were not disappointed. Every single item was outstanding. \n\nSome of our favorites were the sesame leaf, Ettan salad, black cauliflower, and mushroom pot. \n\nThe butter chicken was great but on par with good butter chicken at places like Amber. \n\nPresentations were gorgeous, the space is modern, hip and well lit. Really nice atmosphere. \n\nOur service was attentive, helpful and top notch. The chef sent us complimentary fried chicken after we devoured what we had. \n\nBc of coronavirus, the place was not full and the volume level was still pretty high. My only concern might be noise when it's packed, as it's a big space. \n\nOverall, awesome experience and a standout spot for Palo Alto. We've also tried Rooh and it was no where near the same league as Ettan.",
        "author": "Daniel F."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-03-15",
        "description": "This restaurant is only open for dinner.\nLast week we couldn't even get the table in this restaurant. Yesterday more than half of the restaurant was empty due to coronavirus..!\n\nThis is a very good fine dining restaurant.\nThe waiter tried to make a sweet and sour non-alcoholic mocktail and it felt like tropicana. \nMonkey buns -- Freshly made and topped with the spicy powder(podi) comes with sides butter and eggplant chutney.\nVada -- Ok - served with base chutney and asparagus.\nKerala Fried Chicken was bland.\nMushroom pot -- Comes with idiyappam and gravy on the side. This was delicious. Cauliflower rice was used instead of regular rice.\nCoconut Rice -- Ok\nChicken curry -- Ok. There was nothing special about this curry other than the presentation with a big chilly.\n\nI really appreciate their effort to create a fusion version out of Indian cuisine but only the desserts really deserve a 5* rating. \nBest desserts..!\nI hate sorbet and my friend hates grapefruit but surprisingly the dessert item, \"Pink Guava fruit with sorbet and grapefruit\" was delicious.\nThe \"dark chocolate dessert\" was also very delicious.\n\nThis restaurant turns out to be the most expensive Indian restaurant I have ever visited so far..!!",
        "author": "Krishna M."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-03-15",
        "description": "Last night we made it to Ettan.  I tried to book a table for 5:30 online and it told me every table was booked within a two and half hour range.  Looked solidly booked but I tried a call anyway.  Left a message and they called me back letting me know we had a table. When we arrived we were surprised to find them wide open. Case in point: don't rely on the online reservation system.  Call to get your table.  \n\nInside is plenty elegant - brand new. Glam factor is turned up. Beautiful two stories with seating on the second floor.\n\nSouth Indian ownership.  Our waiter was from Nepal and he had a pretty good knowledge of menu, flavors, ingredients etc.  His recommendations were good.\n\nMONKEY BREAD (5/5)  Serving size looks large in the pictures but when they arrived to the table I was relieved to find these are mini.  They're perfect for a few small bites to share between two.  Served warm with butter and an eggplant chutney.  Less sweet than other Monkey bread I've had previously, but delicious all the same.\n\nSESAME LEAF CHAAT (5/5)  Star of the night.  Fireworks on the palate.  If you have not experienced chaat, this dish might not appeal to you.  It took me some time, actually years, to fully appreciate chaat.  But this one took me to a new level. Presentation was exquisite, art on a plate. Lovely in every sense.  Chaat lovers, order this.\n\nPRAWN CURRY (2/5)  Slightly disappointed in this one. Prawns are usually larger and bit sweeter than shrimp.  These I'm sure were shrimp, which is fine, but they tasted farm-raised with very little texture or flavor. I don't really care about whether I'm eating a prawn or a shrimp - I love both - but I find I can't stomach the farm-raised variety.  The curry sauce was nice but the prawns were small and no good in my opinion. \n\nKERALA FRIED CHICKEN (5/5)  My wife is from Kerala so we felt compelled to order this.  Garnished with caramelized shallots and green apple pieces, the chicken was tender and delicious. Nicely breaded and great color on the fry.  Getting picky now..part of the garnish included these randomly cut pieces of raw lettuce. What? Weird. I removed them before taking a picture. Uncharacteristically amateur for a kitchen of this caliber.\n\nCHICKEN PULAO (3.5)  This one was good, but somewhat ordinary.  I suppose if you've never had pulao or biryani before, you might try this and be impressed.  It was definitely not bad, but not great and for that reason, I wouldn't order this again.\n\nCHAI SOFT SERVE (3/5) Our waiter was trying hard to steer us to two other desserts on the menu, and we ignored him and ordered this one.  Bad move. It wasn't great.  I guess the chief complaint being that it was too one note - the strong chai flavor standing alone, with a few lonely, crunchy cereal bits on top.  This dessert I think could be rescued by swirling this chai with vanilla to offset the chai.  Or give it some texture by serving it with a bit of cake and whipped cream or creme fraiche.\n\nThe cocktails were on point - talented bartender.  The service was also good.  The ambience was also great although we were in a corner.  Next time we'll request a table deeper inside the restaurant where we have more of a view of the beautiful decor.",
        "author": "Darien R."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-24",
        "description": "Like a creepy stalker from a Lifetime movie, I've been peering through the tarp since construction started for Ettan last fall. \n\nGood thing no one called the five-o because that would be embarrassing. The last time the cops were called on University Avenue, an entire squad of cars showed up in 2 minutes. In SF, you're lucky if one cop shows up 2 hours later. \n\nWhile SF is completely lacking in five-o presence and has their issues, there's no denying that THE city has the best restaurants. Period. \n\nNow, PA is getting some love from a two Michelin star chef from SF's Campton Place. \n\nOpening on Friday, Ettan is the new PA hot spot off University Avenue (formerly Three Seasons) serving Californian Indian Cuisine. The food is fabulously unique while striking a balance of bold yet approachable Indian spices. \n\nFirst things first, reservations are a must. As a brand new restaurant, they don't want to overbook tables during their infancy. Not only does it overwhelm the FOH and BOH, quality may decline which leads to unhappy customers. \n\nThe menu comprises of Snacks, Housemade Breads, Small Plates, Large Plates, and Desserts. Vegetarian, vegan, and gluten-free friendly. For drinks there's cocktails (w/ zero proof), beer, wine, tea, and coffee. For a multi-course meal with drinks, expect to spend about $100 pp for a nice sit-down meal. \n\nOur order:\nD  R  I  N  K  S\n* Clean/Dirty: Gin, sherry, vermouth, celery ($15): https://bit.ly/2TaOBz1\n* Just Like Monkey: Gin, mezcal, cilantro, lime, avocado ($15): https://bit.ly/3c6EFz0\n* Vesper: Gin, vodka, lillet (OTM: $15): https://bit.ly/2HPuC3N\n\nI was impressed with their bar program here. A mix of classic and creative cocktails that are stiff but very well-balanced. I enjoyed all three but my favorite was the one recommended by owner, Ayesha...the Clean/Dirty, their take on a dirty martini with a caper berry. Ideal for those who hate olives like I do. \n\nF  O  O  D\n* Housemade Signature Monkey Naan w/ balchao shrimp ($16): https://bit.ly/2I3bCyV\nServed piping hot, the monkey naan was buttery and pillowy soft. The mildly spicy and tangy balchao shrimp was a nice accompaniment to the buttery bread.  \n\n* Sesame Leaf w/ chaat accoutrements, mango, sesame chikki, sev, cilantro (3 pc - $14): https://bit.ly/39YJDfy\nFantastic textures, flavors, and temperature contrasts. If you love chaat, this is a must order.\n\n* Hot Stone Lamb: Marinated lamb cooked on hot stone, pickled onions, fennel salad, lime raita ($17 +$4 fermented chili sauce): https://bit.ly/39XKhKc\nNicely spiced and tender with kiss of smokiness. I like it spicy so I had to try their housemade fermented chili sauce. Good heat with depth from the fermentation. \n\n* Kerala Fried Chicken w/ baby shallots, bird chilies, buttermilk, green apple ($15): https://bit.ly/2PkmNXE\nLike a spicy Indian take on katsu but elevated with the crispy shallots and sour apples. I drizzled more of the fermented chili sauce on top to make \"hot chicken\". \n\n* Local Black Cod: Roasted Cauliflower Leafs, collard green masiyal, green mango rice, kokum curry ($33): https://bit.ly/2STDVpn\nI normally don't order cooked fish but this came recommended highly recommended. No regrets. The black cod was incredibly moist and flaky, and I appreciated the robustly spiced kokum curry was served on the side so it doesn't overshadow the delicateness of the fish. \n\nD  E  S  S  E  R  T: https://bit.ly/2wLtc8d\n* Ettan Kheer w/ saffron, milk crisp, mystery++, cashewnut, cardamom ($10)\nThe secret \"mystery\" ingredient? Onions. Bizarre but it works. Not rice heavy like the usual kheer. \n\n* Dark Chocolate Cake w/ chocolate velvet, citrus, grapefruit, EVOO broth ($12)\nThe owner was kind enough to provide this on the house. If you like chocolate, get this! Good balance of bitter richness, not overly sweet. \n\n* Pink Guava w/ caracara, cardamom, lime sorbet, fennel fronds ($12)\nThe panna cotta like dessert was very refreshing and tropical. \n\nService was excellent. I called several days before my reservation to see if the outdoor patio will be open because I had TT with me. It isn't for several more months but Jonathan, the GM was kind enough to accommodate us. The owner is very hands-on, making her rounds to ensure diners were enjoying themselves. The FOH staff were on their A-game making sure food orders were promptly delivered, empty plates were cleared, and new plates/utensils were changed between courses. \n\nThe multi-level restaurant is modern, beautiful, and inviting. The main dining area has a veranda that opens to the heated courtyard patio (dog-friendly) which will be great during the spring and summer months. Ideal for date night, happy hour, and large parties. \n\nEttan is an excellent addition to PA, bringing their inventive California take on Indian cuisine (not a fan of Rooh) and I think may be a Michelin star contender. It's one of my top three restaurant choices in PA (along with Protégé and Telefèric Barcelona) that's worth the drive from SF or Man Jose.",
        "author": "Cherylynn N."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-03-05",
        "description": "Interior design - 10 out of 10. Finally a glamorous romantic new los angeles-esque spot. \n\nWine - great list. Classics. Corvins. All of it.\n\nService - not good. Forgot drinks. Didn't come to our table for 25 min when we sat down. but standard confused and insecure for just having been open a few weeks.\n\nDessert - light, fluffy and flavorful. The passionfruit dessert was perfection. I look forward to trying more!\n\nDinner - lord help. It is all extremely salty and spicey. Not sure what the ingredients were in any dish. When I eat cod, i want to taste fresh cod..not twenty overwhelmingly salty spices.\n\nEVERYTHING TASTES LIKE A SUPER SALTY MASH OF TOMATOES, CILANTRO, GARLIC AND SOME SORT OF SWEET SAUCE. i realize the ingredients are probably more sophisticated than that.. but i can only describe what we tasted.. Ya know that taste when you mix sweet orange juice and pepperoni pizza? That is the pukey taste i had in my throat for 4 hours after the meal. \n\nI will admit that presentation is lovely. But the food needs help. \n\nThey said their sesame leaf salad is a staple, but the leaves were hard as plastic under the mix of 15 random ingredients on top. \n\nI couldn't tell if their proteins had quality ingredients or not because there was more salt and random seasoning on each one than you'd find on a plebeian Dorito chip (although doritos are tastier than this dish).. \n\nPerhaps they want to showcase all of the lovely flavors they're working on.. but it needs to be more pure and less muddled. \n\nExecution would be much more successful if:\n1. You could taste unique flavors rather than a medley of every spice ever invented!\n2. Servers presented the dishes with some mild narration rather than dropping them off like you're at a panda express.\n3. Dishes were named more simply on the menu.. there is a lot of verbiage that's confusing on the menu.. when you ask the servers what it means, you realize the dish is standard paratha or raita etc. \n\nBe purer! No pretense. People want real food! Look at how booked out Evvia is!! It survived all of the fancy trendy nonsense places. \n\nEttan can be a classic for business lunches and anniversaries etc. But cut the nonsense please. \n\nI think this place will improve with trial and error. And i'll be back for the dessert and wine!",
        "author": "Lera D."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-22",
        "description": "OPENING NIGHT!  Phenomenal!!!  From start fo finish, we had a fantastic and fun evening!  There's always a little leery voice inside me about opening nights or even soft openings at big splashy restaurants.  Need not worry about that here.  Everything from food to service was seamless and virtually flawless.  In fact, our experience with the food and service on their big night was even better than what we've experienced at restaurants of similar caliber that have been around for years!\n\nThe beautiful and gracious co-owner, Ayesha, was there to greet us and oversee her opening night.  She checked in with us throughout and was very open to feedback.  They truly care, and it shows.  Look very closely at the details and you'll see they spared no expense on the decor with quality furnishing, ceramics, cutlery, and art pieces.  LOVED the look and feel inside this gorgeous space so much so that we spent nearly 3 hours here leisurely and happily enjoying every bit of our multi-course dinner.  \n\nExcellent food!  Definitely start off with the Monkey Bread.  These slightly sweet and fluffy mini pull aparts were so delicious we enjoy them plain, but they come with their house-made butter and tasty chutney.  Get these!!  Also really enjoyed the unique Green Asparagus Vada, which comes with small pieces of asparagus and just enough spice to grab your attention.  We couldn't come and not try their signature Whole Roasted Snapper.  Yes, pricey at $85.00, but fresh and moist, as they get their seafood daily.  I liked that it's served with the head and tail intact, but deboned, which made sharing super easy, but just wished the skin was crispy.  I'm glad we tried the fish but would likely opt to sample other dishes next time. \n\nSave room for their desserts!  The Passion Fruit was light and so refreshing.  We didn't think we'd like the Masala Chai Soft-Serve, but we ended up loving the combination of the chai and caramel.  Neither was too sweet, but yet so flavorful!  Save room for these!  Like strong coffee? Hubby loves a super-strong cuppa joe and really enjoyed their Moshka coffee.\n\nThey were definitely well-staffed for the night with very cordial staff.  We were more than pleased with the professional service we received from our server (Lorrin B., according to the receipt).  He even so kindly offered to take photos of us outside the restaurant as a memento of our fun night.  Now, how often is such a nice gesture like this offered?  Like never.\n\nTheir chef hails from San Francisco's famous 2-starred Michelin restaurant, the Campton Place (Campton Place Hotel).  At Ettan, he has already perfected unique dishes that elevate Indian food with an added modern California twist.  The creative food was definitely on par with what you'd find at the high-end Campton Place.  Everything we sampled was well executed without being overly salted or seasoned.  Don't come looking for standard Indian buffet fare because you'll get so much better quality and aesthetically presented unique foods here!  My Hubby, who has never been a fan of Indian food nor many ethnic restaurants, totally loved the food and vibe here!  In the middle of dinner, he proclaimed he had already spied other dishes he wanted to try and definitely wants to return asap... totally unexpected music to my ears!  It's great to see Ettan widening the appeal of Indian food.  I've already started recommending Ettan to all my food-loving friends, and last I checked, they're already booking up fast!  \n\nTIP:  Try to snag a table on the main floor where the vibe is super lively and fun.  If you want a more intimate affair, try the upstairs instead.",
        "author": "Lori N."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-23",
        "description": "My family enjoyed a terrific meal at Ettan and we are all thrilled to have this great new upscale addition to the downtown Palo Alto restaurant scene.\n\nThe location just off University and Bryant offers extensive outdoor seating tucked away from cars and pedestrians and the interior is attractive with many colorful patterns and a spectacular skylight. The second floor also offers great space for private events. \n\nThe drink, appetizer and small and large entree plate menu offers a mix of fun and interesting bite size snacks to a beautiful whole snapper.\nWe were lucky enough to meet the chef, Srijith Gopinathan, and get some suggestions before we ordered, but judging from the several choices we tasted and the feedback from other diners, I can confidently say you can't go wrong here!\n\nWe started with the \"breads and stuff\" and enjoyed the Monkey Naan and Black Truffle Stuffed Kulcha. I resisted the temptation to order more of both before the small plates arrived because I'd already made the decisions we would be coming back and I wanted to try as much as possible! I thought we were then going to move on to the Small Plates: Ettan salad, the sesame leaf, the sambal shrimp and hot stone lamb but thankfully our waitress decided that we really should also try the little sliders with tender jackfruit. She was correct and those are a must order appetizer.!!!!!  The small plates were a strong warmup to the large plates and delivered on flavor, presentation and complexity and variation of texture.  \n\nMy 90 year old mom never passes up a whole fish and the Whole Roasted Red Snapper arrived fully deboned on a plancha with coconut rice and curry.  As Large Plates we also had the lobster and the chicken curry along with the spiced eggplant and malabar paratha. All were simply outstanding.\n\nFor dessert we tried the passion fruit with litchi milk ice and meringue as well as the dark chocolate and pink guava. Everything was delightful.\nI've included a few pictures including my mom with the Whole Snapper!\nWe'll definitely come back to Ettan and Palo Alto clearly has a new standout upscale restaurant!",
        "author": "Jonathan R."
      },
      {
        "reviewRating": {
          "ratingValue": 2
        },
        "datePublished": "2020-03-13",
        "description": "The service was very good and the food is the USP here. Very tasty and very unique. \nWhy only two stars?\nInstead of diet Coke they served regular with my rum\nThey gave a cramped seat in between two tables. Check pictures! \nIt didn't ruin my experience but there were other tables empty! I wonder why I  was pushed to this cramped table.",
        "author": "Dharmesh M."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-03-06",
        "description": "Right from the entrance to the food, this place was an absolute delight. We were a group of 5 and made reservations a week in advance- recommend making a reservation at least 3 days in advance, seems to be a highly popular spot. \n\nDrinks \nGreat original and contemporary cocktails. We tried a few and easily the 'smoking aces' was an instant hit for me. They have a pretty good selection catering to most of the popular choices. Try 'into the woods' too if you can. \n\nAppetisers \nWe tried 80% of the appetisers. Every dish had great presentation, taste and plating. The twist to the usual South Indian cuisine was very refreshing and serves 2-3 people in portions. \n\nRecommended dishes : sesame leaf, black pepper cauliflower, green asparagus Vada (amazing!) and the cast iron monkey naan. \n\nMains \nWe tried the wild mushroom (very interesting and definitely recommend), mung bean paneer with malabar paratha and idiappam to go with it. \n\nDesserts \nPassion fruit (instant hit) \nMasala chai soft serve \n\nAgain, don't miss this spot. Great ambience, drinks, food and overall experience. Highly recommend!",
        "author": "Shashank B."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-03-07",
        "description": "Beautiful decor!! Perfect for a special occasion. We ordered vegetarian and the small plates were the best in this order - curry leaf salad ( refreshing flavors) , monkey naan with the homemade butter and eggplant chutney, sesame leaf chaat (crispy, and tangy and not too filling) and asparagus vada (no twist to the Indian fried dumplings except that it had shavings of asparagus on the top. Would have liked more of the spread with it.) They forgot to get us the kale chutney which we had ordered for the monkey naan! \nFor the mains, we ordered the mung bean paneer which comes with the green onion naan bread. Personally not a big fan of this dish ; it seemed like a vegan version of saag paneer.\nFor desserts, we got the dark chocolate which was absolutely decadent with just the right tang from the citrus. Would love to go back and try the other desserts and mains!",
        "author": "Shraddha M."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-03-04",
        "description": "I had to check out Ettan when I heard Chef Srijith was part of this new venture. They just opened so I was looking forward to it. I made reservations through OpenTable and was seated instantly upon arrival. The restaurant has an authentic vibe and a great ambiance (and in my opinion, probably one of the best in the Bay Area for Indian restaurants). \n\nThe menu was different and I'd recommend checking out both the dinner menu and the bar bites menu for snacks. I enjoyed the Tender Jack Vada Pav from the Bar Bites menu. I'd suggest trying the ricotta cheese stuffed kulcha, sesame leaf, mung bean paneer and the malabar paratha from the dinner menu. The food was good and vegan friendly but I wish there were more vegetarian options.\n\nDessert Menu had a lot of great options too. So make sure you still have room to try one. 5 Stars for their great service, nice ambiance and a unique menu. This is a nice addition to Palo Alto!",
        "author": "Krithic A."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-28",
        "description": "The best Indian food in bay area. Period. Each and everything we ordered on the menu was unique in flavors, presentation and ingredients. \nFor the first time ever, my husband and I were on the same page about Chaat, else it's too sweet for him, too tangy for him.. but this one was perfect. Try the sesame leaf Chaat.\nThe monkey naan, kulcha and regular naan were perfect with fermented flavor and baking done just perfectly. \nI don't eat mushrooms, but here, I did. Dal makhani was good. And the vada pav finished before I could blink my eyes. I want to go back for things I missed on the menu. Only underwhelming thing was saag paneer, which was vegan, but I didn't like it much. \nCauliflower was great especially their buttermilk sauce with it.\nTry everything  you can from bar bites, small plates, large plates, accompaniments. \n\nKheer was awesome and so was a coconut dessert we ordered. So much more to go back for.",
        "author": "Neha G."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-02-29",
        "description": "First visit here, a nice place with an interesting menu, definitely not the regular Indian fare one is accustomed to.\n\nGood food, Service was good, overall a good experience.\n\nGood luck to them as it has been only about 5 days since their opening.\n\nReservations recommended.",
        "author": "N A."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-03-13",
        "description": "When Cherylynn N gives a place 5 stars, I know I have to try it. Ettan opened not too long ago and reminded me a bit of Rooh, which we also tried a few weeks ago. It's nice to have some new Cal-Indian options near University. \n\nI hadn't gone to Three Seasons in many years, but they re-did the space nicely with more modern decor with an Indian touch, and there's a nice indoor/outdoor feel with the patio. \n\nThey have a full bar, and they have Coravin options for wine, as well. We went with a Syrah for Indian food. \n\nFood:\n- Ettan salad: with fermented curry leaf chutney, pickles, lots of seeds and nuts. The presentation and the mixing of the salad reminded me a bit of a Burmese tea leaf salad  \n- Black Pepper Cauliflower: fried cauliflower with black mustard and starfruit. The cauliflower texture and flavor were great - very meaty while being vegetarian.  \n- Stuffed kulcha: we chose the jalapeno one; it was nice and fluffy and was quite spicy. The kale chutney on the side was nice.  \n- Ettan Chicken Pulao: biriyani with chicken served in a clay pot - very flavorful. It comes with a roasted pepper gravy and kiwi raita on the side. The kiwi was an interesting twist on the raita. \n- Prawn curry: coconut and kokum curry, served with rice on the side. The prawns were very tender, and the sauce was great for dipping. The sauce was rich and flavorful but not too heavy.\n- Naan: more like a lavash, served warm \n\nPortions aren't huge, but it allowed us to try a lot of different things. The cauliflower was probably the highlight for me, but all of the dishes were solid. It's definitely a nice addition to the downtown Palo Alto food scene.",
        "author": "Marilyn T."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-03-06",
        "description": "When I first passed by this place, the decor was so attractive that I had to stop! My friends and I reserved a table ahead of time because it gets pretty busy. \nFood: Mindblowing - the dishes were an interesting take on Indian fusion. The asparagus vada and sesame leaf chaat was so good we ordered extra. Our server recommended we try the shrimp chutney with monkey bread - tbh, I'm not a fan of seafood and somehow it was a meal I could totally make an exception for. The chicken pulao and the idiyappam dish simply transport you back home. \n\nAmbience: Great lighting, and a cosy feeling while not feeling cramped. I loved the popular indian-techno music that was playing, haha. It'd be great for date night or for celebrations with friends. \n\nCost: Quite reasonable compared to the other pricey Indian restaurants that don't even take an effort to be innovative (looking at you, Sakoon).",
        "author": "Shabnam S."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-22",
        "description": "Wow wow wow! Where to start? I always reminisce of the high quality, delightful Indian food that you find in London. For years my wife and I have been trying to find those flavors and finally we found it.\n\nWe came here on the second night it was open. The service was impeccable and the waiters were knowledgeable.\n\nFor appetizers we tried the sesame leaf, cauliflower and monkey bread. For entrees we had the mushroom one pot and the cod. All the dishes were so flavorful. The cod was cooked to perfection. The wine selection is fantastic. We had the soft serve for dessert. \n\nThe decor and ambience, lighting and music were perfection. Clearly a lot of time and energy was put into launching this project.\n\nI am so excited that Ettan has opened up and am excited to come back. This will be the hottest reservation in the peninsula within a few months.",
        "author": "lior t."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-22",
        "description": "First people to eat here on opening night.  Food was very good.  Came out a bit slow but thats to be expected when they are just getting started.   The monkey bread was delicious and obviously fresh baked.  Sambal shrimp and octopus small plates were fantastic.   Black cod was really good!  Mushroom large plate was also good, wife loved it, I thought it was ok.  Really great addition to downtown food options!",
        "author": "Samuel T."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-23",
        "description": "Pretty happy with this place. Stopped by on opening weekend, on the late side, and they allowed us to have a drink at the bar. The drinks were quite tasty like you might expect, and we got a chance to check out the very nice decor, sniff our neighbor's food, and look at the menu. \n\nIt's kind of crazy that both Ettan and Rooh opened within a few weeks of each other. They're both similar types of places - high end indian-ish. Ettan is the more californian of the two, where Rooh seems to have bolder tastes (not spicy, bold), and Ettan has a more beautiful room.\n\nI look forward to dropping by and trying the food - you'll have to make a reservation to get to eat the food at this point.",
        "author": "brian b."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-03-06",
        "description": "Perfection! Must eat, sesame leaf and chai soft serve! The interior design is amazingly beautiful, take some time to look at the art. Suggestion call them to save the red snapper for you it was so meaty and good.",
        "author": "Karen T."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-02-27",
        "description": "Summary: An interesting additional to Downtown Palo Alto but not a favourite.\n\nThough the intention was there, the execution (for me) didn't deliver. The food was 'tasty' but dishes that I'd expected to be somewhat healthy (vegetable starters) were all (surprisingly) fried. I suppose I was expecting more of an emphasis on health and the fault was mine there. (Though I didn't eat a lot, I felt like I had a day and a half of calories just after one meal.) The environment was relaxed and nicely thought out but I think I'd describe it as 'fun' & 'eclectic' more than 'sophisticated' and 'classic'. \n\nI'm sure it will do well with a particular crowd -- just not my cup of tea.",
        "author": "Ashly H."
      }
    ],
    "servesCuisine": "Indian",
    "priceRange": "$31-60",
    "name": "Ettan",
    "address": {
      "addressLocality": "Palo Alto",
      "addressRegion": "CA",
      "streetAddress": "518 Bryant St",
      "postalCode": "94301",
      "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media0.fl.yelpcdn.com/bphoto/-8kVzjAojUw2yC_FB6QlGA/ls.jpg",
    "@type": "Restaurant",
    "telephone": "+16507526281"
  },
  {
    "aggregateRating": {
      "reviewCount": 1618,
      "@type": "AggregateRating",
      "ratingValue": 4.5
    },
    "review": [
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-04-13",
        "description": "The wait is worth it trust me!! I came here with my family a few months ago. It was there first time, but definitely not mine haha. They were complaining because of the wait so I had to keep reassuring them it was worth it.\n\nWe waited maybe an hour but it was finally out turn!! We were seated quickly, and our order came out fast. Me and my brother ordered the Red King, my mom ordered the black ink ramen, and my dad ordered the regular one. Always order with an egg, it's soooo good.\n\nThe broth is rich and flavorful, and it is a huuuuge portion of ramen. You'll walk out feeling very satisfied. This restaurant tops every other ramen restaurant in the Bay Area.",
        "author": "Joyce M."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-04-07",
        "description": "Came to this place a couple of times and the noodles are good! Not quite a fan of the wait time though, but that's understandable given to their popularity. My first time was near when they first opened, and it took maybe 45 minutes to get in. The servers were attentive and nice, but that should be a given since the restaurant is a bit on the smaller side-- hence, it adds to the wait time. I've tried all of their flavors, and they're all very strong. By themselves, they taste wonderful and very rich. Because of this, they're obviously not meant to be tasted together. However, the broth can be overpowering and can wear you down quickly. Their side dishes that are set at each table are fine, but nothing to reset your palate after a few bites of the noodles. I do love that they will give you another serving of noodles per your request.\n\nOverall, it's kinda worth the hype, but I'm not a die-hard fan eager to wait in line again for the food.\nRamen: 9/10\nService: 10/10\nRecommendation: only for first timers",
        "author": "Maria Tam T."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-04-04",
        "description": "This is definitely one of my favorite ramen places in the Bay Area.\n\nLet me tell you this, this place is SO good that I'd drive an hour (+another hour back) and then wait 45 minutes just to eat here. Yes, it's THAT good and nope, I'm not making this up. It's definitely one of the best ramens I've ever had.\n\nThe broth is so rich and flavorful, but it's not overly salty like many other places. I usually like my noodles firm and I always add an egg to my bowl.\n\nThe only thing I hate about this place is the line--the shortest I've ever waited was 10 minutes (weekday lunch) and the longest was 45 minutes (long weekend lunch). I tried lining up for dinner a few times before and it was just impossible. My husband and I hate waiting in the line and this is one of the few places that we're willing to wait, but only if it's under an hour lol!\n\nI've also been to the Santa Clara location and the wait is usually around 30 minutes (again, weekday lunch).",
        "author": "Aeris W."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-03-29",
        "description": "We did it. We finally made it. And it was worth it!\n\nI've been eyeing Ramen Nagi for AGES, but that infamous wait was just too big of a monster for us to battle. But one fateful Sunday morning, the hubby and I decided to wake up early and actually put in the effort to give it a shot. We got to the restaurant a FULL HOUR before opening and there were already people in line. SO CRAZY!\n\nBut hey, we were part of the first wave to enter the restaurant so that made us incredibly happy. Ramen Nagi clearly has perfected their system because the service is undeniably efficient. All patrons are given a piece of paper to order before entering; once inside, every party is directly led to a lettered table with everything set and ready to go; and food comes out quickly. You can honestly be in-and-out in about 30 minutes. \n\nThe hubby decided to get the Green King while I got the Red King. We added seaweed and an egg to both of ours, and shared a plate of karaage. The hubby was quite disappointed that corn wasn't an option for a topping. The portion size was more than generous and the thin, hand-made noodles were AMAZING. Perfectly chewy and delicious! The hubby's broth was delightfully interesting with its strong basil base, while the Red King was as spicy as you would expect, but it doesn't overpower the dish. The chashu was sliced paper thin and incredibly tender.\n\nOur favorite dish, however, goes to the karaage. The sweet, crispy exterior and the juicy chicken made for one of the most amazing dishes we've ever had. It was perfect! The only critique was that each piece was a bit too large, making it slightly difficult to eat. \n\nI'm so happy we finally made our way to Ramen Nagi. It's certainly worth the try and while I have no idea when we will come back, we recommend it to everyone. Just plan to stop by early, preferably at least 30 minutes before they are open. \n\nAmazing!\n\n(Visited before Coronavirus shelter)",
        "author": "Quyen L."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-03-09",
        "description": "Rating: 4.5 stars\n\n***Tl;dr***\nCame here on another elite's recommendation. Rich and buttery broth. Option to customize the broth to your preference. Option for thick and thin noodles. Generous portion size. Tasty table appetizers: bean sprouts and pickled veggies. The only bummer is that you have to physically stand in line and is generally upwards of 45 mins wait time during peak dinner time, weekends. If they fix their wait to online wait, I think this would be 5+ stars in my opinion.\n\n*** The long read***\n\nHow I got here:  A fellow Yelper and I got talking about Ramen and they recommended this place as the best ramen in the bay area. \"Bold claim\"  I thought and the only way to verify this was to check this out.  I've seen their sister branch at the West field mall and the lines are something that put me off. We decided to go here around the time they open for dinner. My friend was in the line at 5:30pm and we got our table by 6:00pm. We were given a customizable menu sheet in line. When it was our turn, our menu sheets were taken and we were ushered to our table.\n\nThe order: The ramen here is fully customizable from soup base to toppings. Here's a quick run down of the menu.\n\nSoup base: Option to choose between original (buttery), red (spicy), black(squid ink), green(pesto) and veggie broth.\nChoose between thick and thin noodles. I tried the thin one and my friend had the thick ones. I'd definitely go with the thick ones next time.\n\nYou can customize the strength of the base, richness of oil, garlic, pork options (chashu or pork belly), toppings (green onions or cabbage)\n\nYou can also add soft egg(recommended), seaweed sheet(recommended), wood ear mushroom,  extra pork etc. \n\nIf you get overwhelmed by the options or are just too drunk or high to choose you can just check the box for chef's recommendation which is everything with a dot next to it on the menu. Although if you're drunk, high or if you accidentally ate your coworker's special gummy bears, ramen may not be your best bet :P\n\nThe ambience: Once you're inside this place has a vibe of a traditional Japanese eatery. Noren (hanging cloth curtains) at the entrance. Wood panels and tables. The seating is pretty tight and it can get a bit loud at times.\n\nThe food: The tables have condiments to get you started. Peppered bean sprouts and pickled green veggies, quite tasty. Our order came in within 5mins.  I had the original king with thin noodles, eggs and seaweed. My friend got green king with thick noodles and sea weed. The original is buttery and rich, earthy flavors, meat cooked tender, the egg perfectly soft boiled.  The green has pesto and parmesan added to the original base. Seems odd but it seems to work well. If you're someone who likes pesto, you'll love this oddly delicious combo.  The portion size is very generous and will leave you feeling full. The thin noodles were more like angels hair pasta. The thick were more like the traditional ramen noodles that I'm used to. I'd go for the thick ones next time.\n\nParking: I parked at the Palo Alto city center parking which was right across the street from this place. But I felt so full afterwards that I had to walk it off. Lucky for me, University ave is right around the corner and makes for a good walk. \n\nOverall I left feeling impressed with the ramen and this place might have even knocked off the Hokkaido Ramen Santouka (https://www.yelp.com/biz/hokkaido-ramen-santouka-san-jose) off the first place on my list in terms of flavor. As to how frequently I'd visit this place again would depend on complex math involving the level of my hunger, the wait time something something.",
        "author": "Anish P."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-03-06",
        "description": "There was a lineup at 10:50! But we got in soon after it opened. Quite busy, restaurant was full when we left around 11:40. \n\nWe had the red king and chicken karaage.\nThey forgot my pork and the waiter brought some as soon as i told them. I did had to waive my hand for about a minute to catch someone's attention.\n\nIt was really good but still very salty even with the lesser salt option.\n\nWe were in and out within 40 minutes",
        "author": "Uyen D."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-03-18",
        "description": "Holy shit! What an amazing experience! \n\nMy friend and I came to line up about 30 minutes prior to opening. We were given a form in which we could custom order the ramen we'd like. It would vary from the thickness of the noodle, the soup base, the toppings, the way we'd like our eggs, etc etc. I spent a great deal of time pondering what I wanted, which helped quickly pass the time. Luckily, we were in the first wave! \n\nWe handed our orders to our waitress. Our food came quickly. I would  say it was less than 5 minutes! What an amazing work of art.. I was elated, hungry, and excited to see what the hype was about. Having grown up around Japanese cuisine all my life, I am incredibly picky about my ramen. This ramen did not disappoint in any way. The flavors made me reminisce of my trips to Japan. The food was simply amazing. I couldn't say more. \n\nIt's an experience that's very difficult to describe so you'll have to try it yourself to understand what I mean!",
        "author": "Daniel S."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-02",
        "description": "Managed to get here on a Wednesday around 2:20 pm for a late lunch, so there was no line. The host asked me if I've been here before and I told him that I've only been to a Ramen Nagi in the Philippines. He proceeded to inform me that the Chef in PA opened all 20 Ramen Nagi locations in the Philippines. Good to know! I loved the Ramen Nagi in Manila, so I was sure I'd love it here too! \n\nI filled out a similar order form that I had filled out in Manila--Red King, normal oil and soup, spice level 7, firm and thick noodles, Tamago and Pork Belly.  The egg and pork belly cost extra so my bill came out to about $20.  Ramen in Manila and Tokyo cost only ~$10. Everything always seem to cost more here when it comes to ramen. \n\nThe Red King was wonderful. Spice level 7 was just enough to get my sinuses running but not deaden my palate. I was able to enjoy that wonderful rich broth, minced pork, chashu and pork belly! I was so full from\nall that goodness that I had to skip dinner. I probably could have done without the egg, but It's so good! \n\nThe host told me on my way out that they take people until 3 pm during lunch service, so if you don't want to wait during weekdays, go after 2. He said it can be a 1-1.5 hr wait on weekends. My sister wants to go in a couple of weeks, so we will be back!",
        "author": "Hazel C."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-24",
        "description": "We arrived here at 9pm (30 mins before they close) and there was still a long queue for dinner. It went pretty fast though, I would say we waited around 20 mins. They give you the order form with the menu while you're waiting, the food was ready after 2 mins of us being seated. You can customize your ramen to whatever you like. \n\nWe ordered both Original and Black King. I still have the Original as my favorite as I feel like the other ones are too flavorful. They give you some appetizers that are in the table. The ramen is affordable with the amount of soup you get. \n\nI would like to go back again and try another type of broth (and maybe their chicken karaage too).",
        "author": "Krista D."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-01-31",
        "description": "The best ramen place in the bay! I've come here probably more than 20 times since it opened last year and the ramen has always been good. You order on a paper sheet to customize anything you like which is great for people who like lighter/heavier salt or garlic flavor. For the meat, I've tried the pork belly once, but didn't like it that much. \nThe have off menu appetizers like gyoza and chicken karaage, but they don't always offer it. Ask your serve if they have it that day. \nAlways be prepared to wait. I've waited up to 2 hours before.",
        "author": "Kevin L."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-01-25",
        "description": "The line out that door speaks for itself; fortunately, it moves pretty fast since they're good at turning over the place (fill out order forms in line, check gets put down mid meal, limited options for alcohol). If I'm in the area, I'll definitely be back.\n\nHere's my personal suggestion for a flavorbomb extraordinare but do you:\n- Original king\n- Heavy Tare (but medium is good)\n- Normal oil\n- Heavy garlic\n- Cabbage (really fresh)\n- Pork belly (so good)\n- Spicy level 4-5 (3 was pretty tame)\n- Wood ear mushrooms",
        "author": "Travis V."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-01-07",
        "description": "My friend asked me to meet her here for lunch.  She said she had had this ramen in another location and she wanted to try the one near work.  \n\nLunch time is very busy and even though the line is long, it goes pretty quickly.  It is better to go if you are a smaller group because the space is so tight and it just seems easier to seat one or two people at a time.  There are constantly workers walking through the restaurant picking up old plates and stuff.  \n\nThe way to order is they give you a paper that has options of what kind of soup you want to the spice level to whatever you want inside.  A basic soup is $13.95...seems cheap until you add in more stuff.   I got seaweed paper, tree mushrooms and an egg as extra, with a Sprite and my meal was $16+.  I guess that is a good price?  I don't usually go out to get it unless I go by my place so if that is the going price at other places, then I guess that is ok.  \n\nThe soup was good with the addition of whatever was on the table, they do have pickled bean sprouts as appetizers on the table already which is nice.  I even added it to my soup so it had a nice kick. I also ordered the chicken karate appetizer which was nice.  5 pieces, but the dipping sauce was weird.  I think the lemon on top was just fine.\n\nI would like to go back again to try another type of soup out.  If you are a ramen fan and don't mind the pricing, I suggest you try it too.",
        "author": "Cecilia D."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-01-20",
        "description": "Over the past year I've always noticed a line wrapped around the block for this establishment but never had the kahunas to join it. Recently a girlfriend of mine wanted to find a great ramen place so we decided to pull up our big girl britches and give this place a try.\n\nCame on a Sunday evening at 5:15pm, 15 minutes before opening, and there was already a big line starting to wrap around the corner of the block. Everyone in line was handed a paper order form and those earlier in line were given a marker so that we could customize our ramen and pre-order in line for maximum efficiency. A staff member walked around with a board that had pictures of their 5 broth options (original, spicy, black-ink, pesto, vegetarian) and was very helpful in explaining the contents of each, the spice levels, etc. At this time we were also told our approximate wait time, which for us was going to be 6:15pm.\n\nBecause of the long wait, I highly recommend planning your day accordingly. Dress warmly if you're coming in the winter, prepare for rain (they have a small handful of umbrellas in the waiting area inside) if you're really determined since there's no shelter if you're waiting outside, and obviously allot for time.\n\nBy 6:25pm, we finally make it inside. The warmth and comforting smell of ramen broth is intoxicatingly inviting. 2 minutes later, we are asked if we'd like to wait for a table or be seated at the counter - we opt for the latter.\n\nAt the counter, you get front row view of the kitchen making everyone's orders with lightning speed. There must be a dozen staff members going in and out of the kitchen with crazy levels of coordination and efficiency and everyone seems to really enjoy working with one another, shooting off friendly banter throughout.\n\nAs we get seated, our paper forms are collected. At this point, we ask for the gyoza appetizer that we saw another table eat as we walked in. As we wait for our food, I help myself to some water (large jugs of water with lemon at every other seat) and some side dishes (pickled greens and pickled bean sprouts). The counter also has assorted condiments like sesame seeds, Japanese pepper (ours was empty), black pepper (ours was missing), and a clear liquid of possibly vinegar. Chopsticks are in a cup for you to grab. There's also a box of Kleenex tissues instead of napkins, which I'm not entirely sure why this was the choice made, especially considering we're all eating thick splatter-prone ramen.\n\nAs I'm waiting, the diner next to me received a plate of chicken kaarage. I inquire about this but am told they've a limited stock and ran out for the evening. Here's where I'd like to leave a bit of critique. Firstly, neither the gyoza or the kaarage appetizers are listed on the order form (edamame and rice are), so it seems like a secret menu type situation. Since we didn't know about it ahead of time, perhaps we might have made the cutoff if we had circled it on our sheet rather than ask about it 10 minutes after being seated. Finally, we were probably the 30-35th person in line so for the kaarage to be out by 6:30pm only an hour into opening was a serious bummer.\n\nThe food arrive within 6-7 minutes of being seated and I don't know if it's because I waited over an hour outside in the cold and I'm starving, but it's excellent. I think I can say it was within the top 3 bowls of ramen I've ever had. The extra orders (aside from the egg) come in little bowls on the side so you can add them to your liking. I am surprised however that the egg was an additional $2, considering it's normally included with most ramen at other places. I ordered the spicy Red broth with extra oil, max garlic, thick firm noodles, and level 1 spice. The garlic wasn't as strong as I would have imagined or liked considering, and the spice was barely there so if you're looking for heat, crank that number up.\n\nAs we are wrapping up our meal, a staff member hands us our check to be paid at the front door on our way out. You don't get to order to-go, but they will hand you a little to-go soup container so you can pack up any remaining broth.\n\nThe staff are very friendly and very efficient. The establishment is clean. The ramen is excellent (although skip the gyoza, they're tiny and lacking flavor if eaten alongside flavorful ramen). The price point can get really high if you start adding in extras ($22-23+ for 3 extras). \n\nI'm glad I got to experience this. It was certainly enjoyable. Arguably not worth the long wait - it's great but not 1.5 hour wait great, I feel you can get comparable ramen in other locations without the whole standing in line thing. Hence it's definitely a one-time venture for me if they don't change their no-reservation / no-online wait-list situation.",
        "author": "Jenny F."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2019-12-29",
        "description": "RAMEN THAT IS WORTH THE HYPE!\n\nMy friends and I made sure to line up at least 25 minutes before opening because we've heard/read about the long lines. As the line got longer, you could see the staff inside preparing each table which only built up the excitement even more. Luckily, we just barely made it in with the first group. Phew! They explained the items on the menu and proceeded to let us order prior to seating.\n\nOnce seated, we immediately tried their side dishes of peppered bean sprout and kimchi which were honestly pretty addicitng. I wanted to eat the entire thing, but saved my appetite for the ramen. My GF and I shared the Original King and the Red King and we were completely blown away! The broth is rich and flavorful and the noodles are cooked perfectly (springy just the way I like it!). With every slurp you can see how well the delicious broth adheres to the noodles. The chashu is yummy, but I'd highly recommend getting the Kakuni (Pork Belly) instead because its delicious and THICCC!\n\nAs much as I like the Original King, the Red King is where it's at! Since my GF and I love spice this was the one for us. But in general, the flavor is just spectacular and it just stands out among the rest. Although their menu is small you can tell that they've truly mastered their craft. Overall the ramen is top notch and is certainly worth a try if you love it. The staff is super friendly and I can't wait to come back and try their other flavors.",
        "author": "Ryan J."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2019-12-22",
        "description": "The ramen was amazing, but the low review is because of a concerning health violation. My boyfriend and I both work in food service and we know this violates the health code.\n\nHEALTH VIOLATION CONCERN:\nWe waited around an hour in line so once we got seated, I had to use the bathroom. In the women's bathroom, I was waiting for one of the stalls because the other one's lock was broken. A employee coming running in and said she doesn't feel good then proceeds to throw up in the trash can and in the empty toilet stall. Okay like I get it people get sick, so I do my business and leave the bathroom while she's still throwing up and was hoping she'd get sent home after. But, NOPE. She comes back out and serves people's food. \n\nSo if you don't know, when you get your food handlers card there's a section that says if you throw up or have diarrhea, you can't be handling food. \n\nDon't get me wrong, the Red King and the Original King were the best ramen we tasted in the Bay Area. It was like the ones we had in Japan, but more oily. However, I was not comfortable with the server handling others food after that. Thank god my food was served while she was throwing up. I didn't want to say anything to the manager at the time because I didn't want to cause a scene on my date night. If the manager wants to know who it was, then I'll identify the employee but I'd preferred to respect the employee's privacy.",
        "author": "Iris H."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-01-04",
        "description": "The veggie ramen comes with the most delicious hash browns (YUM!) but I could definitely do without the mushrooms in it. \n\nIt was a bit oily for me and unfortunately for the veggie ramen you cannot change how much oil comes in it. \n\nThe wait for your food is minimal once you get inside but I think we waited for an hour 6:30-7:30 pm on Friday for a table.",
        "author": "Jes W."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2019-12-26",
        "description": "Came on Christmas Eve around 10:40, and there was already a long line! We made it in on the second round and we're seated around 11:30. It started raining outside, and the workers were nice enough to offer everyone umbrellas. \n\nMy friends and I all ordered the original king with additional eggs. I chose light oil since I don't like my broth too heavy and normal on everything else. I also selected spicy level 2 which didn't really taste spicy at all to me, can definitely level up next time! The thick noodles (normal firmness) was the right level of chew for me, and the egg was perfectly soft-boiled with a gel-like, ooey-gooey center. Sad the egg is an additional $1.75, but it's worth it and really elevates your bowl of ramen. \n\nRamen nagi is always a long wait, but after coming here, I feel like I don't need to go to any other ramen spot if I'm in the bay. Definitely the best around!",
        "author": "Annie Y."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-01-13",
        "description": "The line:\nCame here on a Sunday and arrived around the time it opened for lunch, then we waited for ~1.5 hrs before we finally got to get seated. Apparently don't come here during weekend if you want to avoid a really long wait. After we finished our lunch, we walked around for a bit, and found the line was as long as when we came even at 1 pm. This is how popular this place is!\n\nService:\nI really have to complement on their service. When you are waiting in line, the people working there will hand you the menu and give you time to make your selections. They also ask you whether it's your first time here, and if you say yes, later they will come by and explain how everything works (recommended choices/ difference in noodles etc.). After you are seated, the server will come to take your choice and food will be served in 5 minutes. Very efficient! \n\nThe food:\nI ordered the Black King with egg and my boyfriend ordered the Original King with egg. The broth for both were super rich and creamy. It was a umami bomb that was super filling as well. For my black king, I ordered it with less salt and no extra oil, and I think the saltiness and greasiness level were perfect. The noodles were very chewy and they gave a very generous amount of chashu and other toppings. I really like the addition of minced pork in my black king ramen. It was slightly sweet and added more fat into the ramen, which levels up the satisfaction it gave. Compared to other ramen places, the flavor of the ramen here is more on a sweeter side, probably because they marinated the chashu and seasoned the broth with a lot of mirin. I personally liked it but my boyfriend was not a fan of it.\n\nAlso, YOU SHOULD DEFINITELY TRY THEIR COMPLEMENTARY BEAN SPROUTS. It was seasoned with sesame oil and salt, which made it very addictive. I really had to force myself to stop from keeping eating it and to leave some space for the ramen lol It was so good.\n\nOverall:\nReally legit ramen place. I can't tell whether it worth 1.5 hours of wait. But you should definitely check it out if you are around during a weekday for lunch.",
        "author": "Emily S."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-01-10",
        "description": "I'm not much of a ramen person, but decided to try this place out after seeing people line up every time I pass by one of these places. I came here for dinner on a rainy Sunday night. A lot of people were still lined up. As my girlfriend and I got closer to the front, an employee came by to hand out ordering forms. The lines move pretty quickly so it was maybe 30 minutes.\n\nThe broth was the best part of the bowl. I got the Spicy Red King with extra garlic. The noodles weren't anything special. Overall, the ramen bowl was flavorful and filling.\n\nThe service itself was fine. Felt a little rushed as the staff quickly gave us the check, but that's how they keep the line moving.",
        "author": "George T."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2019-12-19",
        "description": "Ok, it's worth the hype.\n\nCame 10 minutes before opening on a rainy day and the line was already running down the block. What the effs. Luckily, I even though we didn't make it in as the first batch of customers, their efficiency really cuts the waiting time in half. They have you pre-order your meal as you're waiting in line, so the meal arrives within minutes after you get seated. Normal (decent) people will just eat and leave so there's not much waiting time in between.\n\nHands down one of the best ramen spots in the bay. Super customizable and fresh. Try it for yourself.",
        "author": "Michelle C."
      }
    ],
    "servesCuisine": "Ramen",
    "priceRange": "$11-30",
    "name": "Ramen Nagi",
    "address": {
      "addressLocality": "Palo Alto",
      "addressRegion": "CA",
      "streetAddress": "541 Bryant St",
      "postalCode": "94301",
      "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media0.fl.yelpcdn.com/bphoto/2JCIkTzyyzUYxhZksC1prQ/ls.jpg",
    "@type": "Restaurant",
    "telephone": ""
  },
  {
    "aggregateRating": {
      "reviewCount": 2389,
      "@type": "AggregateRating",
      "ratingValue": 4.5
    },
    "review": [
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-03-09",
        "description": "THE BEST LAMB CHOPS EVER!  Three visits here and amazing every single time.  \n\n- Avgolemono (egg lemon soup with chicken and rice) $11.75:  Lemony and creamy, this was good for a chilly evening, but would also work when it's warm outside too.  \n- Psari sto Fournou (wood oven roasted Branzino with spring garden vegetables) $49:  The fish was perfectly cooked, perfectly seasoned, perfect in every way.  I really enjoyed the veggies too.  \n- Arnisia paidakia (mesquite grilled lamb chops with lemon olive oil roasted potatoes) $49:  I'll repeat.  THE BEST LAMB CHOPS EVER!  One entree is three chops.  You can also get a half order (2 chops), or add a fourth chop.  The roasted potatoes are also delish. I'm still scratching my head on how they get those potatoes so darn crispy.\n- Galaktoboureko (traditional phyllo wrapped vanilla bean custard with pistachio ice cream) $11.75:  Phenom too!\n\nThe entrée portions are kind of small.  It's also kinda pricy.  But, it's worth every penny!\n\nOur server, Sarah, was great too.\n\nMake sure you make a reservation.  It's always busy here regardless of the time.\n\nCan't wait for visit #4...I'll be ordering the lamb chops, again.  A visit wouldn't be complete without them!",
        "author": "Sandee L."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-03-10",
        "description": "Been craving Greek for a while and always remember this restaurant as being really good. It didn't disappoint. The service is top notch. The waiter was patient, funny, knowledgeable and helpful (it's so hard to choose as everything is good on the menu, more here later!)\n\nThe must orders ... lamb riblets and octopus for the appetizers. We didn't want to fill up on starters so had to order smart. The riblets are in this delectable olive oil, garlic, lemon concoction that you will dip the fresh, warm, crusty, chewy, yummy bread into. The octopus is tender and again the dip that accompanies it is so addicting. It's similar to the riblet, but perhaps had more lemon/acid which pairs nicely with seafood.\n\nFor the entrée we had the goat casserole (hearty, comfort food with generous portions. it's very rich!), lamb chops (to die for and someone in the party must order it. Comes with delicious steak fries potatoes),pork from the hearth (big fire stone oven) with the crispiest pork skin, potatoes and a leafy green veggie (kale or chard?) and lamb shank (so fork tender and juicy. very different from the lamb chops, but if you love lamb, you'll like these too!). \n\nFor dessert, the kids ordered the chocolate cake, I had the apple tart (SO GOOD if you are a die hard apple pie/tart/streusel fan) and my husband couldn't decide between the baklava or greek cheesecake and the waiter said he could do a half order of the baklava so everyone at the table could have a small bite. DO IT. That baklava is out of this world. And if you like cheesecake, this one is light, fluffy, tangy/tart and pairs perfectly with the berry compote on top. While we were stuffed, do save room for some dessert.\n\nLove this place",
        "author": "Ellen S."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-03-08",
        "description": "Such authentic Greek cuisine! The restaurant is cozy with an open kitchen so you can see the chefs preparing the grills. \n\nWe started with Saghanaki - pan fried kefalotiri with oregano and lemon which came sizzling and strong flavored. We accompanied this with the artichokes and eggplant skewer that came with Greek yogurt which was delicious.\n\nThen followed the entrees. Since Evvia's specialty is lamb, we ordered the Kokinisto me Manestra - lamb shank braised in aromatic spices with orzo & myzithra cheese Cooked to perfection, the meat was soft and falling off the bone. \nThe highlight of the evening was the Moussaka - baked casserole with eggplant, lamb ragoût, potatoes and yogurt béchame. The melted cheese was creamy and the lamb soft and smoky. \nMy friends ordered Psari Psito, grilled Branzini with lemon-oregano vinaigrette which was delicate and had the right touch of lemon. \n\nReally wonderful dinner, I'm looking forward to coming back.",
        "author": "Delia Z."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-02-18",
        "description": "The service here makes a customer feel like royalty from the greeting at the door to your waiter and support table staff.  Everyone checks in to see if all is well and every time there is a course change a support staff will come over with a crumb sweep to make sure the table is ready for the next course.  \nAs usual the place is packed! Parties, families , friends, couples and a full house at the bar where customers have a drink as well as dine.. most likely at the bar because reservations are hard to come by. \nWe started off with beet soup which was so simple and delicious. The bright pink creamy sweet red purée was topped with a dollop of yogurt. Perfect !!! Loved ! \n\nNext we had mussels in wine broth.  The mussels were meaty and broth fragrant but the Greek licorice was a bit strong for me tonight which dominated the dish.  The mussels were very earthy... just really strong licorice fragrance in the overtone of the broth. Probably would not order this again and opt next time for our favorite grilled octopus. \n\nWe both ordered lamb entrees:  1. lamb shank atop orzo . The juices from the lamb shank were utilized in the orzo pasta. Moist fall off the bone shank was beautiful.   2. Lamb skewer with potato wedges and cucumber tomato Greek salad and tsatziki sauce.  This is my favorite entree but this time the bay leaf on my skewer overwhelmed my lamb and the bitterness of the bay leaf infused to the point of bitter. The oils from the bay leaf left a strange tingling in the mouth that seemed overwhelming. A few pieces of the skewer were not easy to cut and the connective tissue ridden lamb pieces were not inspected  well enough to be tossed  ; quality control failed and these sub par pieces of meat were not discarded before serving.  This entree is $39 and there are maybe 6 -7 skewer pieces to quality Inspect.  I expect it to be inspected before serving. \n\nIt was our anniversary and our waiter was nice and offered to take our photo. In times past the staff would come to the table with a dessert on the house for birthdays or anniversaries . I guess they don't do that anymore. \n\nStill service is excellent and the ambiance and food is usually amazing  \n\nI hope they bring back special occasion dessert on the house and they inspect food for quality before serving.  (Ie.  throw out gristly tendon like meat .. in favor of Only the best pieces etc) \n\nWe will be back though to see if things improve",
        "author": "Ang P."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-15",
        "description": "My parents and I had dinner reservations for 5:30 and we were quickly seated. The atmosphere is wonderful, business casual with an open feel. I loved the decor of this restaurant. We were quickly given bread with some of the most flavorful olive oil I've had. \n\nBoth appetizers we ordered were excellent. The zucchini cakes with the yogurt was just right- not oily, crispy outside and soft and flavorful inside. The yogurt was so yummy. It was my first time trying Greek grilled octopus. It was so much softer than I expected, nearly melted in my mouth. I was definitely expecting more of a calamari texture but this was way better. The sauce it was cooked with was good enough for me to spoon off the plate even when all the squid was gone. \n\nMy parents both ordered the lamb chops. They made sure to let me know it was one of the best they've ever had. It was perfectly seasoned and cooked super juicy. I ordered the halibut with kalamata olives tapenade and winter vegetable hash. I felt like the fish could've been a bit more crispy on the outside but it was still very tasty. Especially with the olives on top. They added such a unique flavor that I enjoyed. It was a light but satisfying dish. The vegetables were great with added lemon. \n\nOur waitress was great. She made good conversation and recommendations. I wish I could remember the wine she suggested but I absolutely loved it. It was so smooth! She even let me try it out before I made a choice. It went well with the food. \n\nBoth of the desserts we ordered were similar in texture, flaky with a sweet filling and a scoop of icecream. It was perfect to share between the 3 of us. We had a wonderful experience, service and food were awesome.",
        "author": "Sheila C."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-22",
        "description": "When the boyfriend asked if I wanted to go to Palo Alto for dinner on a Thursday night, I really didn't want to go. After all, it's still middle of the work week and tomorrow was Friday. Can't we just wait til tomorrow? But he whined and pleaded and finally got me with, \"dont you want to eat the best lamb you'll ever have in your life?\" Fine. \n\nFunny how I begrudgingly went and how quickly my mood turned around after eating half a slice of bread with some salted olive oil.\n\nOur first course was the octopus. I've heard lots of people say they don't like the texture of octopus because it too chewy. My response is \"you haven't had good octopus.\" Octopus should not be chewy and this was definitely not. It is cooked as fish should be. It doesn't flake, but it melts in your mouth like butter. It's served on a simmering plate of seasoned butter and olive oil and once you take a bite, it takes serious self restraint not to tip the entire plate into your mouth. Remember, this is a classy dining establishment... \n\nThe food is here is phenomenal. \"Best lamb you'll ever have\" was not an exaggeration. Fall off the bone, cut with a spoon, shovel in your mouth so your tastebuds can dance with the flavorful Greek seasonings type of greatness. This lamb has the texture of a fine rib cut in my opinion. \n\nThe spanakopita was the best tasting I've ever had. Other times I've tried it there's always a tangy aftertaste I'm not so fond of. This left a sultry feel, had a much more softer texture, but did not lack in flavor. The cheese is delicate and the spinach salted to perfection. \n\nAnd the dessert! Oh lord, the dessert! Do not leave here without trying the Galaktoboureko. Just. Dont. Actually, get two orders because neither you nor your date will want to share it.\n\nNeedless to say, I'll be coming back here. It's worth the drive.",
        "author": "Natalia A."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-02",
        "description": "I came here for lunch on a Thursday, with a reservation for 12 people. Service was great, although it was a little slow between courses (starters, entrees, dessert). The most impressive dishes, in my opinion, were:\n\n1. lamb chops: 5/5 these were flavorful & cooked to a nice medium rare (my personal preference). the potatoes that came with this dish were excellent.\n\n2. prawns: 5/5 i really enjoyed these! they are only 4 prawns per serving, but they are quite sizeable and taste great. i would get these again as a starter.\n\n3. chocolate cake + cherry ice cream: 3/5 the chocolate cake was good, but i personally wasn't a fan of the cherry ice cream\n\n4. greek yogurt cheese cake: 5/5 IF THIS IS ON THE MENU, YOU SHOULD ORDER IT. my coworker ordered this and it was amazing!! i wish i ordered it :'(",
        "author": "Jennifer L."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-01-16",
        "description": "Finally got to try this place! I've been eyeing it for a while! I came here for a team lunch on a weekday and it was busy! But good thing we had a reservation in advance - this place is so packed I can't imagine it for dinner or on the weekends! The space is very open, with a super high ceiling with sun roofs and a nice relaxing wooden interior.\n\nWe started off with a couple of appetizers - Taramosalata, Tzatziki & Melitzanosalata with house made grilled pita ($10.75) and Calamari with lemon garlic aioli and spicy pepper aioli ($14.75). They were both really good, but I have to say the grilled pita was exceptional - it was fluffy, great texture, and extra thick and tasty. All the sauces were phenomenal and added so much depth to the meal on the pita and calamari.\n\nFor my main, I had the lamb chops which was on the pricier side of the mains costing $33.25, all the other dishes were more affordable. The lamb chop was grilled perfectly, it was tender, melted in your mouth, and was seasoned well. I savored each bite of that lamb chop and I can still imagine eating it now!\n\nEven the baklava ($11) and greek coffee ($6.25) were fantastic! Overall, this restaurant is definitely on the higher end with most things costing more than average. But it was a great experience and I'd definitely come back!",
        "author": "Christopher L."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-03-08",
        "description": "I first dined at Evvia a number of years ago, and remember my meal being solid but I didn't think it was anything special at the time. However, I couldn't remember what I had from so long ago, and finally had the chance to return for lunch this time. We made reservations a couple of weeks ahead of time, and it was busy on a Thursday around noon; however, there were still a few tables open. I tried:\n\n-Brussels Sprouts (Lemon, Bacon, $12.50): Just ok- the sprouts were cooked well but it didn't have the crispy edges I like. The bacon pieces were also a little too big to eat with the the sprouts- skip!\n-Saghanaki ($17.25, https://www.yelp.com/user_local_photos?select=tXxL4RGvx4PnM_pHqz5i0A&userid=76vIFZcC7owykCBjMfGVXg): The crispy edges were nice, but this was way too salty for my tastes- skip! \n-Prawns (Calabrian Chili Butter, Tomatoes, Scallions, $17.25, https://www.yelp.com/user_local_photos?select=zVCG-T4J2g45wAtjR8r5Yw&userid=76vIFZcC7owykCBjMfGVXg): The sauce was really good, although could have been spicier. However, the shrimp were a bit overcooked.\n-Melitzanosalata ($10.75): Ok, but nothing special. They only give you a small portion- skip!\n-Lamb Chops (w/Olive Oil Roasted Potatoes, $33.25, https://www.yelp.com/user_local_photos?select=nzl5vWjawqVT_v-Ktmb5xw&userid=76vIFZcC7owykCBjMfGVXg): This was definitely the best dish of the meal. The lamb was seasoned very well, but it was overcooked and more of a medium/medium well (I had ordered medium rare). The lamb was still juicy, but the potatoes were the star- they were nice and crispy on the outside, perfectly seasoned, but still very tender in the middle. \n-Galaktoboureko (Phyllo Wrapped Vanilla Bean Semolina Custard w/Pistachio Ice Cream, $11.75): Yum- this was really good. There was a bit more phyllo than needed, but the filling and ice cream were both good. Recommended!\n-Evvia Sundae (Chocolate & Vanilla Ice Cream w/Hot Fudge, Whipped Cream, Toasted Hazelnuts): Very good sundae, and their fudge was amazing! I wasn't a fan of the toasted hazelnuts on this, but I would order this again for the fudge.\n\nService was efficient and our food came out quickly. Based on the prices, portions, and this most recent experience, I probably won't be back anytime soon. Parking can be difficult during the lunch and dinner rushes, but there were parking lots and street parking spots available.",
        "author": "Amy D."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2019-12-09",
        "description": "This is one of our favorite restaurants in the Bay Area. It's been in operation for more than a decade (maybe two) and the consistency on food quality, presentation and service are second-to-none. With managers like Panos running the floor and grill masters I've seen every visit, Evvia is an establishment that delivers time and time again. \n\nMy favorites are the zucchini cakes, calamari, octopus, any of their fabulous salads and for the entree, the lamb chops medium rare. It's always perfect. I've been to Evvia more than two dozen times in the last decade plus and I've enjoyed the experience and food from start to finish.\n\nHat tip to the beautiful orchestration they have in place. You will NOT be disappointed! \n\nThank you Panos!!!!",
        "author": "Pavel R."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-03-19",
        "description": "This place is very notorious in the area, it's a staple for Palo Alto. I highly recommend coming here the food is delicious and I love the ambience that they  created. I love how you can see the grill and the staff cooking all the food from the kitchen. The service is top notch they really train their staff and they're so well knowledgeable about literally everything on the menu including the wine and all the alcohol. We were a large party and they really took care of us and continuously coming and checking up on us multiple times, they were very kind. I wish they had more vegan options it's only one or two things I believe I can choose from. They have a very large wine list and also quite affordable to for some very fine wines. It's a very warm and inviting space and the servers treat you like family so we had a great experience! I highly recommend coming here as many times as possible",
        "author": "Michael M."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-10-06",
        "description": "Kokkari's sister restaurant has got it all down just like its sibling in SF: rustic surroundings, open kitchen and wonderfully prepared food. \n\nI've been to Kokkari many times so it wasn't a surprise to see the same staples on the menu. We ordered the octopus, watermelon feta salad, roasted potatoes and the lamb chops to share. I'm a bit saddened that the octopus has been chopped up into pieces instead of the much prettier presentation served whole. The lamp chops were as divine as I remember them and the salad was fresh like summer. \n\nService is great as expected from a restaurant of this caliber. Definitely a destination restaurant to celebrate a special occasion.",
        "author": "Janice C."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-01-10",
        "description": "I absolutely enjoyed having dinner here. Not only were the meals delicious but all of the staff we interacted with were very nice, humble and courteous. \n\nWe had the lamb for appetizers and then the salmon and lamb entrée again. We preferred the salmon to the lamb entrée but they were both delicious. \n\nI've been to restaurants with a lot of staff but still, all your meals come out late. This one had a few servers but I was pleasantly amazed at how efficient they were in bringing meals and drinks out on time. \n\nI definitely recommend eating here!",
        "author": "Adaeze E."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-06",
        "description": "Went for a work lunch with a party of 5. Reservations are a must as they filled up quick after 11:30. Lovely ambiance with the fireplace and exquisite decor. \nWe had the spanakopita appetizer and it was delicious! Crunchy felo baked perfectly and creamy warm filling. For my meal I had lamb riblets medium rare.  They were cooked perfectly and we melt in your mouth juicy. I substituted the potatoes for the argument arugula salad which was an excellent accompaniment.\nYou must have the cream filled Fillo dessert. I still can't pronounce it. But it was delicious and pairs well with the Greek coffee.",
        "author": "Aroba H."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-02-04",
        "description": "Nice atmosphere as soon as you walk into the restaurant. I had a high hope from yelp review but unfortunately everything is pricy and it's really nothing special. I wasn't hungry so I only ordered the grilled octopus dish. It was nicely flavored but the portion was so tiny for $18 and it really fell short overall. I've had way better grilled octopus in SF. My hub got the shrimp dish and it was better. But again it is over priced for what it is here. \n\nThe waiter was a little weird. Not that he wasn't friendly but wasn't welcoming. \n\nWe both agreed that  we are not coming back.",
        "author": "Niina G."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2019-12-31",
        "description": "I took my 10 year old daughter here for the first time for lunch today and this was her write up. I hope the manager sees this! My girl loved her experience there!\n\n\"The servers gave us 4 slices of bread with the same Greek Olive oil as Kokkarri when we went last year. It came with a small bowl of sea salt. The olive oil was the star! Creamy, rich, and full of flavor. The bread was PERFECT! Light, fluffy, and crunchy. The service was so fast! \n\nThen we ate the octopus. Oh my gosh!  It was heaven! Soft and tender, creamy, tangy and did I mention SOFT? The most buttery octopus I have ever eaten! It didn't feel like octopus,it felt like cotton candy.. \n\nThe smelt was...AMAZING! it was TOO good! It melts in your mouth! The sauce that it came with was called \"Skordalia\"; it was garlicky & packed a punch! \n\nThe Moussaka was sooooo good! It came with this cheesy sauce called Bechamel which is hot milk mixed with flour and butter then simmered with onion, cloves, bay leaves, and nutmeg until it's creamy and velvety smooth. It was also charred on top. It also came with a sprinkling of cinnamon.\n\nThe Lamb Chops were just simply the most succulent, buttery cubes of fat I have ever eaten! The potatoes - every bite was perfect. The white insides were simply creamy, starchy, soft, and flavorful.  The sauce that was spread over them was acidic, tangy, but sweet and pungent.  Last of all, the spanikopita was irresistable! The crunchiness could be heard across the whole table and tasted like buttery flakes of unctuous goodness.  The feta cheese mixed well with the strong spinach flavor.  \n\nI must say that Evvia Estiatorio is definitely the best, best, best, best, best, best, best, best way to go if you are looking for yummy delicousness in the world!\"",
        "author": "Daron C."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2019-09-29",
        "description": "Had my birthday dinner this year here. Reservation definitely had to be made at least a month before. Service was outstanding. Foods are just okay though. We ordered:\n- Octapodaki tou Yiorgou(ok, pretty boring after eating it for a while)\n- Garides tou Fournou(good, BUT when we ordered this, the waitress said it only came with 3 pieces but because it's my birthday, she would give us 4 pieces - implying that it is complimentary, so we said thank you, but when the check came, we realized we got charged for \"extra piece\" and it was $5.25!)\n- Arnisia Paidakia(good, perfectly cooked)\n- Souvla Tis Emeras(that day the special was pork rotisserie, it was good but some parts are a bit dry)\n- Baklava(really good - do not eat the whole clove at the top)\n\nParking was pretty easy to find on a Sunday night.",
        "author": "Prisilia P."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-10-24",
        "description": "Came here for a late dinner, and since we weren't too hungry, we only ordered two appetizers.\nThe zucchini cake is pretty light and fresh, and I like how simple the ingredients are: just zucchini.\nThe lamb riblets are also good: the perfect crispy outside and the oily fat inside make a really good combination. The lemon juice also makes them easier to eat.\nI think I'll come again to try out their entrees.",
        "author": "Zhihui H."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2019-08-07",
        "description": "Evvia Estiatorio was highly recommended to me by a couple of peers from work. They hyped it up as being the best Greek restaurant in the Bay Area, but I had to make that determination for myself. My boyfriend's birthday was coming up, so I made a reservation at Evvia Estiatorio via OpenTable. I made it a month in advance and quite frankly had no issues with booking the time and date I wanted. It wasn't until I read some of the reviews about Evvia Estiatorio on Yelp after the fact that it was one of those restaurants that had a super long wait to get into (e.g. 3 months in advance). I guess I lucked out!\n\nOur dinner reservation was for 6:15pm on a Wednesday. My boyfriend and I were both shocked by how packed the place already was. We were kindly greeted by an older gentleman in a suit, whom I presumed was the owner. Despite the busyness, there were two couples tables readily available. Our host gave us the option to decide which table we wanted, so we took the one located underneath an indoor awning that had a nice overall view of the restaurant. \n\nI sat back and took a moment to take in all the sights and sounds. It felt elegant but also casual because of the liveliness and loudness that the guests brought to the space. I liked the simplistic rustic design, open kitchen, and ambient lighting. \n\nThe customer service was excellent. Our main waiter was friendly, personable, and attentive. The bussers were equally as attentive. They were on top of filling our waters and clearing plates, and they even kept each other in check. There was a point when our food came out, but we didn't get a fresh set of silverware yet. The server who carried our food out would not place the food on our table until we received our silverware. Talk about accountability! Furthermore, the owner did his share of rounds at each table, including ours, to ask if guests were enjoying themselves. \n\nMy boyfriend and I are not the types to spend hours just hanging around the dinner table. We like to have our meals and then move on to the next thing. We got our appetizers in 5 minutes from ordering, and then received our entrees shortly after. We both appreciated how we finished our entire dinner experience - from getting seated to receiving the bill - in 30 minutes. I'm all about speed and efficiency as long as quality isn't compromised. I truly liked everything I ate at Evvia Estiatorio, and in general I thought that our food was made well and with good ingredients. \n\nI love spankopita. These little spinach and feta filled puff pastries are so delightful and my personal favorite Greek appetizers. I absolutely had to order spanakotiropita to share between me and my boyfriend. It came in an order of 2 but rather than serving ourselves, a waiter placed a spanakotiropita on each of our plate. We both agreed that it was the best we've had. The phyllo was flaky, and I loved the generous chunks of feta. The spinach and leeks filling made for a unique blend. \n\nSidenote: I learned something new today. The word, \"spankopita,\" is like a shortened version of the word, \"spanakotiropita.\" \"Tiropita\" describes the egg/cheese and can actually be its own standalone puff pastry by the same name. I'll have to try tiropitas next time I see it on a menu. \n\nFor my entree I ordered moussaka, which is my favorite Greek dish. If you haven't had it before, it's like a Greek lasagna made with egg plant, potatoes, béchamel sauce, and ground lamb or beef (Evvia Estiatorio uses lamb). Admittedly I've had better moussaka elsewhere, but I thought Evvia Estiatorio's version of it was still good. I was definitely satisfied with it. \n\nMy boyfriend had the Arnisia Paidakia dish consisting of rib-cut, mesquite-grilled lamb chops. I liked the roasted potatoes that complimented the dish. They were thick cuts and nicely crispy on the edges. The lamb chops were hands down the best prepared lamb I've had at a restaurant. The meat was a little bit on the medium well side though my boyfriend asked for medium rare. Nonetheless, the meat was tender, juicy, and flavorful.",
        "author": "Katrina C."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-12-29",
        "description": "After trying multiple times we we're finally able to score a table for a party of 4. I enjoy eating fish (if it's done right) and this place cooked the fish to PERFECTION! The octopus was done right as (tender and soft) and enjoyed the watermelon salad much more than I thought I would. \nA bit pricy but totally worth the wait and the dine-out. will be returning soon if Im able to reserve a table. -1 star for the unavailability for reserving a table",
        "author": "Ain M."
      }
    ],
    "servesCuisine": "Greek",
    "priceRange": "$31-60",
    "name": "Evvia Estiatorio",
    "address": {
      "addressLocality": "Palo Alto",
      "addressRegion": "CA",
      "streetAddress": "420 Emerson St",
      "postalCode": "94301",
      "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media0.fl.yelpcdn.com/bphoto/ZUSWbEblBoqjYouBjuNAmA/ls.jpg",
    "@type": "Restaurant",
    "telephone": "+16503260983"
  },
  {
    "aggregateRating": {
      "reviewCount": 1899,
      "@type": "AggregateRating",
      "ratingValue": 4.0
    },
    "review": [
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-03-29",
        "description": "I'm not a huge fan of Cuban food, but the dishes I had this time around were really good. They were busy but not crowded at 6:30pm on a Friday, but the restaurant got more packed as time went on. Reservations are highly recommended for weekends. We were seated when we arrived, and tried:\n\n-Crab Cakes (Roasted Corn Salsa, Avocado-Cilantro Pesto, Sofrito, $16, https://www.yelp.com/user_local_photos?select=BlqT7GJrK-Rz5_G1pPg4Sw&userid=76vIFZcC7owykCBjMfGVXg): Solid crab cakes, and the crab tasted fresh. However, the exterior was overly seared for me. The corn salsa, pesto, and sofrito were very good though.\n-Masitas (Spicy Roasted Pork, White Rice, Black Beans, Pickled Red Onions, Pork Jus, Micro Cilantro Sprouts, $24, https://www.yelp.com/user_local_photos?select=ZmO1_8UZkAhUQV3JBlKVIw&userid=76vIFZcC7owykCBjMfGVXg): Good, but I liked the other dishes much more. The pork was slightly on the dry side, and wasn't spicy at all. The rice and black beans were good, but I wouldn't order this dish again.\n-Coconut Crusted Snapper (Boniato Mash, Wilted Greens, Key Lime Butter Sauce, $26, https://www.yelp.com/user_local_photos?select=INrbOLb9GB4DSBd_k9qg2w&userid=76vIFZcC7owykCBjMfGVXg): Delicious- they give you a huge piece of snapper, and coconut crust was really good. The mash and butter sauce were also delicious- recommended!\n-Tierra Y Mar (Marinated Skirt Steak, Coconut Crusted Shrimp, Sofrito Mashed Potatoes, Asparagus, Avocado-Cilantro Pesto, $25, https://www.yelp.com/user_local_photos?select=78_ee5Zfa5LY4NU4jvmKFQ&userid=76vIFZcC7owykCBjMfGVXg): Yum- the marinated skirt steak was flavorful, and the coconut shrimp were really good. The sofrito mashed potatoes and pesto were also delicious- highly recommended!\n\nThe entrees were plentiful, and we were all stuffed after the entrees. Service was solid, and the food came out quickly. I will be back for the tierra y mar and the coconut crusted snapper! Parking in this area can be tough, but street parking spots and lots are available.",
        "author": "Amy D."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-03-04",
        "description": "I was here yesterday with a bestie for happy hour and dinner. We had the pan roasted mussels, raw slaw, calamari, and the paella. The paella looked amazing in the pictures so we had to order it. Overall, the food was okay. I can't say it was bad or overwhelmingly good. The best dish of the night were the mussels. The raw slaw was lacking in flavor, calamari was a little soggy and the paella seemed a little undercooked and it was super wet/saucy. \n\nThe ambiance was definitely cute and the service was nice. It was overall, OK. We also had the flan and chocolate rum cake. The flan was the better dessert. The chocolate rum cake was sort of too mushy and decadent for us.",
        "author": "T C."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-20",
        "description": "Simply said...one of the three best places to get dinner in Palo Alto.  \n\nIt's our go to place for date night.  We get a bottle of wine, an appetizer of some sort, and then share the seafood stew.  It's AMAZING!\n\nRomantic for two, a fun place for a group, and a cool place to step in for a Mojito on your way to someplace else.\n\nGreat atmosphere, innovative and delicious food, and some of the best staff in town.  La Bodeguita is a home run place to get dinner!",
        "author": "Trebor S."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-08",
        "description": "Been here twice and everything is delicious! I highly recommend making a reservation as it gets extremely crowded on a Friday night. Even with a reservation, we had to wait 15 or so minutes for our table. You can order a drink at the bar while you wait, and you get a text on your phone when the table is ready. \n\nThe food is excellent. Last night we had the ropa vieja, tiera y mar, and mojitos. The steak on the tiera y mar is served medium rare and was perfection! The ropa vieja is delicious, extremely flavorful. Out of the two dishes, the ropa vieja was my favorite,  but in terms of portion sizes, the tiera y mar was much larger (but also prIcier. $29) \n\nOverall, I'd highly recommend this restaurant and  I can't wait to go back!",
        "author": "Josephine M."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-01-25",
        "description": "Great atmosphere, fun cocktails, delicious food (vegetarian friendly), and great service - this restaurant is a real winner!\n\nOur group of 4 adults shared complementary bread with house chili oil, yuca fries and the potato + goat cheese croquettes.  The chili oil had the perfect amount of heat.  We all really enjoyed it and requested a second round :).  Both appetizers were pretty good.\n\nWe then shared two black bean soups.  They were good, but not served hot enough imo.  A common issue with soup in restaurants.. maybe I should start ordering them extra hot, lol.\n\nWe ordered 2 entrees for the table - the vegetarian carribean curry was excellent.  The plato de vegetables was also good.\n\nFor dessert, we split the Havana banana (group favorite) and coffee infused flan with rum infused whip for dessert.  The coffee was a little overpowering, but the rum infused whip cream was divine!\n\nAll in all, a great experience.  Highly recommend!",
        "author": "Devi K."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-01-01",
        "description": "This was a great little Cuban restaurant find in the \"Old Palo Alto on California Ave\" district. We need to see many more Havana and Cubano style restaurants--and it is great seeing this place survive and thrive. Very friendly staff were everywhere--very welcoming. The food, some of which were served tapas style, was great. \n\nWe tried a variety of small dishes and entrees. The standouts were the cheese plate, the little fried potato fingers, and the Cubano sandwich (which was one of the best Cubanos I've tasted). \n\nI also bought a bottle of the spicy Cuban Table Oil to take home. They serve this spicy homemade concoction with their bread.",
        "author": "Ron M."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2019-12-20",
        "description": "It's been about 3 years in the planning and I finally got the chance to come today. It was an amazing experience! I'd like to give a huge s/o to my lovely gf for reminding me about this place. No excuses; I had to come.\n\nI came earlier for lunch and was greeted by Arturo. He sat us down and gave us a quick run down of the menu. We were served by Sergio, one of the best waiters out there. He treated us like family and made sure we were well taken care of.\n\nThis restaurant is medium sized with two living rooms, a cozy bar full of exotic rums and Cuban style cocktails. My favorite feature in this restaurant is their cigar lounge with outside patio!! This is insane! Not only is this a Cuban restaurant but they play Cuban music, they have colorful artwork from Cuba, AND they have a humidor of limited cigars in which you can smoke in their well ventilated lounge!!! It was so awesome I had to sip a Mojito right away!\n\nThe food was delicious. We started with their shrimp ceviche which was refreshing and had coconut milk. The milk provided lots of flavor and made the cilantros pop more. We also enjoyed their croquetas; cheesy and paired with pickled like carrots. I ordered their Cuban classic, Ropa Vieja which is shredded skirt steak marinated with sofrito sauce. It paired so well with the sweet platanos. My gf's bistec de palomilla was on point. It was medium rare skirt steak that was served with black beans rice and platanos. I also loved their complimentary Cuban oil which paired with rustic bread. This oil is crack. It's one of the best oils I've ever had. It's mild and silky but has some heat to it. It's almost like this oil had lots of roasted peppers which left pure oil from the pepper. I will come back to buy another.\n\nAfter lunch, I went to the back with Arturo. He welcomed us to their lounge and taught me a bit about their branded cigar selection. I had to get their special La Bodeguita Del Medio cigar. It was a medium blend, well wrapped all around, a great size, and easy to smoke. It had flavors of coffee, milk chocolate, no pepper or zing, a creamy finish, etc. It paired excellent with my coffee. \n\nOverall, I love this restaurant. The food, the service, the experience, the cigar lounge, everything was perfect. I will definitely come back again and with friends!",
        "author": "Allister D."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-11-11",
        "description": "Located a stones throw from Stanford and Palo Alto, La Bodeguita Del Medio is just off El Camino Real and California Ave. This review is for dinner. \n\nFood: Shrimp ceviche was light and flavorful with coconut milk, key lime and cilantro, with a few fried plantains for crunch. Empanadas are pork filled (no other option) and had a nice pastry covering the filling. The popular choice seems to be the Ropa Vieja with shredded skirt steak, chilis, peppers, plantanos maduros, yellow rice, and sofrito sauce. Not my fave, as it was outshined by the Paella de la Bodeguita - Chicken, mussels, clams, shrimp, chorizo, and fish with a spiced yellow rice. Note: It serves two. Perfectly cooked, and absolutely delicious. And of course you need to order the maduros - sweet and delectable plantains. Better than dessert. \n\nService: Greeted at the door, and we were seated quickly without a reservation (two ppl). Our order was taken equally efficiently, and our food came out in decent time considering that almost every table was taken inside. \n\nCost: The food notes above - two apps, two entrees, a side, and two sangrias ran about $140 after tax. Bit on the steep side, but do consider the amount of food, and ingredients. \n\nOverall: Parking can be a challenge even with street parking options out front and a lot at the back. Outdoor seating available on the sidewalk (when weather permits), and they have a cigar room inside for those whom imbibe. For larger groups, I'd recommend a reservation even on weeknights.",
        "author": "Shirley B."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-12-05",
        "description": "Get the Cubano sandwich! My significant other and I ordered the Cubano sandwich and Caribbean curry. The Cubano sandwich, was delicious and done very well. The Cuban bread was warm, crunchy on the outside, soft on the inside, toasted just right. The flavor of the ham had the right amount of saltiness; it wasn't too salty. The cheese was a wonderful melting gooeyness. The only problem was that there were so little pickles! The whole sandwich only had four extremely thinly sliced small pickles. I require a good amount of pickles in my Cubano sandwiches and this was way less than average. The slices were again, extremely small and thin. I'll have to ask if they can give extra pickles on the side next time.\n\nThe Caribbean curry had a pretty good flavor, but not really to our taste. The curry taste was lighter than I expected. The main problem was with the rice. It was undercooked, so there were some hard dry bits. But then also, the curry sitting on top of the rice was creating a soggy mess out of the rice. It just wasn't made or put together well.",
        "author": "Jasmine P."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-10-25",
        "description": "Ajiaco was the best dish! It's a creamy tomato broth with lobster, shrimp, and mussels. Very fresh seafood. Also there were tender plantains and yucca in the mix. We loved dipping the table bread in the sauce! Will definitely order again. \n\nThe Tierra y Mar 4/5 was skirt steak and coconut shrimp with asparagus. Didn't think it was out of this world good, but it was good. Nicely cooked steak for your friend that wants something basic\n\nThe Arroz con pollo 3/5 with fried plantains and was okay as well. It was well seasoned.\n\nThe empanadas were 3/5. The pork filling was okay and the sauce was very sweet and coconut-y. I personally wouldn't order them again, kind of a letdown.",
        "author": "Danielle A."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-01-26",
        "description": "Oh what a lovely place this is. Very dim lights perfect for hiding any last minute pimple that came a day before your date. Friendly staff that made this experience good for someone like me who isn't too familiar with the cuisine. If you're not quite sure what to order, ask the server and they'll gladly help you decide on which dish to try. Service is on top of their game. Constant refills of water and bread!\nFor a party of 5, we ordered, Paella De La Bodeguita, ajoaco, some rice and yuca fries. First things first, stuffed. Should've wore my stretchy pants for this. Every dish was delicious and those yuca fries are dangerously good.",
        "author": "Andrew T."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-10-06",
        "description": "La Bodeguita Del Medio is one of my favorite restaurants in Palo Alto and hands down one of the best places to eat Cuban food in the Bay Area.  This place is so good that after introducing it to a group of my friends for one of my birthday celebrations, my very impressed pals asked to return here the following year for my birthday dinner.  When I brought my dad here, he, too, left very smitten.\n\nDuring one of my first visits, I fell in love at first bite with their ARROZ CON POLLO.  The delicious concoction is a perfect blend of flavours with tender chicken nearly falling off of the bones.  La Bodeguita's version of this popular Cuban dish is THE best.  Another must-try is the BODEGUITA SEAFOOD AJIACO (serves two), officially my #1 favorite seafood stew.  I also recommend their PLANTAIN CRUSTED GOAT CHEESE SALAD (simple, but, oh, so good) and KEY LIME TART (YUMMY!).  I'm not a fan of paella, but my friends are very fond of the PAELLA DE LA BODEGUITA (serves two) and my dad was extremely pleased with their MASITAS, which he ordered extra spicy.\n\nService is very friendly, accommodating, and attentive.  Of all the times that I have dined here, I have always received quality customer service.\n\nThe venue is also nice - although they have seating on both sides of the restaurant and also serve at the bar, their scrumptious food draws crowds, so reservations are highly recommended.  Cigar smokers might enjoy the humidor where you can purchase and puff hand rolled cigars.  I appreciate the spacious and clean restrooms.",
        "author": "EM H."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-09-08",
        "description": "Super cute place for date nights or celebrations!\n\nWe came on a Friday evening to celebrate my dad's birthday. I had made a reservation the day before but it wasn't necessary as there were some open tables. Service was fast and very polite. \n\nWe had the paella, masitas, and one of the specials which I believe was a pan seared fish. The masitas was very flavorful and the meat fell apart in your mouth. Same with the fish, which was served on a bed of fragrant yellow rice. The paella can come in sizes of 2 servings or 3. We got 2 servings and it was way more than enough for four if you are also trying other dishes. It was also tasty and the seafood was cooked well but I wish the rice at the bottom was crispier (soccarat). \n\nThe atmosphere was nice but a little noisy so it may be difficult for older guests to hear anything. \n\nI hope to come back and try their arroz con pollo!",
        "author": "Thea L."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-08-15",
        "description": "Great place and such an amazing vibe! Mostly the service is great from front desk to general anyone who offers you water and brings you your food, except for one waiter. But I won't let that waiter determine the review for food.\n\nFood: super delicious, and filling! Who knew plantains with meat and rice taste soo good! They call them mudora (did I spell that correctly?) lol they were yummy!! I tried both beef and chicken and both were yummy!\n\nDessert: the flan!!!! Oh my! It's delicious as heck!!! I loved it! I love the orange flavor it had, so unique and filled with deliciousness- with every bite you take, it makes your taste buds smile !:) and I like it when my taste buds smile! \n\nDeducted one star because of the service: Mostly everyone was super kind except for our waiter, he had a bit of an attitude, which I didn't understand why. We ordered dessert with another waiter who stopped by asking if we needed anything else, and we said, \"a flan\" and he said \",coming right out\" than our waiter stopped by asking if we wanted anything else, and we said \"we already ordered dessert with another waiter who had asked\" our waiter responded with \"you don't order with anyone else, I am your waiter!\" And walked away. This was a bit weird, it's like he was mad. Hence I took off a star for this. Otherwise the food was good, and the ambiance was great in general! \n\nCleanliness: clean place! Very cute, and the vibe is great!\n\nGo check it out!:)",
        "author": "Mona A."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-12-31",
        "description": "We got the ropa vieja, a paella, and the marinated cheese appetizer. The ropa vieja was really great but honestly I'm tempted to compare it to a slightly elevated form of chipotle, if that makes sense. The paella was pretty good but I'm also not a huge fan of paella in general. I was satisfied overall and would return to try a few other things on their menu.",
        "author": "Alex L."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-08-11",
        "description": "2 words: Cubano Sandwhich! Get it. Eat it. Thank me later. \n\nA buddy of mine bright me here for lunch and it was superb. They menu has a lot of appealing options but anytime I see a Cubano on the menu, I'm going for it. The Sandbo was perfectly crispy on the outside yet soft and sweet. The cheese was melted to perfection and just enough meat to make you you salivate. Usually they put too much mustard but it was just the right amount. Well done! It also comes with fresh greens that's remarkably refreshing. \n\nProTip: Make your Cubano a \"Cali-bano\" and add Avocado! Don't forget the hot sauce. You're welcome! \n\nShoutout to the bartender, she was exceptional nice and fantastic service.",
        "author": "Anthony R."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2019-06-24",
        "description": "This was my first time trying Cuban food, and while I wasn't blown away by anything the food itself was still good. I managed to make a reservation for 4 the day of, but the place was pretty packed overall! Probably a good idea to make that reservation unless you're okay with the wait.\n\nCrab Cakes~ The star of the meal in my opinion. The blue crab had so much flavor and the slightly spicy corn on the side was a solid addition.\n\nCamarones Mojo~ So so here as well. The shrimp were definitely on the small side and there wasn't really anything special about the shrimp or sauce.\n\nRopa Vieja~ This was a steak-based dish but yet so little flavor? I did like the plantains on the side but besides that I was pretty unimpressed with the flavors on the plate.\n\nNacional No. 1 (cocktail)~ Bartender got it right. The drink was strong without being overwhelmingly tasting of rum. There was definitely a strong hit of rum but it was complemented by the different sugar combinations. This resulted in a steady buzz while still being able to enjoy the taste of my drink!\n\nThe verdict? Unimpressed considering this is Palo Alto. For my money I was looking for something much more satisfying and unique!",
        "author": "Adeline C."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-03-03",
        "description": "The ambiance here is nice and the wait staff was attentive. The offered complimentary bread which cold and hard has a rock! The food though flavorful all came out what felt like room temperature. At first I thought it was just mine, but I was dining with two friends and tried their food as well and it was the same.",
        "author": "Kay W."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-02-14",
        "description": "The paella serving size is huge!!! We had 6 people and ordered for 3 and it was still too much as we had other dishes we were sharing. Lucky me I had leftovers for breakfast, lunch and dinner . \n\nWe also shared the Caribbean curry dish that was very flavorful, yucca fries, steak, mussels and the complimentary bread... that was a perf pairing to the mussel sauce hehe\n\nWe went during Christmas so had some holiday mulled wine!!! Very romantic atmosphere in case you want to bring a 3rd date to impress.",
        "author": "Jenna L."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-05-16",
        "description": "Second time here - the food does not disappoint.  While it's definitely higher end (this is PaloAlto, after all), the flavors are incredible.  First time I had positive experiences with empanadas and the Cubano sandwich so this time I tried the Graycliff Chowder - tomato cream reddish in appearance but  what a wondrous blend of blue crab and shrimp purée and coconut milk.  Amazing combination of flavors.  \n\nThen had the Ropa Vieja \"Cuban Classic\" which is braised - then - shredded skirt steak, stewed down with tomatoes and chilies.  This is the type of dish that can easily end up like dried straw but they kept it moist and tender.   For me, a little too much meat : bean ratio but that is a very minor point.  They both provide the power protein and then you can take a quick bite of the tangy fried plantain to balance out the flavors.  I still would easily recommend the dish to anyone.  \n\nEven at peak lunch hour, service was swift and there when you wanted it.  Looking forward to another return!",
        "author": "Richard W."
      }
    ],
    "servesCuisine": "Cuban",
    "priceRange": "$11-30",
    "name": "La Bodeguita Del Medio",
    "address": {
      "addressLocality": "Palo Alto",
      "addressRegion": "CA",
      "streetAddress": "463 S California Ave",
      "postalCode": "94306",
      "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media0.fl.yelpcdn.com/bphoto/GyRVfMjzw07p7dcNwncjSA/ls.jpg",
    "@type": "Restaurant",
    "telephone": "+16503267762"
  },
  {
    "aggregateRating": {
      "reviewCount": 539,
      "@type": "AggregateRating",
      "ratingValue": 4.0
    },
    "review": [
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-03-26",
        "description": "I am always so amazed whenever I walk into a restaurant and I see freshly made udon noodles being made right in front of your eyes. This place is ONE BUSY restaurant, so come early! It's awesome that this place gives you the option to add your name on the waitlist and have them call you when you're up next because there's so much to do in the area where this restaurant is located. So, really makes the wait times go by FAST. \n\nIf you're coming to this restaurant for the first time, you'll notice that you can make all your orders through a tablet, which I think is absolutely awesome! It takes me some time to look through the menu and choose a dish that I'd like to try, so it really gives me the time to figure out what I want. Of course, that's just me being me though! Haha! My husband and I ordered: Duck Tsuke Udon, Tori Udon and Seared Salmon Toro Sashimi.\n\nI absolutely loved the noodles because they were just THE perfect consistency. You can tell they were made super fresh, which I absolutely adore. My husband and I just picked at each other's dishes and I was absolutely jealous because my husband's dish (duck tsuke) was DELICIOUS. I mean, don't get me wrong, I loved the tori udon but the moist duck and sauce that accompanied his dish was PERFECT. It truly took us back to our trip to Japan as we've been looking for dipping noodles EVERYWHERE in the Bay. \n\nI was semi-disappointed in the Seared Salmon Toro Sashimi because the fish itself wasn't as fatty and tasty compared to other toro sashimi we've had before. So, if you come here, COME FOR THE UDON NOODLES! I mean, it IS in the name of the restaurant. ;)",
        "author": "Kaye T."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-03-30",
        "description": "I'm trying to support local businesses during the COVID19 crisis, so I thought I'd give these guys a try via DoorDash's \"no contact\" delivery service. I ordered seared salmon sashimi, spicy salmon on crispy rice, pork belly on rice and Brussels sprouts. \n\nThe pork belly and Brussels sprouts were okay, but both salmon dishes used salmon that was WAY past its prime. I had to throw half my order away.",
        "author": "Krispian E."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-03-13",
        "description": "Today they seemed understaffed. Maybe it's the covid 19 situation. Given ..  I did eat lunch at 2:45pm because I didn't want to be in a crowd or near people . The mall is a ghost town. It's why I ventured out ... social distancing is definitely doable at an outdoor mall. But please follow the cdc and authorities as things evolve and if told to stop eating out ... do so. Italy and others have closed restaurants so please be safe before going out ... be smart about when ..  \n\nI was also starving after coming out of a 2.5 hour dental appointment . \n\nFirst thing I noticed was the texture of my noodles. My noodles were just ok. Hard and stiff and felt more like a udon slippery rice cake texture. The meat seemed a bit off tasting today too .. Maybe not as fresh. \nThe dashi broth as usual is nice and I did drink a lot of it.  I usually order the tempura egg and I love it every time. This time no exception.",
        "author": "Ang P."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-03-13",
        "description": "This place has really cool ambience and seems like it's a new location within Stanford shopping center. \n\nI was originally drawn to this place for the duck dipping udon. We arrived a little earlier for dinner around 5 or so and so happy we did bc the lines started growing a bit afterwards. \n\nWe were seated at the bar where there is a tablet where u can order. This was cool but i like when i can ask for recommendations from waiters. \n\nI got the appetizer sampler with sashimi.. this was the best thing we ordered. Everything was mouth watering and delicious. \n\nThe duck udon was underwhelming. The udon is cooled a solid al dente. Chewier than any udon i had before but didn't mind. The dipping sauce was not quite there.. a bit too sweet and weird after taste, the duck is also kind of tough to chew.\n\nWe got a bottle of wine that was recommended by the hostess and it was not my favorite. Cheap wine :( \n\nThis has a great bustling modern ambience and interior but i don't think i'd come again.",
        "author": "Annie K."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-29",
        "description": "After my eh, okay first time, I was offered an opportunity to come back to try them again. My 5 stars is definitely due to their great and thorough customer service. We arrived around 7pm on a Sunday and they were still pretty busy, but there was no wait. We had a party of 4 and were seated pretty quickly. They have definitely expanded their menu on the iPad and had a lot of new items that I didn't see my first time around. This time around we ordered...\n\nSalmon wing tips: as usual, these were delish!! Still my favorite thing on the menu. The salmon was so fatty and soft and the sauce paired so well with the salmon. \n\nSeared salmon toro shrimp roll: this was really good as well. The roll was presented beautifully and all the fish was fresh. \n\nSmoked salmon skin salad: the salmon skin was crispy, but not very flavorful. I thought it quickly got lost in all of the salad until you got to the end. The salad was a little underdressed for me, but I think it would've overpowered the salmon skin if it had more dressing. Serving size was pretty big. It was good to share between us 3. \n\nBacon wrapped fried Mochi: our server brought this to us on the house, which was awesome. This was one of our favorite dishes as well. So simple, but the bacon worked soooo well with the fried Mochi. I'm glad we got to try it! \n\nDuck tsuke udon: dipping udon. The pieces of duck was drizzled with some sort of sauce. The duck was soooo good. Noodles were chewy and perfect. The dipping broth was a very very thick sauce. My friends enjoyed it, but I thought it was a little sour, which was weird for me. I still enjoyed the noodles and duck, I just didn't dip too much of the sauce on my noodles. \n\nSeasonal truffle udon: Sooooooo good. This is probably my favorite udon. It was rich and the sauce was flavorful. It was more of a sauce then it was a soup. \n\nUni Ikura udon: Delicious as usual! Uni was delicious and fresh. Sauce was rich. This udon was also more saucy then soupy. \n\nBoth of the truffle and uni udon were delicious, but too rich for me to ever order and eat one by myself. I think these two dishes are better shared.",
        "author": "Josephine D."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-26",
        "description": "We love this place! It's a small Japanese restaurant at the Stanford shopping center that is very modern with their order by tablet model. The service is very fast and the food is all delicious; however, because so many other people agree there's always quite a line around meal times. But we love it so much, we come about once a week and order take-out which takes about 15 minutes to prepare. \n\nOur go-to items we always get are the pork belly bowl, fried chicken karagge, and panko crusted egg. We've also gotten takoyaki, fried shrimp, salmon bowl, and udon all of which have been tasty too. The udon was actually my least favorite item (still good!) of all the things I've tasted here, which is surprising because this place boasts its fresh and delicious noodles.",
        "author": "Min Joo K."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-01-26",
        "description": "Loving the self-service iPads at Taro San! \n\nI saw pictures of the Duck Tsuke Udon which made me bookmark this place. \n\nCame here with my boyfriend and joined the waitlist on Yelp so we were seated just 10 minutes after arriving. Pretty sweet :) \n\nI love udon and I'm not sure why I didn't follow my gut to get a soup udon. \n\n\nMy boyfriend got the duck tsuke udon which you can really taste the texture of the udon. It was cooked perfectly and the duck was tasty. \n\nI on the other hand ended up getting the uni udon which is $22 MP. \n\nIt's soooo heavy, I couldn't even eat half. I've had uni pasta at EMC which I shared and maybe I should've done the same here. \n\nThe udon also makes the entire dish even heavier with such thick noodles. \n\nThe chicken Karaage is good though and the mochi donut holes are bomb. \n\nI'd be down to come back but will probably stick with something lighter like a plain udon.",
        "author": "Shelly W."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-02-15",
        "description": "This is one of those restaurants where I think the appetizers are better than the entrees.\n\nFirst off I like how you order on an iPad and you can order or get help whenever you want. Makes everything move quicker.\n\nThis restaurant has sushi and noodle options. I ordered the spicy salmon on crispy rice and a half portion of the house salad to begin with. My husband then ordered the tori chicken udon while I got the duck tsuke udon. Like I said the salmon on crispy rice was delicious. Right amount of spiciness and mix of textures. The house salad's dressing is the best I've had in a while. So light and refreshing. I loved it. There was a great mix of greens and other goodies that made it so much more than a typical salad.\n\nThe entrees however were a different story. The tori udon was not very flavorful. To me the same with the duck udon dipping sauce. We didn't alter our sauce/broth to less salty, but it seemed like we did. I really needed a burst of flavor for both.\n\nI think if I were to come back here, I'll just stick with the sushi and appetizers.",
        "author": "Hang T."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-01-19",
        "description": "Taro San Japanese Noodles really executes udon well. The other items such as the sashimi, sushi rolls, and donburis are just an added plus. \n\nTori Udon- 5/5 This bowl of udon is simply my favorite dish here. If Taro San specializes in anything, it would be their sous vide chicken. Their chicken is hands down, the best chicken breast I've ever had. The meat is so tender, delicate, and juicy. The udon noodles are firm, thick with a nice chew to them. The chicken broth is light and savory- it just warms your soul. \n\nPRO TIP: Get the panko crusted egg! It's not your typical boiled egg. The panko crust adds so much more texture and flavor to the egg. You won't regret it. \n\nSpicy salmon with crispy rice- 5/5 The salmon has a nice kick to it. The rice is fried to a crisp with a mochi like texture. Each bite is a mouthful of flavor. Absolutely a fantastic appetizer to start off with. Definitely try it! \n\nDuck tsukemon- 3.5/5 The broth is a bit too salty and overempowering for my taste. The duck meat was a bit tough and chewy. Personally, I wasn't a huge fan of the duck meat.\n\nThe Yelp waitlist option is extremely useful, especially if you don't want to wait long. The interior is clean and quite spacious with a few large tables in the back. The chairs are surprisingly comfortable and the lighting is optimal. The digitalized ordering system cuts the need of a waiter taking your order. While the physical menu shows the description of each item, the digitalized ordering system shows helpful photos of each item so you know exactly what you're ordering. \n\nI would definitely come back for the chicken udon alone.",
        "author": "Sandra N."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-02-06",
        "description": "3.5 rounded up to 4\n\nI really enjoyed the niku udon here. Truffle udon was ok but kind of too heavy.\n\nThe main thing I can't seem to get over is that the freshly made udon is served al dente...but almost too al dente (undercooked??). I actually prefer the soft, slippery texture of frozen udon to what was served here, although that might be a personal preference.\n\nGiven the convenient location, I'd come back for the niku if I were shopping in the area. But it's not really a place I'd go out of my way for. I'd also hesitate to get anything other than the udon.",
        "author": "Anna C."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-01-15",
        "description": "My bf and I were planning to go to Stanford mall, so we looked up some places to eat in the area. This place caught our eye and they have yelp waitlist so we joined the waitlist on the way there which super convenient! We ordered the Tori udon, the duck tsuke don, and a Pork Belly Kakuni Don mini on the side to try. The tori udon was good, broth was flavorful, wasn't too heavy, but it wasn't anything too spectacular where I'd crave it. The duck tsuke udon was pretty good as well! It was something we have never had before, so it was great new dish to try. The soup for dipping was flavorful and thick and the udon was really able to capture the taste of the soup, yum! My bf was really glad he decided to add on a pork belly don because the flavor was very unique and it was very tasty and flavorful, would definitely recommend this dish. \n\nOverall, the food was pretty good. It is also very efficient with its waitlist system on Yelp and the ability to order food and services via their tablet at every table! I loved how we were able to take our time and look thru the menu at our own pace with pictures on the screen and having the ability to request for water and take-out boxes without having to flag down a waiter.",
        "author": "Bailey L."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-22",
        "description": "The panko crusted eggs and pork belly were amazing (we came here for the eggs, someone recommended). The service is crazy fast which is nice as you can order a bunch of appetizers on the tables iPad as you go. The fried chicken karagge is soooo crispy and good. We also love the fried shrimp, and the salmon udon bowl.\n\nThe noodles were just ok -- nothing special. It did come with a lot of tasty toppings and veggies though!  We come back here pretty much once a week for the tapas style appetizers and anything pork belly. :)",
        "author": "Alex G."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-02-22",
        "description": "Ambiance and atmosphere of the restaurant was nice, but honestly the food was pretty underwhelming. The appetizers seemed better than the entrees, which is a bit surprising since their specialty is supposed to be the noodles. \n\nThe ebi fry is a panko breaded shrimp rather than traditional shrimp tempura. Still tastes fine. Kaki fry was also good. But all of the entrees were underwhelming. The mini ikura and salmon donburi was hard to finish. The ikura was so sweet it really wasn't enjoyable to eat at all. I had to soak the ikura in soy sauce to make it palatable. The niku udon was also ok at best. There was a lot of meat, but it was pretty tough. And the soup base overall was quite salty.",
        "author": "Stephen C."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-02-05",
        "description": "I really like the ambience of this place. One cool and convenient thing about this place is their ordering process. You can place your order through the iPad attached to each table. I like the visual effect of ordering through the iPad.\n\nFood: 3/5 I got their tori udon and that was a little disappointing. The broth was too bland and it didn't taste any special or good at all. We also got the seared salmon and that was not good as well. We did like the vegan roll, it was tasty.\n\nPrice: $$ some dishes were a bit too pricey\n\nI definitely had high hopes on their food. If I ever come back, I will try a different dish.",
        "author": "Hoa L."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-12-27",
        "description": "With a limited amount of restaurants in the Bay Area with in house-made udon noodles, Taro San was on my list for that sole reason.\n\nSmall restaurant with limited seating, open kitchen and freshly cut udon in the front window. A menu consisting of appetizers, salads, udon, seasonal dishes, and sashimi. The restaurant is run very similar to Yayoi in Cupertino, basically you \"order\" everything you would need service for and the staff will provide whether its a water refill, food orders to even napkins.\n\nGot the 6 Piece Toro Trio Omakase, Niku Udon and tried the Duck Tsuke Udon. \n\n6 Piece Toro Trio Omakase - seared salmon toro, nice sear but a bit on the small size in terms of portion and for salmon toro it's not as buttery or soft as I've had elsewhere. Hamachi toro was good, light flavor, soft but fresh. Tuna toro, this one looked like raw meat with a lot of marbling it was crazy. Super buttery, melt in your mouth sashimi it was like chewing butter. It only missed the mark because there seemed to be a bit of tendon which was hard to chew through ... other than that this bite was amazing. Pricey though $25 for 6 pieces.\n\nNiku Udon (added soft boiled egg) - strong dashi flavored broth, chewy and thick udon noodles, topped with tempura bits, spinach, napa and thinly sliced ribeye. The ribeye was tender and flavorful! The soft boiled egg was cooked perfectly and gooey. A good portion of noodles and nice complex and bold tasting broth.\n\nThe Duck Tsuke Udon - dipping udon in a fatty, rich duck and dashi broth. The concentrated broth was rich, sweet and savory. The lime wedge served with the udon was a nice touch as to cut through the unctuousness of the broth and seared duck breast. \n\nWhat to say about the service ... it took about 30 min to dine in for lunch and you basically order everything from the tablet. Food came out in a timely manner and price is a bit steep for what it is- then again look around at where we are, haha! Servers didn't talk much, so not that impressionable. \n\nAll in all, food is alright here but not amazing. However, not worth waiting too long in line for. Also, if you do plan on coming here during peak time do yourself a favor and join the Yelp waitlist to speed things up a bit.",
        "author": "Janet N."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-01-30",
        "description": "They do a denser chewier version of udon here, perhaps Kagawa style? I liked this style of noodle  but for the kake udon, the broth was way too salty that I had to add water to it. Good thing for Hapoy  Hour (3-6 pm) the kake udon is only $5!\n\nOther standouts for me were the chicken karaage and the hamachi toro sashimi. The salmon pairing with soy based sauce and jalapeño didn't really work for me.\n\nThe ordering and food delivery is quick because you use the iPad by your table. I wish they gave us little plates since we shared a lot. They also don't clear your plates until you end the meal so also wish they did because we ordered a lot and had to rearrange and stack plates.\n\nI would come back for their affordable happy hour deals. During the weekday there's almost no waIt. I unfortunately didn't get a taste of the chicken and the beef udons that were also ordered though  the beef slices looked like they had a good amount of marbling on them.",
        "author": "Derek L."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-01-05",
        "description": "The curry broth wasn't overly salty, not too watery, and the noodles were firm and chewy. If you prefer your broths to have a bolder flavor, I wouldn't recommend this place for you. However, it is a solid restaurant to get your udon fix.\n\nTwo of my friends and I came around 12 pm on a Sunday. We barely beat the lunch hour rush. Definitely get in the yelp waitlist line before you arrive.",
        "author": "Sam L."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2019-12-14",
        "description": "Like a higher-quality YAYOI (order at the table on an iPad, etc). \n\nBut I'm here to talk about something specific, which is: this is a great place to eat a decent Japanese meal with a small child. \n\n+Plenty of high chairs.\n+Kiddie-sized bowl, flatware, and non-breakable water cups available as needed.  \n+On-demand napkins via the iPad. \n+Kid's udon is extremely large portioned for $5. Our daughter loves the springy udon noodles and rich, flavorful chicken broth (I'll add: Mama does too). We usually add an egg, which is popular with our little one.\n\nThe only thing that can be a little tricky is that the tables are small, so it can be hard to arrange items to `keep your grown up hot/breakable dishes out of reach.",
        "author": "Monica S."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-12-17",
        "description": "Was quite a wait to get a table (an hour wait for Sunday lunch) but you can walk around the Stanford mall while you're on the waitlist so it's not too bad. \n\nMy favorite dish of the day was the pork belly rice bowl that we ordered with a deep fried, soft boiled egg. Perfect combination of flavors and textures! Pork belly was tender and fatty, rice was perfectly cooked, and the egg yolk was runny  and wrapped in a crispy panko crust. \n\nWe also liked the Tori Udon. You can order their udon bowls to be less salty, which I appreciated.",
        "author": "Hannah L."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-03-13",
        "description": "3.5 stars - I was a little disappointed with Taro San as I had really high expectations for this place. I'm a huge udon lover, and the chewiness of the udon missed my expectations as the noodles were a bit too hard (somehow not \"right\"). The pork belly rice was really good (so a redemption there); and the atmosphere is a nice place to chill out and get a pitcher of beer with friends, so will definitely give this place another shot.",
        "author": "Connie C."
      }
    ],
    "servesCuisine": "Japanese",
    "priceRange": "$11-30",
    "name": "Taro San Japanese Noodle Bar",
    "address": {
      "addressLocality": "Palo Alto",
      "addressRegion": "CA",
      "streetAddress": "717 Stanford Shopping Ctr",
      "postalCode": "94304",
      "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media0.fl.yelpcdn.com/bphoto/YrbxwrJhev-j6CWHFew0tg/ls.jpg",
    "@type": "Restaurant",
    "telephone": "+16508152700"
  },
  {
    "aggregateRating": {
      "reviewCount": 539,
      "@type": "AggregateRating",
      "ratingValue": 4.0
    },
    "review": [
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-03-26",
        "description": "I am always so amazed whenever I walk into a restaurant and I see freshly made udon noodles being made right in front of your eyes. This place is ONE BUSY restaurant, so come early! It's awesome that this place gives you the option to add your name on the waitlist and have them call you when you're up next because there's so much to do in the area where this restaurant is located. So, really makes the wait times go by FAST. \n\nIf you're coming to this restaurant for the first time, you'll notice that you can make all your orders through a tablet, which I think is absolutely awesome! It takes me some time to look through the menu and choose a dish that I'd like to try, so it really gives me the time to figure out what I want. Of course, that's just me being me though! Haha! My husband and I ordered: Duck Tsuke Udon, Tori Udon and Seared Salmon Toro Sashimi.\n\nI absolutely loved the noodles because they were just THE perfect consistency. You can tell they were made super fresh, which I absolutely adore. My husband and I just picked at each other's dishes and I was absolutely jealous because my husband's dish (duck tsuke) was DELICIOUS. I mean, don't get me wrong, I loved the tori udon but the moist duck and sauce that accompanied his dish was PERFECT. It truly took us back to our trip to Japan as we've been looking for dipping noodles EVERYWHERE in the Bay. \n\nI was semi-disappointed in the Seared Salmon Toro Sashimi because the fish itself wasn't as fatty and tasty compared to other toro sashimi we've had before. So, if you come here, COME FOR THE UDON NOODLES! I mean, it IS in the name of the restaurant. ;)",
        "author": "Kaye T."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-03-30",
        "description": "I'm trying to support local businesses during the COVID19 crisis, so I thought I'd give these guys a try via DoorDash's \"no contact\" delivery service. I ordered seared salmon sashimi, spicy salmon on crispy rice, pork belly on rice and Brussels sprouts. \n\nThe pork belly and Brussels sprouts were okay, but both salmon dishes used salmon that was WAY past its prime. I had to throw half my order away.",
        "author": "Krispian E."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-03-13",
        "description": "Today they seemed understaffed. Maybe it's the covid 19 situation. Given ..  I did eat lunch at 2:45pm because I didn't want to be in a crowd or near people . The mall is a ghost town. It's why I ventured out ... social distancing is definitely doable at an outdoor mall. But please follow the cdc and authorities as things evolve and if told to stop eating out ... do so. Italy and others have closed restaurants so please be safe before going out ... be smart about when ..  \n\nI was also starving after coming out of a 2.5 hour dental appointment . \n\nFirst thing I noticed was the texture of my noodles. My noodles were just ok. Hard and stiff and felt more like a udon slippery rice cake texture. The meat seemed a bit off tasting today too .. Maybe not as fresh. \nThe dashi broth as usual is nice and I did drink a lot of it.  I usually order the tempura egg and I love it every time. This time no exception.",
        "author": "Ang P."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-03-13",
        "description": "This place has really cool ambience and seems like it's a new location within Stanford shopping center. \n\nI was originally drawn to this place for the duck dipping udon. We arrived a little earlier for dinner around 5 or so and so happy we did bc the lines started growing a bit afterwards. \n\nWe were seated at the bar where there is a tablet where u can order. This was cool but i like when i can ask for recommendations from waiters. \n\nI got the appetizer sampler with sashimi.. this was the best thing we ordered. Everything was mouth watering and delicious. \n\nThe duck udon was underwhelming. The udon is cooled a solid al dente. Chewier than any udon i had before but didn't mind. The dipping sauce was not quite there.. a bit too sweet and weird after taste, the duck is also kind of tough to chew.\n\nWe got a bottle of wine that was recommended by the hostess and it was not my favorite. Cheap wine :( \n\nThis has a great bustling modern ambience and interior but i don't think i'd come again.",
        "author": "Annie K."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-29",
        "description": "After my eh, okay first time, I was offered an opportunity to come back to try them again. My 5 stars is definitely due to their great and thorough customer service. We arrived around 7pm on a Sunday and they were still pretty busy, but there was no wait. We had a party of 4 and were seated pretty quickly. They have definitely expanded their menu on the iPad and had a lot of new items that I didn't see my first time around. This time around we ordered...\n\nSalmon wing tips: as usual, these were delish!! Still my favorite thing on the menu. The salmon was so fatty and soft and the sauce paired so well with the salmon. \n\nSeared salmon toro shrimp roll: this was really good as well. The roll was presented beautifully and all the fish was fresh. \n\nSmoked salmon skin salad: the salmon skin was crispy, but not very flavorful. I thought it quickly got lost in all of the salad until you got to the end. The salad was a little underdressed for me, but I think it would've overpowered the salmon skin if it had more dressing. Serving size was pretty big. It was good to share between us 3. \n\nBacon wrapped fried Mochi: our server brought this to us on the house, which was awesome. This was one of our favorite dishes as well. So simple, but the bacon worked soooo well with the fried Mochi. I'm glad we got to try it! \n\nDuck tsuke udon: dipping udon. The pieces of duck was drizzled with some sort of sauce. The duck was soooo good. Noodles were chewy and perfect. The dipping broth was a very very thick sauce. My friends enjoyed it, but I thought it was a little sour, which was weird for me. I still enjoyed the noodles and duck, I just didn't dip too much of the sauce on my noodles. \n\nSeasonal truffle udon: Sooooooo good. This is probably my favorite udon. It was rich and the sauce was flavorful. It was more of a sauce then it was a soup. \n\nUni Ikura udon: Delicious as usual! Uni was delicious and fresh. Sauce was rich. This udon was also more saucy then soupy. \n\nBoth of the truffle and uni udon were delicious, but too rich for me to ever order and eat one by myself. I think these two dishes are better shared.",
        "author": "Josephine D."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-26",
        "description": "We love this place! It's a small Japanese restaurant at the Stanford shopping center that is very modern with their order by tablet model. The service is very fast and the food is all delicious; however, because so many other people agree there's always quite a line around meal times. But we love it so much, we come about once a week and order take-out which takes about 15 minutes to prepare. \n\nOur go-to items we always get are the pork belly bowl, fried chicken karagge, and panko crusted egg. We've also gotten takoyaki, fried shrimp, salmon bowl, and udon all of which have been tasty too. The udon was actually my least favorite item (still good!) of all the things I've tasted here, which is surprising because this place boasts its fresh and delicious noodles.",
        "author": "Min Joo K."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-01-26",
        "description": "Loving the self-service iPads at Taro San! \n\nI saw pictures of the Duck Tsuke Udon which made me bookmark this place. \n\nCame here with my boyfriend and joined the waitlist on Yelp so we were seated just 10 minutes after arriving. Pretty sweet :) \n\nI love udon and I'm not sure why I didn't follow my gut to get a soup udon. \n\n\nMy boyfriend got the duck tsuke udon which you can really taste the texture of the udon. It was cooked perfectly and the duck was tasty. \n\nI on the other hand ended up getting the uni udon which is $22 MP. \n\nIt's soooo heavy, I couldn't even eat half. I've had uni pasta at EMC which I shared and maybe I should've done the same here. \n\nThe udon also makes the entire dish even heavier with such thick noodles. \n\nThe chicken Karaage is good though and the mochi donut holes are bomb. \n\nI'd be down to come back but will probably stick with something lighter like a plain udon.",
        "author": "Shelly W."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-02-15",
        "description": "This is one of those restaurants where I think the appetizers are better than the entrees.\n\nFirst off I like how you order on an iPad and you can order or get help whenever you want. Makes everything move quicker.\n\nThis restaurant has sushi and noodle options. I ordered the spicy salmon on crispy rice and a half portion of the house salad to begin with. My husband then ordered the tori chicken udon while I got the duck tsuke udon. Like I said the salmon on crispy rice was delicious. Right amount of spiciness and mix of textures. The house salad's dressing is the best I've had in a while. So light and refreshing. I loved it. There was a great mix of greens and other goodies that made it so much more than a typical salad.\n\nThe entrees however were a different story. The tori udon was not very flavorful. To me the same with the duck udon dipping sauce. We didn't alter our sauce/broth to less salty, but it seemed like we did. I really needed a burst of flavor for both.\n\nI think if I were to come back here, I'll just stick with the sushi and appetizers.",
        "author": "Hang T."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-01-19",
        "description": "Taro San Japanese Noodles really executes udon well. The other items such as the sashimi, sushi rolls, and donburis are just an added plus. \n\nTori Udon- 5/5 This bowl of udon is simply my favorite dish here. If Taro San specializes in anything, it would be their sous vide chicken. Their chicken is hands down, the best chicken breast I've ever had. The meat is so tender, delicate, and juicy. The udon noodles are firm, thick with a nice chew to them. The chicken broth is light and savory- it just warms your soul. \n\nPRO TIP: Get the panko crusted egg! It's not your typical boiled egg. The panko crust adds so much more texture and flavor to the egg. You won't regret it. \n\nSpicy salmon with crispy rice- 5/5 The salmon has a nice kick to it. The rice is fried to a crisp with a mochi like texture. Each bite is a mouthful of flavor. Absolutely a fantastic appetizer to start off with. Definitely try it! \n\nDuck tsukemon- 3.5/5 The broth is a bit too salty and overempowering for my taste. The duck meat was a bit tough and chewy. Personally, I wasn't a huge fan of the duck meat.\n\nThe Yelp waitlist option is extremely useful, especially if you don't want to wait long. The interior is clean and quite spacious with a few large tables in the back. The chairs are surprisingly comfortable and the lighting is optimal. The digitalized ordering system cuts the need of a waiter taking your order. While the physical menu shows the description of each item, the digitalized ordering system shows helpful photos of each item so you know exactly what you're ordering. \n\nI would definitely come back for the chicken udon alone.",
        "author": "Sandra N."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-02-06",
        "description": "3.5 rounded up to 4\n\nI really enjoyed the niku udon here. Truffle udon was ok but kind of too heavy.\n\nThe main thing I can't seem to get over is that the freshly made udon is served al dente...but almost too al dente (undercooked??). I actually prefer the soft, slippery texture of frozen udon to what was served here, although that might be a personal preference.\n\nGiven the convenient location, I'd come back for the niku if I were shopping in the area. But it's not really a place I'd go out of my way for. I'd also hesitate to get anything other than the udon.",
        "author": "Anna C."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-01-15",
        "description": "My bf and I were planning to go to Stanford mall, so we looked up some places to eat in the area. This place caught our eye and they have yelp waitlist so we joined the waitlist on the way there which super convenient! We ordered the Tori udon, the duck tsuke don, and a Pork Belly Kakuni Don mini on the side to try. The tori udon was good, broth was flavorful, wasn't too heavy, but it wasn't anything too spectacular where I'd crave it. The duck tsuke udon was pretty good as well! It was something we have never had before, so it was great new dish to try. The soup for dipping was flavorful and thick and the udon was really able to capture the taste of the soup, yum! My bf was really glad he decided to add on a pork belly don because the flavor was very unique and it was very tasty and flavorful, would definitely recommend this dish. \n\nOverall, the food was pretty good. It is also very efficient with its waitlist system on Yelp and the ability to order food and services via their tablet at every table! I loved how we were able to take our time and look thru the menu at our own pace with pictures on the screen and having the ability to request for water and take-out boxes without having to flag down a waiter.",
        "author": "Bailey L."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-22",
        "description": "The panko crusted eggs and pork belly were amazing (we came here for the eggs, someone recommended). The service is crazy fast which is nice as you can order a bunch of appetizers on the tables iPad as you go. The fried chicken karagge is soooo crispy and good. We also love the fried shrimp, and the salmon udon bowl.\n\nThe noodles were just ok -- nothing special. It did come with a lot of tasty toppings and veggies though!  We come back here pretty much once a week for the tapas style appetizers and anything pork belly. :)",
        "author": "Alex G."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-02-22",
        "description": "Ambiance and atmosphere of the restaurant was nice, but honestly the food was pretty underwhelming. The appetizers seemed better than the entrees, which is a bit surprising since their specialty is supposed to be the noodles. \n\nThe ebi fry is a panko breaded shrimp rather than traditional shrimp tempura. Still tastes fine. Kaki fry was also good. But all of the entrees were underwhelming. The mini ikura and salmon donburi was hard to finish. The ikura was so sweet it really wasn't enjoyable to eat at all. I had to soak the ikura in soy sauce to make it palatable. The niku udon was also ok at best. There was a lot of meat, but it was pretty tough. And the soup base overall was quite salty.",
        "author": "Stephen C."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-02-05",
        "description": "I really like the ambience of this place. One cool and convenient thing about this place is their ordering process. You can place your order through the iPad attached to each table. I like the visual effect of ordering through the iPad.\n\nFood: 3/5 I got their tori udon and that was a little disappointing. The broth was too bland and it didn't taste any special or good at all. We also got the seared salmon and that was not good as well. We did like the vegan roll, it was tasty.\n\nPrice: $$ some dishes were a bit too pricey\n\nI definitely had high hopes on their food. If I ever come back, I will try a different dish.",
        "author": "Hoa L."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-12-27",
        "description": "With a limited amount of restaurants in the Bay Area with in house-made udon noodles, Taro San was on my list for that sole reason.\n\nSmall restaurant with limited seating, open kitchen and freshly cut udon in the front window. A menu consisting of appetizers, salads, udon, seasonal dishes, and sashimi. The restaurant is run very similar to Yayoi in Cupertino, basically you \"order\" everything you would need service for and the staff will provide whether its a water refill, food orders to even napkins.\n\nGot the 6 Piece Toro Trio Omakase, Niku Udon and tried the Duck Tsuke Udon. \n\n6 Piece Toro Trio Omakase - seared salmon toro, nice sear but a bit on the small size in terms of portion and for salmon toro it's not as buttery or soft as I've had elsewhere. Hamachi toro was good, light flavor, soft but fresh. Tuna toro, this one looked like raw meat with a lot of marbling it was crazy. Super buttery, melt in your mouth sashimi it was like chewing butter. It only missed the mark because there seemed to be a bit of tendon which was hard to chew through ... other than that this bite was amazing. Pricey though $25 for 6 pieces.\n\nNiku Udon (added soft boiled egg) - strong dashi flavored broth, chewy and thick udon noodles, topped with tempura bits, spinach, napa and thinly sliced ribeye. The ribeye was tender and flavorful! The soft boiled egg was cooked perfectly and gooey. A good portion of noodles and nice complex and bold tasting broth.\n\nThe Duck Tsuke Udon - dipping udon in a fatty, rich duck and dashi broth. The concentrated broth was rich, sweet and savory. The lime wedge served with the udon was a nice touch as to cut through the unctuousness of the broth and seared duck breast. \n\nWhat to say about the service ... it took about 30 min to dine in for lunch and you basically order everything from the tablet. Food came out in a timely manner and price is a bit steep for what it is- then again look around at where we are, haha! Servers didn't talk much, so not that impressionable. \n\nAll in all, food is alright here but not amazing. However, not worth waiting too long in line for. Also, if you do plan on coming here during peak time do yourself a favor and join the Yelp waitlist to speed things up a bit.",
        "author": "Janet N."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-01-30",
        "description": "They do a denser chewier version of udon here, perhaps Kagawa style? I liked this style of noodle  but for the kake udon, the broth was way too salty that I had to add water to it. Good thing for Hapoy  Hour (3-6 pm) the kake udon is only $5!\n\nOther standouts for me were the chicken karaage and the hamachi toro sashimi. The salmon pairing with soy based sauce and jalapeño didn't really work for me.\n\nThe ordering and food delivery is quick because you use the iPad by your table. I wish they gave us little plates since we shared a lot. They also don't clear your plates until you end the meal so also wish they did because we ordered a lot and had to rearrange and stack plates.\n\nI would come back for their affordable happy hour deals. During the weekday there's almost no waIt. I unfortunately didn't get a taste of the chicken and the beef udons that were also ordered though  the beef slices looked like they had a good amount of marbling on them.",
        "author": "Derek L."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-01-05",
        "description": "The curry broth wasn't overly salty, not too watery, and the noodles were firm and chewy. If you prefer your broths to have a bolder flavor, I wouldn't recommend this place for you. However, it is a solid restaurant to get your udon fix.\n\nTwo of my friends and I came around 12 pm on a Sunday. We barely beat the lunch hour rush. Definitely get in the yelp waitlist line before you arrive.",
        "author": "Sam L."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2019-12-14",
        "description": "Like a higher-quality YAYOI (order at the table on an iPad, etc). \n\nBut I'm here to talk about something specific, which is: this is a great place to eat a decent Japanese meal with a small child. \n\n+Plenty of high chairs.\n+Kiddie-sized bowl, flatware, and non-breakable water cups available as needed.  \n+On-demand napkins via the iPad. \n+Kid's udon is extremely large portioned for $5. Our daughter loves the springy udon noodles and rich, flavorful chicken broth (I'll add: Mama does too). We usually add an egg, which is popular with our little one.\n\nThe only thing that can be a little tricky is that the tables are small, so it can be hard to arrange items to `keep your grown up hot/breakable dishes out of reach.",
        "author": "Monica S."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-12-17",
        "description": "Was quite a wait to get a table (an hour wait for Sunday lunch) but you can walk around the Stanford mall while you're on the waitlist so it's not too bad. \n\nMy favorite dish of the day was the pork belly rice bowl that we ordered with a deep fried, soft boiled egg. Perfect combination of flavors and textures! Pork belly was tender and fatty, rice was perfectly cooked, and the egg yolk was runny  and wrapped in a crispy panko crust. \n\nWe also liked the Tori Udon. You can order their udon bowls to be less salty, which I appreciated.",
        "author": "Hannah L."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-03-13",
        "description": "3.5 stars - I was a little disappointed with Taro San as I had really high expectations for this place. I'm a huge udon lover, and the chewiness of the udon missed my expectations as the noodles were a bit too hard (somehow not \"right\"). The pork belly rice was really good (so a redemption there); and the atmosphere is a nice place to chill out and get a pitcher of beer with friends, so will definitely give this place another shot.",
        "author": "Connie C."
      }
    ],
    "servesCuisine": "Japanese",
    "priceRange": "$11-30",
    "name": "Taro San Japanese Noodle Bar",
    "address": {
      "addressLocality": "Palo Alto",
      "addressRegion": "CA",
      "streetAddress": "717 Stanford Shopping Ctr",
      "postalCode": "94304",
      "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media0.fl.yelpcdn.com/bphoto/YrbxwrJhev-j6CWHFew0tg/ls.jpg",
    "@type": "Restaurant",
    "telephone": "+16508152700"
  },
  {
    "aggregateRating": {
      "reviewCount": 1136,
      "@type": "AggregateRating",
      "ratingValue": 4.5
    },
    "review": [
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-04-13",
        "description": "Whenever I kissed home cooked desi food, I venture out to Palo Alto and head straight to Zareen's. The service is impeccable and even when things are really busy the staff is quick and well-equipped. \n\nMy husband and I usually end up here on Sunday's and tend to order the nihari, the halwa puri platter, the nasal omelet, and the gola kebab. Everything is spot on (though my only gripe is that I can't get extra serving of the halwa alone) and the free chai is an added bonus!",
        "author": "Anum H."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-04-03",
        "description": "My boyfriend found this place and I'm so glad he brought me here to try it out! I've never tasted good quality Indian food until now! Loved this place so much, I brought my older sister here. And she loved it so much she brought her colleagues here! \n\nThe line can be pretty long, sometimes even out the door. But the wait is so worth it to me. They also charge a service fee for dining in. After ordering your food at the register, the staff will bring your orders to your table and clean your table after you're finished. \n\nI always order their Chicken Tikka Masala Meal w/ a side of garlic naan. The plate may look small at first, but it is super filling! If you love a good mango yogurt drink, then you should try their mango lassi! They also offer free hot chai tea for anyone dining at their store. Perfect for the cold days! \n\nWill definitely be a returning customer!",
        "author": "Izzy N."
      },
      {
        "reviewRating": {
          "ratingValue": 2
        },
        "datePublished": "2020-03-29",
        "description": "This review is specifically for takeout. We usually dine in but picked up Sunday special breakfast (halwa puri) today.  The serving size was a third of what you get in dine in. See picture of the sides we got. \nQuite disappointing. \nIf you're going to pick up, make sure you check what they give you.",
        "author": "Ahmad Z."
      },
      {
        "reviewRating": {
          "ratingValue": 2
        },
        "datePublished": "2020-03-15",
        "description": "I went to the Palo Alto Zareen restaurant expecting to get the same kind of food that I got in the mountain view. \nThe curry was bad and watery.\nRice was not cooked properly.\nNaan was ok.\n\nThis review actually reminded me of the bad review that my friend wrote 3 years ago.\nI will be sticking only to their mountain view branch.",
        "author": "Krishna M."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-03-07",
        "description": "Delicious. Order the chicken tikka masala plate + garlic naan. Get a nice warm cup of chai or two. \n\nLines can be longer than I want on weekends, but the hype is well worth it. Even though it takes some time to place your order, it tends to come out quickly after you find yourself a seat (if you are lucky!). Many families seem to come regularly.\n\nBe aware of the service fee if you eat there. You order at the counter and they bring the food to your table. After you're done, they help to clear the dishes. \n\nCan be a bit chaotic when you first arrive, but always a good meal.",
        "author": "Rosa Y."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-03-26",
        "description": "Looking for Pakistani/American fusion? Zareen's mission reads that they provide, \"contemporary Pakistani and Indian Halal food.\"\n\nI enjoy food from this area of the world and had a good first experience here. The line was pretty crazy at lunch time, but it moved fairly quickly. If you have a strict lunch hour, I suggest getting there early!\n\nBased on a recommendation, I had to get the Punjabi Chicken Burger for my first visit. It sounded intriguing and, while not something that I htink is \"authentic\" by any stretch of the imagination, it was an experience. THis thing is an herb and spice marinated ground chicken kabab topped with onions, and chutneys. It is served with masala fries, which are themselves pretty interesting. I added jalapeños and cheese (an additional charge, but worth the extra, IMO). Without the peppers, it is supposedly \"medium spicy\" .. with the peppers, I think you get to roll the dice a bit and it varies depending on where the peppers grew :)\n\nOne of my coworkers had the naan, which he shared and I found to be very tasty: good texture and flavor. \n\nThey have chai and water available for free at dine in. Please respect the 3-cup limit for the tea -- as the sign indicates, save some for others!\n\nI enjoy tikka masala, daal, paneer and curries, of which there are several on the menu. \n\nI'll happily return next time I am in town... once we get through this mess with the virus and all.",
        "author": "Doug B."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-28",
        "description": "I've tried dozens of Pakistani and Indian restaurants around the Bay Area and I keep comparing each and every single restaurant to Zareen's but there's no comparison. This is hands down the best place to eat Pakistani food in the Bay Area. From the puri, naan, parathas to the Chapli kebab and madras burritos, they're making them like you would expect them to be made in Pakistan. I've never even had a madras burrito and it just tastes authentic!\n\nLines are long here and the food is super fresh so waiting is expected before and after you order but if you time your meal around early lunch or late lunch (not at noon), you'll get the perfect fix for a weekend brunch. \n\nIf you're vegetarian, they have tons of options and if you're a meat-lover, please try the chapli kebab, it's pretty much the closest to one I've had in Pakistan. \n\nSometimes, you'll even spot Zareen helping out around the restaurant which goes to show how committed she is to keeping the restaurant running at optimal speed. \n\nI also really enjoy seeing the various literature around the restaurant from the Pakistani truck-isms to all the interesting and progressive memes, and especially the books around the restaurants. It's like a window into the personality of the restaurant.\n\nIf I had to improve on one thing about the restaurant, I'd want the space to be a bit bigger with more seating especially during busy hours. But other than that, everything is perfect about this place.",
        "author": "Muhammad U."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-02-02",
        "description": "Zareen's many patrons' happy eat spot.\n\nRooting for it to get a more spacious location to update its furnishing, create a better flow of ordering area with double doors away from the tables!",
        "author": "Christine H."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-01-20",
        "description": "Came here for the first time recently after hearing about all the hype...and loved it!\n+ it's usually busy but the line wasn't too bad when I went around 1:30 on a Saturday\n+ cute decor and funny little cartoons lined on the wall on the way to the cashier \n+ friendly employees!! (One is them befriended my friend and gave us free mango lassis which was so sweet)\n+ onto the actual food..they have specials each day! I came on sat just in time for their halwa puri (think it's there only on weekends till 3 pm) was very good and tasted authentic like someone in my family made it \n+ loved the mango lassi so refreshing\n\n- slightly too oily but it's puri so what do u expect",
        "author": "Mahima D."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-01-16",
        "description": "I had heard from several friends that they enjoyed Zareen's so I was excited to finally try it! Stopped by for dinner after work with my colleagues and we enjoyed our food while catching up. \n\nFood: \n- Chicken Tikka Masala Meal--$11.25\nThe chicken was succulent and juicy and the tomato cream curry was savory, flavorful and creamy. It went well with the fluffy basmati rice. The meal also came with dal, chopped salad, and a green salad which was refreshing to eat between bites of the warming curry. \n\nTips:\n- Line up to order food at the front, and then find a place to sit. \n- There is free chai tea that you must drink because it's warm, and has just the right amount of spice and sweetness. You can find it right next to the utensils and cups, and you are allowed to have up to three cups of chai.",
        "author": "Lara T."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-03-09",
        "description": "My job raves about this spot. DEFINITELY WORTH IT AND WORTH THE WAIT! \n\nPolite and quick service. Manager walks around asking how everything is going. I will come again. Palak paneer BOMB and garlic naan BOMB!",
        "author": "Taylor H."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-03-07",
        "description": "I've made so many trips up to the Bay just to have the Nihari here. It blows Sabri Nihari in Chicago out of the water. \n\nI had my first experience with Zareen's after a Google interview in Mountain View and it was quite good. The Palo Alto location is bigger and has items the MV location does not. \n\nIn my opinion the best time to come here is for a Weekend Breakfast/Brunch. Get yourself the Nihari, Halwa Puri and Omelette/Parata special with some Mango Lassi. Try to get here when they open otherwise except about a 15-20 min wait to get to the front of the cashier as all items are made to order. \n\nA lot of the food is organic which makes it unique compared to most Pakistani restaurants and a lot of the decor has homey/hipster feels.",
        "author": "Daanyaal K."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-24",
        "description": "Came here based on yelp reviews and loved it! I haven't had indian/Pakistani food in a while but this definitely makes me want to come back and eat it more often! Got here before the lunch rush around 11:45 and the line wasn't quite out the door yet. All the food being brought out made me salivate. My husband wanted to compare their chicken tikka masala with others that he's had and I got the chicken boti sizzler (regular size). The regular size is definitely filling, so if you're eating it by yourself I would recommend the small. The chicken comes out sizzling on a hot iron plate and has a charred flavored that really is complimented by all the spices. The chicken tikka masala was so yummy! Probably the best I've had in this area. Garlic naan is a must. I did notice they had a cheese naan, and want to try that next time. We also ordered potato samosa for our daughter but it was too spicy for a 2 yo. So we gladly ate it for her. The chai tea is free! \n\nDuring the lunch rush seating can be hard to find but hopefully people are kind enough to double up on tables outside. Service here is fast and friendly.",
        "author": "Mia S."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-03-04",
        "description": "There's a long line of people before you get to order for a reason. The food is delicious, the meals are filling, & there is always the option to sit inside or outside. The paneer meals are always good with any kind of naan on the side.",
        "author": "Ariel J."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-12-10",
        "description": "Pros: Puri on the weekends (before 3 pm), a wide variety of vegetarian options, platters come with salad and dahl soup, tea available (free), back entrance into the restaurant from the parking lot, open Tuesday - Sunday. Online order and pickup inside available (best option), or you can do UBER EATS (yes, they're on there).\n\nCons: Tables are small for a party of 2. I don't think they have enough tables and chairs for the number of customers that come here; most customers have to do takeout because there are NO SEATS. Wait lines are LONG from 12-1:30 pm, so come early (1130 am) or around 2:30-4 pm. Any time other than these, you will find yourself in line for more than 30 minutes. \n\nI love the vegetarian samosa and the chicken tiki masala. Portions are good, and dahl soup is okay. I only enjoy the Puri because it goes so well with the Tiki Masala creamy tomato soup. To order a platter without NAAN bread is a NO NO! Do it; you won't regret it. The chicken Boti is good, but I think it could use more spice/flavor. I'm just eating grilled chicken. One thing they are good at is customer service and getting a take out order RIGHT! I have ordered here more than 6X for takeout (usually eight menu items for groups) when they are super busy, and they always manage to have everything correct. That, I appreciate a lot because many other restaurants miss something 1 out of 6. So kudos to you guys!",
        "author": "Lei F."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-09",
        "description": "One of my favorites when I'm seeing a movie at the theatre in Mountain View on California ave for business.  The naan is to die for ;  cheese sesame garlic or plain.  All really crispY puffy and addicting.  There is nothing on their menu that is not exCellent. I'm a fan of their tiki Masala and boti.  Tea is gratis on the premises.  \n\nAlways a very long line by 6pm. ( to the sidewalk and through their large  patio in front )",
        "author": "Ang P."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2019-12-18",
        "description": "Zareen's is indeed \"Woohoo! As good as it gets!\". I eat a ton of Indian food and can honestly say that this is some of the best you can eat in the Bay. It's so good I will voluntarily and happily drive from the city down to Palo Alto to get this in my belly. Their dishes are perfectly spiced.\n\nThe cheese jalapeño naan is ridiculously good. I always order it and then eat way too much and then waddle out of the place going \"aaah I ate too much\". \n\nAs a vegetarian, there are actually too many good options here. The madras is awesome, and so is the tikka paneer. Their samosas are bomb. Their burger samosa thing is yummy. They have fries that are good. They have free chai. Not sure you need more incentive than that, but they are also quite cheap. \n\nOne downside? Word got out and holy moly this place gets busy at all times. Don't stress, you'll find a table eventually and all will be worth it.",
        "author": "Ellen H."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2019-11-20",
        "description": "Zareen's is completely worth the hype and wait. Everything on their menu is delicious! I usually get the vegetarian  masala burrito and potato samosas. The flavors are SO rich and good, and makes you keep eating the whole thing. They also have free chai tea that is perfect for any meal you get here.\n\nI really appreciate all the books and cards they have lined on the line to order food. They are all inspiring quotes and saying that really brighten your day  \n\nAlready looking forward to my next meal here again!",
        "author": "Min Joo K."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2019-11-23",
        "description": "Delicious!! \nI find it hard to find really good Indian food in the bay however this place is up there!\nI got the chicken tikka masala meal with sesame naan. Really enjoyed it, the curry was creamy and spicy while the naan was nice and doughy.\nWe also shared a samosa which was on the spicy side but still yummy.\nOnly con is this place is crazy busy! The line moves slowly but it's worth the wait.",
        "author": "Jade L."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-10-25",
        "description": "There are certain categories of food I feel more qualified to judge and write reviews about than others.  I spent many years living in Japan, so I am well-versed in anything Japanese and Asian food in general.  But Indian food would be the other cuisine I would name as one that I feel I'm qualified to give some opinions about.  My wife is from India. We've traveled throughout India and we cook Indian at home all the time.  \n\nI've had Zareen's bookmarked for a long while, but every time we drive by, the line out the door drives us away.  The other day though, we committed to go to Zareen's no matter what the cost, no matter how long the line was - we made up our minds to wait.\n\nALOO METHI - Potato w/Fenugreek Leaves (5) This is one of my favorite Indian dishes.  I could eat this all day. Many mistake the Fenugreek leaves for spinach, but Fenugreek leaves are a different beast altogether. They have a different texture and flavor than spinach.  Love the combination of the potato with Methi.  SHALIMAR in Fremont has some killer Aloo Methi.\n\nCHICKEN TIKKA MASALA (3.5) I am wild about Butter Chicken and Chicken Tikka Masala.  I order it wherever we go.  This one was all right but I prefer a stronger tomato flavor, a bit too creamy for me if that's even possible for something to be *too* creamy.  Still nice to have on the table, just not my favorite dish.  Best Chicken Tikka Masala/Butter Chicken might be PAKWAN in Fremont.\n\nNIHARI (3.5/5) Nihari is a slow-cooked stew, usually with beef but could be made with other kinds of meat. My wife loves Nihari and is constantly on the search for the best.  I don't remember her saying anything negative about this one but I didn't love it.  The flavors were right on but it was a bit one note and stodgy.  While I realize it's a stew and most stews have a thicker broth, I prefer Nihari that has a thinner broth which is hard to find here in the States.\n\nPOTATO SAMOSA (3/5) They looked better than they tasted.  Every place has their own version of samosa and this version was a bit dry and uneventful and didn't wow me.  If you're eating a samosa for the first time, you might be impressed but there are many-a-samosa to be had out there.  I hate to sound like a snob. Best samosa for me is MILAN in Milpitas.\n\nPLAIN NAAN (5/5) Ok, their naan for me was the winning ticket.  This is my kind of naan.  Substantially doughy, and retains it's doughiness even after sitting for a while.  This naan had that great, intoxicating aroma of bread fresh out of the oven.  I live a low-carb lifestyle, but these, I'm sorry.  I'll have the whole basket to myself.\n\nThe wait in line at Zareen's was especially difficult because you're waiting in a single file like that starts on the patio that allows dogs and screaming, wild children.  Nothing against dogs and kids, just hard to co-exist with them in a very tight food line. The very long line curves through very narrow spaces and you have servers trying to navigate through these same narrow spaces every two seconds.  You feel like you're always in the way (and you are) so it's a very claustraphobic, uncomfortable experience. \n\nThat said, good Indian food is hard to find.  My wife and I say that all the time and it's true.  You will find good Indian food at Zareen's - no doubt.  The question though, is the line justified, and is the food worth the wait?  For me it isn't, but that's me. I don't like waiting and I'm allergic to crowded spaces.  I love Disneyland but the lines and the crowd chaos suck the happiness out of the experience for me.  \n\nSo the food was 4 stars - the wait was a serious zero star experience.\n\nThe answer might be, order your food to-go.\n\nOr come when there is no crowd frenzy.\n\nOr, the answer might be, try to find your good Indian food at another place that doesn't sport a line.\n\nBut whatever the case, you should at least come once to try the food at Zareen's.  I'm interested to see what YOU think.",
        "author": "Darien R."
      }
    ],
    "servesCuisine": "Indian",
    "priceRange": "$11-30",
    "name": "Zareen’s",
    "address": {
      "addressLocality": "Palo Alto",
      "addressRegion": "CA",
      "streetAddress": "365 S California Ave",
      "postalCode": "94306",
      "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media0.fl.yelpcdn.com/bphoto/woURf9e-BzQH4wtsTBuUug/ls.jpg",
    "@type": "Restaurant",
    "telephone": "+16506008438"
  },
  {
    "aggregateRating": {
      "reviewCount": 56,
      "@type": "AggregateRating",
      "ratingValue": 4.5
    },
    "review": [
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-03-07",
        "description": "To celebrate my 30th birthday, I decided to dine at a Michelin starred restaurant as a treat for myself. The food was great and presented very nicely\n\nAtmosphere: \nNot your typical intimate fine as the dining experience will have everyone sit at a communal table. There's enough elbow room for everyone but you're close enough to hear other people's conversations just FYI. All the food is brought out at the same time for the entire table. All the waiters actually synchronized placing every plate down in front of their guests which was cool!\n\nDisclaimer - my words can't do justice to the taste of every item, but I'll try\n\nFood: \nThe menu was fixed and it's the same for everyone with the options for somethings extra here and there throughout the dinner.\nThe night starts off with hors d'oeuvres of oysters that were nice and slightly tangy followed by a rich crunchy lobster biscuit. Afterwards a surprisingly tasty piece of pork belly and octopus. Lastly a piece of soondae salted shrimp that had an ok \"plain rice\" taste to it.\nNow for the main dishes:\nSpanish mackerel had a salty and sweet taste with the sauce.\nDungeness crab and smoked hamhock dashi and emulsion had a hearty comfort food taste to it\nSablefish with shiitake mushrooms on a lot of sablefish bone sauce, all mixed well and was a nice bite.\nVery tender roasted duck with a sweet crispy skin paired with honey nut squash.\nPerfectly grilled wagyu galbi  accompanied by pickles that tasted like crisp apples and lettuce to make a wrap.\nLastly a hearty bowl of anchovy and abalone rice for the savory galbi.\nDesserts:\nIced milked and candied mandarin was a nice contrast to the final main dish.\nBlack sesame brownie topped with gold-leafed hazelnut paired with a small scoop of crumbled banana ice cream.\nGotgam mille feuille that tasted like fruit jam and cheese, yummy.\nLastly a chocopie that tasted ok.\nEveryone was given a big of caramel macaron to take home and that was delicious.\n\nFYI: The bill is paid upfront online when reservations are made. So when you're asked if you'd like to have something that wasn't on the menu, you'll be charged for that and will receive another bill at the end for all the extras.\n\nOverall I left very full and satisfied and the night was definitely a Michelin experience.",
        "author": "Ben N."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-14",
        "description": "Don't know where to begin. This was one of the more unique dining experiences in the bay area. You should anticipate feeling like a food critic, with the amount of information you get at each dish and offers for you to take photos.\n\nTry to starve yourself for a day before coming here, as the entree will blow your mind and a small hole in your stomach if you're committed enough. \n\nThe appetizers were one of my favorites- take a moment of zen before you start on the chestnut bite. Literally one bite of perfection. Lost track of count of the courses so here are 23 photos to keep you hungry.",
        "author": "Danny H."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2019-12-26",
        "description": "Hidden behind veiled blinds, Maum grants guests the exclusive experience of Korean food-inspired fine dining. Knowing that I could go to Santa Clara and get Korean food for a fraction of the cost, my main question (which I'm sure many consider) was: Is it worth it? \n\nLet me tell you now: oh yes, it was. \n\nUpon entering the restaurant at 7 pm, we were asked: (1) could they take our coats, and (2) what drinks we would like to start off our evening. Usually, when hors d'oeuvres and drinks are served while everyone is standing, there is the awkward how-do-I-balance-all-my-food dance. However, Maum's space is designed with long wood slab shelves at arm-height where we could put our drinks while picking up our hors d'oeuvres. (It should be noted that the wood shelving, the long wooden table, and the rotating wooden slabs are all made out of a single tree--a detail I loved learning.) There were 5 small bites to start (in order of favorite to least favorite): Dungeness crab puffs, raw oyster with vinegar chili, quail egg with beef tartare, eel on top of brioche squares, and pork blood rice cake. \n\nThen, we were seated to face those in our party. For example, if you came in a pair, you would be seated across the person you came with, but you would be sitting directly next to someone from another party. The communal table feeling is reminiscent of family-style dining often found at Asian gatherings. There were then 7-ish courses that graced our table; with each, a brief introduction before we dug in. Our menu was (in chronological order): caviar with finely-mashed (like a puree?) sweet potato, scallop with smoked ham and hearts of palm, shrimp oden with hen broth and seagrass, sablefish with pureed shiitake mushroom and bone sauce, quail with black girl and sun choke, wagyu galbi with pickles and kimchi (my personal favorite), and chanterelle rice cooked in a stone pot with light seaweed broth. Whew! It was all mouthwateringly delicious, and I was definitely satisfied by the end. \n\nLastly, dessert! There were basically 4 desserts: shaved ice with some condensed milk and small slices of kumquat, squash \"pie\" with acorns and farm honey, high-end chocopie, ginger ice cream sandwich with sesame cookies, and in a little to-go box, makgeolli rocher. \n\nMaybe it's because Asian flavors are my favorite, but my stomach and I thoroughly enjoyed this meal. It is a great spot for special occasions, or if you just want to treat yourself. Oh, and the staff was so accepting (and even encouraging!) of photos, so I was able to relive my experience by looking through my photos for this review. I'm already thinking about the next special occasion I can use as an excuse to come back!",
        "author": "Jennifer W."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-11-12",
        "description": "Beautiful supper club space: \n*generous staff welcome guests and at your disposal throughout the evening \n*night starts standing, while little bites are walked over to you, love the slim wooden counter space to rest your arm and drink, oyster was the standout for me out of the four items, bright, briny \n*favorites of the courses were: scallops, uhmook, chanterelle/black truffle rice and the predessert, yogurt with Douglas fir.  \n*most of the ingredients are local and/or specific to Maum\n\nSolid meal.  It would be nice if they wrapped the price of coffee/tea into the tickets.  If you want to split the wine pairing it's an additional $40 and they do pour a bit more to accommodate.  \n\nWould definitely revisit in another season to see what the chef does with all the local farmed produce from Los Altos.",
        "author": "Cynthia C."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2019-09-02",
        "description": "From the unassuming exterior, you wouldn't guess that a Michelin-starred restaurant sits in the middle of downtown Palo Alto (between a slider bar and pizza place, no less). However, if you happen upon a reservation, you're definitely in for a treat!\n\nA private dining club turned restaurant, Maum has one seating a night at 7pm and, similar to Lazy Bear, features a long 16-person communal table. The interior is simple and minimalistic, yet still retains a classy atmosphere without being pretentious. \n\nThe first 30 minutes are spent at the standing areas on the sides of the dining room, and you are able to order drinks as they pass a series of canapés and small bites. Then, you are seated at an assigned place at the long table across from your dining partner/party (they only allow groups of 2, 4, or 6 to keep it even and prevent a larger party from affecting the experience for others). \n\nThere were about 14-15 courses total including the opening bites, a bit hard to say exactly since some of the courses have multiple parts! I won't give too much away, especially since the menu changes over time and depending on the season, but it was very nice to experience a more \"modern\" Korean menu instead Korean \"fusion\" - there's nothing at all wrong with this, but Maum did a great job of elevating and highlighting certain aspects and traditional dishes from Korean culture and cuisine. Despite not being Korean, there were still many familiar/similar dishes and things I could relate to, which was comforting and nostalgic. Each course was displayed beautifully and had a variety of flavor and texture - we had some favorites but there was nothing I disliked. The pacing was perfect throughout (duration of 3 hours exactly), and we were quite full but not painfully so afterwards! \n\nBecause there is only one seating a night, Maum truly is able to cater to your experience. My early birthday was acknowledged when they brought out a slightly different dessert (with candle!) for one of the last courses. Service was fantastic, staff was extremely polite and professional, and small details were not overlooked - I was especially impressed with how plates would get set and cleared in sync down each side of the table and how they noticed I was left-handed and started placing my silverware on my left side instead. They also offer both an alcoholic and non-alcoholic drink pairing (and the sommelier is very enthusiastic and knowledgeable) but there was no pressure to partake in one and it wasn't pushed once we opted to go by the glass.\n\nOverall, we had a great time! Being more of an introvert, I wasn't sure how I'd feel about the communal table, and like other people have said, you're fairly close to your neighbors, but there was definitely still enough personal space to keep to yourself at times as well. It may have helped that we were seated at the end of the table - just something to keep in mind! One of the only tiny flaws was that they do ask you if you want coffee/tea at the end, and this is actually not included. Since we ordered drinks anyway, we still had a check despite pre-paying on Tock, so it wasn't a huge deal, but it was a bit unexpected since we've had it included at other places before. Otherwise, our night still ended on a good note and we were sent home with adorable bags of black sesame sticky bread...which I promptly devoured in the car. Delicious!",
        "author": "Brittney K."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2019-07-28",
        "description": "Korean fine dining? Sign me up!\n\nI was very excited to try this modern take on Korean food, and I was very pleased. My friends and I were so pleased that before our meal ended, we were making plans on when we will be back.\n\nInterior was simplistic, modern, and minimalistic. Dinner style was identical to Lazy Bear with appetizers served while standing up, then seated at a 16-seat communal table. The chef and sommelier announced the serving of each new course, along with an explanation of the ingredients and preparation. Service was excellent and made me feel like a princess.\n\nMy tasting menu was pescatarian and dairy-free. \n\nAppetizers - Besides the oyster, the rest didn't have much flavor but very cute presentation!\n\nOyster, Apple Ice - Refreshing, light juice soaked onto shaved ice as a topping over small oysters. Great contrast of textures! \nSquash Blossom Tempura - Warm, bland, comforting. \nCarrot, Dwenjang - Tasted like a carrot.\n\"Uhmook\", Hot Mustard - Thin, tiny fish egg roll. \n\n---------------------\n\nMains - Excellent! It was amazing how fragrant and fresh each dish was before the waiters even served it. Never had a meal in my life where the scent overpowered the taste!\n\nMaum Caviar, Radish, Charred Onion - Surprisingly, they took out the salty, fishy taste of the caviar. It tasted like a bunch of tiny squishy balls in a cold, neutral jello. \n\nTomato, Corn, Seagrass - Juiciest cherry tomato ever! Corn purée was delicious. \n\nSomyun, \"Mulkimchi\" - The shaved ice makes another appearance. I loved the cold noodles and the fish broth was oddly the most refreshing thing I've had all summer long. \n\nSea Bream, Bone Broth, Kelp - Bland, warm, comforting. Bone broth warmed my stomach. \n\nBelt Fish, Gochujang, Perilla - A new fish to try! Soft, crumbled into pieces. Orange sauce had a kick to it--couldn't handle it. Eggplant was on point. \n\n\"Mackerel\", Ssam, Pickle, Jang - Thick, flaky, soft, and massive piece of mackerel. The lettuce was a fresh and pretty display. Kimchi was sliced delicately. It tasted like any other kimchi.\n\nAbalone and Morel Rice - Fried rice was so good, slightly oily, and glistened. Probably the best fried rice I had in a long time.\n\nBroth - Simple, warm, comforting. Filled with seaweed squares.\n\n----------------------\n\nDesserts - Light, refreshing, nostalgic. Again, the scent of the sorbet desert items were refreshing and aromatic.\n\nAlmond, Cucumber, Chamomile - I could smell the cucumber mint in the air. The almond sorbet was a savory contrast to the chunky, shaved ice with cucumber chunks and mint leave\n\nStrawberry,  Sweet Alyssum, Sorrel - Beautiful, subtly sweet strawberry ice sorbet shortcake with small strawberry slices. \n\nAsian Pear Bar - Mini pear sorbet popsicle. So cute!\n\nPine Nut Nougat - White colored with layers. Dry, soft, chewy, subtly sweet. \n\nChoco Pie - Yes, a miniature bougie version of the Asian grocery store choco pie I had when I was a child! The outer layer was a thin, delicate, crisp layer of chocolate. \n\nTake home item - Literally shrank one of those loaves of Asian braided bread from the pastry section of 99 Ranch to fit in the palm of my hand. The top portion is bland but the bottom is sugary, thick, and sweet.",
        "author": "Ee Vonn Y."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-01-14",
        "description": "I was very excited to try this Michelin star for modern Korean restaurant. Maum was exceed my expectations, food was so good and Interior decoration is modern and special.  Maum only has 16 seats, definitely need to make reservations in advance.",
        "author": "Jenny H."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2019-08-16",
        "description": "I came here for a work event and it was such a treat! Unlike other tasting menus, this one doesn't stuff you, so by the end of the meal you feel comfortably full instead of bloated. \n\nThere were about 10-12 courses (not including all the appetizers in the beginning) and we had it with the wine pairing, which was amazing! It's definitely worth the extra splurge, and I might have liked the wines better than the food itself. As an indication of how good the wines were, everyone at my table wanted to take pictures of the wine labels. They do pretty generous pours of each wine and I couldn't keep up, but you might be able to and that's probably a better bang for your buck. \n\nI enjoyed all of the courses, in particular the white asparagus and the abalone porridge. Sea bream was also great! The duck breast and the short rib lettuce wraps didn't stand out to me, but that might be because I don't enjoy red meat as much in general. Having eaten lots of traditional Korean food in LA, it was fascinating to see how they put a Korean spin on dishes using elements/ ingredients unique to Korean cooking. The combinations were very unusual but they worked for the most part. \n\nIn terms of dessert, I really liked the mulberries and the sorbet. At the end of the meal, they give you some buttery, nutty housemade granola to take home for breakfast the next morning, which is a super nice touch. \n\nThere's only one long communal table in the space, which is why it can be hard to get reservations. My entire team was there so it wasn't awkward, but if sitting next to strangers during a meal is something that bothers you, keep the layout in mind! I thought it was an incredible experience, and while I wouldn't have been able to afford it on my own dime, I highly recommend it to anyone who can (or wants to splurge for a special day). Alternatively, get your employer to take you for a special function. Eat, drink, and be merry, folks!",
        "author": "Samantha O."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-02-15",
        "description": "Three stars for the food, one star if you count price/performance.\nIt's a sad commentary on a very high-end restaurant when you have to say the best part of the meal were the non-alcoholic drinks and the performance of the sommelier.\n\nThe four of us we were singularly unimpressed with the food.  Clearly, they tried to be interesting, however most of the food was not memorable and the one dish that was, wasn't in a good way.\n\nCaviar Sweet Potato Champagne - good combination\nSea urchin ravioli - interesting and unique\nBeltfish - not really impressed.\nGalbi beef - major disappointment. The meat was way too fatty it should have been succulent and soft, but was tough and chewy\nBlack sesame, Hazelnut, Banana dessert - light and delicious. \n\nWhile we were having appetizers they came around and upsold us on a truffle addition at $40/person.  Tasteless and not worth it. Also note, that coffee and sparkling water are other \"not included\" extra charges.\n\nTwo of our party had the alcoholic pairings and we noticed they short-poured the wines. About a total of a glass and a half of alcohol after five pours.\n\nConclusion, for a high-end splurge skip this one. Instead it's worth paying for an Uber to San Francisco and go to much better choices.",
        "author": "Steve B."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2019-12-03",
        "description": "Came just after they received their first Michelin star and have to say it was worth it! Loved the interior and the wait staff was amazing as well. We even got a chance to snap a photo with the chef afterwards. All of the courses looked fabulous and I really hope that they keep climbing up and that I'll see them with their second star soon! This is definitely a place I plan to come back to to try more of their offerings. I'm still dreaming of their fish and beef mains! They even liked one of my photos enough to use on their IG, so honored!",
        "author": "Richard L."
      },
      {
        "reviewRating": {
          "ratingValue": 2
        },
        "datePublished": "2019-09-02",
        "description": "Ok, so my first review was removed by Maum/Yelp. I'm rewriting it, but with less pizzazz. \n \nBad: \nService is nervous, unprofessional and spotty. Too obsessed with an over-choreographed procession where all guests have to be as obedient as boarding school children in order to get their supper. I was YELLED at by a server to sit down because I got up to ask him to add a candle to my friend's dessert...  Extremely rude and abrupt and not worth the $700 or so.. Better, kinder service at Village Pub, Saison, Kusakabe, or Manresa - those places make you feel at home even if you don't behave like you're a stowaway on a budget airline. How dare you chastise a guest for politely making a simple common request to add a bday candle?\n\nAcoustics - horrible and made my dinner guest inaudible.\n\nSeating - way too tight and awkward. You're held hostage to multiple conversations at a time -- headache inducing. Then interrupted for each course, which is delivered with more fanfare than a visit from the queen of England. Over all I left exhausted and disappointed, but very well fed as the food was divine. \n\nI'm shocked that the owners would prefer to delete my prior review rather than to simply send a note sharing their regret over my experience and their plans to address some of the concerns if they feel they're valid. It's supposed to be constructive critique.. How can you grow to a three star if you don't evolve? My prediction is that they'll get booked out for another year, but will have few repeat patrons due to aforementioned issues that they seem reluctant to acknowledge. (Maum owners obviously preferred to pay Yelp to delete my review rather than resolve the issues, which are easily fixable with some creativity and effort.)\n\nGood:  \nFood is divine. Wine and sake unique. Lovely presentation of items I've never tried prior. Excited that more cuisine aside from Italian, French, or other Euro-centric is getting much deserved recognition on both coasts.",
        "author": "Lera D."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2019-06-05",
        "description": "If you're looking for a great place to celebrate a birthday, anniversary or something special, this is a fantastic choice. Maum is one of the best new restaurants I've tried this year. \n\nEverything is so well thought out and prepared from the moment you step into the restaurant. You start off with a cocktail hour on the sides of the restaurant, with passed hors d'oeuvres and beverages. It feels very much like a cocktail party and a great way to start off the night. \n\nLater, the guests are invited to sit. Similar to Lazy Bear, it's a large communal dining table. If you are there with a significant other, you'll be invited to sit across from each other. However, there are far fewer people at Maum than Lazy Bear so the ambiance is very different and much more intimate. People conversed with those around them and the table even engaged in a table-wide conversation at one point.  \n\nThe food is delicious. To be honest, I was a little skeptical of upscale Korean because I was worried it would either be inauthentic or just not as good as the heaping platters of galbi that I've become accustomed to. Maum did not disappoint - they were able to deliver on authentic taste in a refined manner. Every dish and wine pairing was well thought out and introduced to the guests. There was a lot of care put into the quality of the dishes, beverages and overall experience. \n\nFavorite standout dishes of the night were the caviar and the galbi ssam. So good and a complete treat!",
        "author": "Sally C."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-02-22",
        "description": "Overall the food was very good, service was impeccable, and the room was modern and clean.\n\nI made reservations online and paid right away. I don't like being automatically charged 20% tip before I've even arrived, but staff were amazing so it turned out fine.\n\nUpon arriving at 7, their only seating time, you're greeted by the door to confirm your reservation and then have 30 minutes for appetizers and drinks. \n\nWe came on a rainy chilly Friday night, so be prepared, their minimal and clean interior also means cold. I sipped on hot water the rest of the night trying to warm up. Maybe ask if you can get a seat towards the kitchen so you're further away from the door. \n\nFirst things first, the table is communal. They assign you seats and the idea is that you'll get to know your neighbors and stuff. If you're an introvert like me, I'd recommend going on a weekend. I went on a Friday and because my day was so hectic, I didn't have much downtime, so by dinner, I was already tired. The idea of making small talk with strangers I'll never see again was exhausting and overwhelming. Just something to think about. \n\nIn terms of food, we started with an oyster with kimchi ice. It was good, wish we could've had more lol. The sea urchin with soy and brioche was so smooth I wanted more of this too. Prob the best uni I've had. The yookhwe - beef tar tar, was also very good, but I'm noticing a trend of how teeny tiny every portion is lol. Soondae, salted shrimp was next but it was this stick thing that I didn't think had much flavor to it. Wasn't impressed with the uhmook either. It was missing fat or something, it was still very tender, and tasted good, but we both thought something was missing. \n\nAs for the main courses, we started with caviar with radish and charred onion. This was very good. The striped jack moolhwe was also really good. The abalone porridge, sunchoke, and Tokyo turnip was pretty good as well, but trying to remember back on it, it wasn't one of the standout dishes to me. The haemultang, sablefish and gochujang were amazing on the other hand. That fish, so good! I wish the portion was bigger and they cut out one of the other dishes just cuz I liked it so much! Next the buckwheat noodle with grilled pork belly was also good but the noodles weren't all that memorable tbh. Now you can't have fancy Korean food without fancy kbbq. The galbi, ssam, pickle, Jang and clam truffle rice, with seafood broth were all pretty standard. This is where I was finally starting to warm up lol. All very good but mostly a fan of the galbi, less so with the clam rice and broth. \n\nFor desserts we had the shinko pear 'sujeonggwa', this was light and delicious. I loved it. But I wasn't a fan of the sweet potato 'mont blanc' at all. It was so beautiful  but it was like they needed a pinch of salt or something because it was very bland. I gave it away. Finally they ended it with the choco pie, cappuccino bar that I didn't care for, and the black sesame choux which was amazing. \n\nOverall it was a great experience, but it's not worth the $228.90/person to me. With that price I expect to leave loving every single dish. And to be blown away by each one. And not freeze during it. Either way glad I tried it but didn't quite live up to the expectations I've been hearing about them.",
        "author": "Mandi W."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-02-09",
        "description": "To be honest, I definitely had my doubts being a Korean how Chef Kim could make Korean food into more of a fine dining experience. However, I was pleasantly surprised! \n\nFor the first half an hour, you are served hors d'oeuvres and drinks of your choosing. The one that stood out to me was the uhmook (fish cake) with mustard and perilla leaf.\n\nSome of the dishes that stood out:\n+ haemultang with sablefish - the fish was oh so buttery soft, the broth could have been a tad bit spicier but I'm sure they had made it palatable for all guests\n+ grilled pork belly - the softest pork belly I've tried, literally melts in your mouth\n+ galbi saam - the galbi was cooked to perfection, the saam jang was really good, the presentation was perfect\n+ seaweed soup - was a tad bit salty, but it instantly brought memories of my childhood\n+ sujeonggwa with shinko pear - love this traditional Korean dessert with a twist with the crushed ice, definitely reminded me of bingsoo\n\nThe communal seating was a bit too much for me since I like my personal space and not having to hear the other patrons during the dinner. So definitely make sure you're open to that before booking a resy here. For the price point, they are very generous with their portions which is great. Overall, a pleasant dining experience!",
        "author": "Joanne Y."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2018-12-05",
        "description": "I wanted to try this place ever since months ago when the restaurant first got its construction done. I remember walking in and asked what this space with big wooden doors going to be. Later, i learned that it's going to be a Korean fusion restaurant. With curiosity prompted by the modern decoration inside, I was determined to try this restaurant when it opens. So I patiently waited. \n\nMy girlfriend made a reservation of four. Since the restaurant is only open a few days of the week, it was hard for us to find a date and time to come together. The restaurant also prefers even number of guests to odd number. \n\nShame on us, we remembered the seating time wrong. So we were 30 minutes late to our reservation. The ironic part was that we didn't realize our tardiness until 3/4 done with our tasting, not until the guests next to us mentioned that they arrived at 7pm and had to wait for 30 minutes to sit down. The service was so courteous and proper that we didn't notice a bit of blaming us for being late, which made all of us feel even worse for being late. So be on time, people! Everyone gets seated around one long table, family banquet style, you really dont want to be late or else EVERYone will be waiting for you. Another downside of being late was we had to finish 4-5 appetizers in a very short period of time.  I, personally felt so stuffed and lost my appetite shortly after a few courses in. \n\nChoices of silverware, tableware are impressive. I believe there is tremendous amount of attention and time contributed to the curation of the bowls, plates, forks, chopsticks, and spoons. Because of my pregnancy, I missed out on the pairings. All other parties other than us chose the wine/sake pairing option. I would recommend you to do so too, not just because you appreciate alcohol, but also because when the sommelier passionately presents each bottle he hand picked from every corner of the world, you don't want to feel left out! I sure did feel that way, so I am coming back when I can drink again :)\n\nI am not going to get into too much details of each plate because i don't want to spoil your experience. It's more fun when there are surprises. \nIf I could make any suggestions, it'd be serving smaller portions. For example, with the noodle w/ pork belly, three pieces of pork belly was too much to eat with a bowl of noodles. I appreciate chef's generosity but it was too much food. And after pork belly, there was more wagyu coming.... A well balanced portion would be the key to the ultimate satisfaction, so it's not an overkill.",
        "author": "Yi Z."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2018-10-26",
        "description": "Seriously. The. Best. I'm not sure I can even summarize all of the things amazing about Maum in a Yelp review but I'm gonna try! \n\nService: amazinggggg. I've never had service like this before. Everyone was super friendly, attentive and professional. Every staff member was amazing. My fiancé brought me here for my birthday and every member of the team said happy birthday to me (and they even brought out a little birthday treat for me!) \n\nFood: superb. As a Korean, I have pretty high standards for any Korean food but Chef Kim's unique take on traditional Korean dishes like moolhwe, soondae, mandooguk, and haemultang was amazing. My favorite was the sablefish... it melted in my mouth. We enjoyed every single course!\n\nPresentation: beautiful. My pictures don't do them justice but at least I tried! \n\nDessert: felt like dessert deserved a separate section cause there were seven different desserts (yes! Seven!!) they even gave us a little cake each to take home.\n\nLocation: downtown palo alto. Community dining experience in a gorgeous space.\n\nTruly truly truly recommend checking this place out. Honestly better than any Michelin star restaurants I've ever been to. Thanks to all the staff for the wonderful dining experience.",
        "author": "Rachel A."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2020-02-15",
        "description": "Disappointing especially considering the price. On the plus side the wait staff  and sommelier were very attentive. The sommelier seems to have gone to great lengths to pair wines with each course, but I think his greatest contribution was his creative flair with non-alcoholic pairings. Every non-alcoholic drink was beautiful to look at and equally delicious to drink.\n\nUnfortunately the food did not make the grade. The Scarlet Prawn was so heavily infused with butter I couldn't get past the first bite. The wagu beef ssam was fatty and gristley. The oyster appetizer was bland. We were offered a special addition of truffle shavings for an extra $40 per person which was totally unremarkable. There was a Beltfish (imported) course that was also unremarkable. There was a very tasty octopus/pork belly appetizer that started the evening and got my hopes up, but no dish matched it for taste the rest of the evening.\n\nSo except for the nice presentation and the relaxed atmosphere there wasn't anything to entice me to return. I wouldn't recommend it to friends.",
        "author": "Phyllis K."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2018-08-23",
        "description": "Maum continues the trend of tasting menus that incorporate traditional Asian flavors in a modern and elevated dining experience. I left Maum feeling like I had a truly \"Asian\" menu (in this case, Korean), supplemented with New American and French techniques.\n\nAfter serving as a private dining space for a year, Maum opened to the public in July, with just one communal seating a night, three nights week. For our particular night, they had 18 diners, though I've read it's typically a max of 16.\n\nThe menu started off with a series of small, passed bites and drinks prior to being seated.\nOf the five bites, the corn tartlet stood out with a unexpectedly light buckwheat tart base and a sweet, yet delicate corn filling that highlighted peak corn season.\n\nAfter about 30 minutes, we were instructed to take seats at the single communal table. The following are highlights of the seated 9-course meal.\n\nCaviar - This was served with exceptionally creamy tofu, accompanied by a seaweed biscuit. The texture of the fluffy and silky tofu was unlike any tofu I've had. Frankly, the tofu stole the show over the caviar, though the combination of all three parts was harmonious.\n\nSablefish - My favorite dish! This was a perfectly cooked black cod filet in a broth of abalone, beech mushrooms, and rice cakes. The gochujang broth was a tad salty for my taste, but the flaky black cod was absolutely incredible. The accompanying ingredients also provided an enjoyable, contrasting chew.\n\nDuck \"Dduckgalbi\" - This dish was a clever play on the Korean word for meatball, dduckgalbi. The presentation was very cute, with the small meatball skewered with a tiny bone. The duck meat itself was so intensely flavorful and cooked with pork fat.\n\n\"Galbi\" - The final savory course was Korean BBQ style, with wagyu served ssam style with lettuce wraps, pickles, and jang (fermented soybean paste). The wagyu was amazingly fatty and tender in the best way. This was accompanied by an oxtail stew rice that might be my favorite rice dish I've had - the depth of flavor was unbelievable!\n\nAfter that high note, we switched gears to dessert. I'm a fan of savory ingredients in a traditionally sweet medium, and the first couple desserts were of that style. While dessert was probably the weakest link here, I appreciated the continuation of Korean ingredients.\n\nThe evening finished with a trio of small bites, including a mini choco pie! The intensely-flavored banana bon bon was probably my favorite of these.\n\nIn true tasting menu form, we were given parting gifts of strawberry jam \"muffin cakes\". The richness of the butter with the crumble topping and sweet jam base was irresistible! I devoured all of mine later that night.\n\nFor a relatively new public restaurant, I was impressed at the caliber of cooking. The tasting menu was focused on flavor first, without any crazy techniques or showy antics. The service was also pretty good, with timing being the only major area of improvement.\n\nThere was an option of wine pairings, bottles, or wine by the glass. I elected to go by the glass and thought the somm made good recommendations that supported but didn't overpower the food.\nOne of my dinner-mates was dairy sensitive, and the kitchen accommodated her restrictions seamlessly.\n\nI thought the overall tasting menu was reasonably priced for the Bay Area, and I look forward to trying future seasonal iterations.",
        "author": "Adrienne H."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2019-02-23",
        "description": "What a treat!!! Nothing like Maum experience anywhere in the bay. If you are looking for Korean fine dining experience, look no further. All the dishes were so elegantly presented and the flavors are very well balanced. The whole experience start to finish was exceptional. Great for private dining of 20 or less as well! The space is so beautifully thought-out.",
        "author": "Christina L."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2019-04-19",
        "description": "Creativity to the exquisite level. \nI had reservation here at 7 on a week day night. I barely made it as my flight back to the US landed at 5pm. The restaurant features one long dining table like how they do at single thread or lazy bear serving farm to table fresh and creative dining. Each dish was prepared thoughtfully with balance in taste, texture and art. My party did the wine pairing and was blown away with new finings that evening. Service was smooth and on point. Total came out $350/pp which was a bit steep for what's served but was a wonderful and unique dining experience nevertheless.",
        "author": "T C."
      }
    ],
    "servesCuisine": "Korean",
    "priceRange": "Above $61",
    "name": "Maum",
    "address": {
      "addressLocality": "Palo Alto",
      "addressRegion": "CA",
      "streetAddress": "322 University Ave",
      "postalCode": "94301",
      "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media0.fl.yelpcdn.com/bphoto/FdUzrMXrGEjyS30KDG-CXQ/ls.jpg",
    "@type": "Restaurant",
    "telephone": "+16506568161"
  },
  {
    "aggregateRating": {
      "reviewCount": 356,
      "@type": "AggregateRating",
      "ratingValue": 4.5
    },
    "review": [
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-17",
        "description": "A Delicious Experience! There are restaurants who that serve remarkable food and there are restaurants that have mastered the dining experience.  Zola's has grabbed a stronghold on both.  The menu is full of delicious and creative wonders.  The staff always make me feel like an old friend who knows exactly what I want.  My only recommendation is sit back and enjoy.  \n\nThe last time I took my wife, she must have shared her dining experience with almost 10 of her friend the following week.  Just go.. And don't forget to try the wine.",
        "author": "Ubuntu Y."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2020-02-26",
        "description": "Husband and I had the opportunity for a rare date night and decided to try Zola. The TL/DR summary of our experience is liked but not loved; the food is rich and delicious but in small portions. Had a great time but won't be back for a while.\n\nWe had a reservation for 7:45 but weren't seated until 8:20 and spent the 35 minutes standing in a tiny pathway of the restaurant. We had to ask for a menu to order a drink to sip while we waited and I almost expected them to comp it because of the delay. (They didn't). The service was spotty except from our main server, Esme, who was so friendly. \n\nHusband and I split three small plates, the ricotta gnocchi, and a main beef dish. Everything was great but the portions were on the small side. The check hovered around $200 after tip and we didn't even get dessert.",
        "author": "Jenn C."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2019-11-28",
        "description": "Excellent, attentive but not overbearing service. Small restaurant but completely filled up on a Tuesday night!\n\nBeet salad: very salty, great flavor but you need water or bread with it otherwise it's too much. \n\nRicotta Gnocchi: delicious, extremely filling, great mushroom flavor, very creamy sauce but crisply seared. Could serve as a main course.",
        "author": "Cherrie W."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-11-08",
        "description": "Another perfect spot for TGIF！\n\nAmbiance ：\nThe restaurant atmosphere and vibe were great and lively.\n\nService:\nThe staff was friendly and attentive.\n\n\nOrder: \nOyster w/ strawberry salsa: the highlight of today, the oysters were clean and fresh, and it's pretty amazing with strawberry salsa.\nBone marrow: taste pretty good, a little bit too fatty after couple bites.\nSalmon w/mashed cauliflower: the salmon special was pretty amazing and the cauliflower was impressive too.\nAssorted seafood special: very creative and amazing.\n\nI would come back to try other innovative items.",
        "author": "Regina W."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-08-19",
        "description": "Happy anniversary to me and my boothang!\n\nZola serves seasonal French cuisine with locally and sustainably sourced meat and produce, paired with wines from California and France. The wines we tried were ok. The grenache was good, I settled for a decent Zinfandel from Ridge since I was having meat. The real winner for me is the food.\n\nBONE MARROW (black garlic, herb salad)\n4/5\n\nTARTARE DE BOEUF (ramp dijonaise, shallots) \n4/5\n\nPORK CHOP (corn chutney, corn bread, summer squash) \n5/5\n\nROASTED CHICKEN w/ crispy skin (polenta, bacon, meyer lemon jus)\n5/5\n\nTip:\n+ Make a reservation!",
        "author": "Stephanie H."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2019-05-04",
        "description": "I ended up in here by mistake and decided to stay for dinner. I ordered the elderflower cocktail to start. The drink was slightly sweet and overall a very mello flavored drink. I had asked her to make my drink on the sweeter side, so I don't know what the sweetness would be like normally. If I was drinking it by itself and not having dinner, I'm not sure it would be that notable. It paired well with my saltier dish to help balance the dish out. \n\nThey bring out bread to the table that comes with a compound butter. It tasted like a truffle compound butter. The butter was really good. I cleaned out all the butter I was given.\n\nFor dinner, I order the short ribs, which had carrots, fingerling potatoes, and celery with it. It came out in a little le creuset Dutch oven. The potatoes were nice and crispy and had a little saltiness to them. The carrots were sweet and cooked until they were soft but not mushy. I don't like celery so I picked all the chunks out. The sauce that the short rib produced with the veggies was delicious. It was savory with good flavor and not overly salty. I dipped my bread into the sauce to soak it up and that was perfect. The short rib was tender enough that I did not need a knife to cut it. It flaked apart with just my fork. I anticipated more flavor from the short rub so that was a little disappointing. \n\nFor dessert, I ordered the creme caramel. It was pretty much like flan. The custard part itself was good. It was thick and creamy with a flan like flavor. The sauce that came on top of it had a really strong alcohol taste to it. It almost seemed like it needed to be reduced down a little more to caramelize it a little more and to burn the rest of the alchohol off.",
        "author": "Tricia C."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-11-16",
        "description": "4.5! The ambience is chill, romantic and fun. The lighting is nice and the restaurant has good energy. The host was very nice & friendly, you feel welcomed. All staff were professional & nice.\nWe ordered 1/2 dozen Oysters, delicious! They didn't give us limes but it almost didn't need it, the oysters had amazing flavor and the toppings made it even better. \nThe bone marrow had a nice sauce on it. I personally love bone marrow so much I don't need a sauce but it had really good flavor. \nWe read a lot about the Gnocchi, which I love. So had to order one. It was really good, but not necessary mind blowing. It had a beautiful aroma, with a tasty mushroom sauce, and a soft boiled egg in the middle, yum! \nThe pork chop was one of the highlights. It was a generous portion and was cooked beautifully. The sauce was sooo good that made the whole dish amazing. Definitely going back for that pork!  \nAt this point we were pretty full & happy birthday had to try the dessert too. All options sounded so good but the poached pear was unique & stood out for us. Sooo happy we ordered one. The texture & flavors we will well balanced, sweet but not too sweet and the nuts added a good texture and complimented the pear. \nOverall a success, give it 4.5 stars. For all dishes the sauce was the best part and made all dishes much much better.  \nNow the things that could be better: the salt on the table was in a little bowl with no spoon, which means so many hands have touched it. Do I really want to add that salt to my bread & butter?!\nThe bone marrow was a bit too oily, delicious was afterwards you look at the plate and there is too much oil...\nNo champaign, at least by the glass. French restaurant?!\nThe bone marrow came first which made us think they forgot about it & reminded them.",
        "author": "Haleh H."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-11-14",
        "description": "Just tried Zola for the first time. Had to snag a 7:45 reservation, because even for a Wednesday night, the restaurant was completely packed until close - which to me is a good sign of good food to come.\n\nThey had an extensive wine selection which they use an iPad to let you go through. It feels a little bit impersonal, but still ended up loving our choice. \n\nWe tried the blue crab profiteroles, beef tartare, the fish of the day, and the gnocchi. I enjoyed all courses, but next time would likely not order the beef tartare and try something else instead. I'd say 4 items was good split with two people for us to try everything. The profiteroles were a bit pricey but scrumptious, but smaller portioned. The gnocchi was a stand out dish, pan fried with rich mushroom sauce that was super comforting and tasty. The fish was fresh and complimented buy beautifully cooked vegetables and puree. \n\nThe service was attentive and was good at recommending dishes and checking up on us often (but not too much). The restaurant is a bit small and cramped but still managed a great ambiance - just a bit loud!",
        "author": "Kayla U."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-10-09",
        "description": "Their burrata salad + soft poached egg and roast chicken dishes are bomb! I loved the chicken in particular - a super crispy skin that stuck to the meat so they could be enjoyed together. The portion was very generous - I'd say enough for two people with appetizers.\n\nNice ambience with pretty wallpaper and delicious desserts as well - both the olive oil cake and chocolate mousse were quite tasty.",
        "author": "Jen L."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-02-13",
        "description": "Was here for an early Valentine's day dinner with my boyfriend and this place was such a great find! Firstly, my boyfriend was able to make the reservation easily online through Open Table. We were there a few minutes early to our reservation time but was seated promptly upon entering. \n\nThe place was small, it had approx 15-20 tables, dimly lit, with a very clean and classy ambience. Tables were also quite small and you were really close to your neighbors.\n\nWe ordered some wine and was given complementary bread and butter. The butter had an interesting taste; found out later that it was made with olives!\n\nFood was overall very well made. We were informed of the specials of the day - which I ordered. First off was the oysters. Although the oysters came out real fresh, it was a lot smaller than expected. The Oysters were seasoned with garlic, onions, and lemon/lime juice - which was nothing special. I also got the entree special which was the trout with citrus/curry-like sauce (sorry I don't know the exact name for it), which was to die for. It came with some vegetables, some tangerines (hence the citrus flavor in the sauce), and couple grilled onions. Also to add the fish skin was nice and crisp. \n\nWould come again for more special occasions!",
        "author": "Amy T."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-24",
        "description": "Absolutely lovely experience with my girls for night out. Food and atmosphere were delightful and delicious. We ordered several plates to share(salmon dish, beet scallops, a divine salad, and I believe a cod dish). I could not stop raving about out the dishes and hospitality the next day. The owner is so kind, as is the hostess, and wait staff. Truly a wonderful evening spent in Palo Alto.",
        "author": "Dafina F."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2019-11-20",
        "description": "Zola officially became my favorite restaurant in Palo Alto after my recent dinner experience here.\n\nI made a reservation on a Friday to celebrate a special occasion with my boyfriend. We were greeted warmly and seated right away by the hostess. On our table was a card thanking us for celebrating a special night with the restaurant which was a small gesture but gave us something to smile about right as we were seated. \n\nThe menu left us feeling overwhelmed because everything sounded so delicious. We decided to get the gnocchi to start and then ordered the halibut, mushrooms, mac and cheese, and potato gratin for our main meal. PLEASE ORDER THE GNOCCHI. There was so much flavor (ricotta + truffle= HEAVEN) packed in each bite and the gnocchi had the most wonderful chewy texture. The mushrooms also added great texture and flavor to the dish. So delicious. I was licking the plate at the end because I could not get enough! \n\nThe halibut was excellent. Fish was well cooked, flaky, and melt-in-your mouth soft. I really enjoyed the nice mild sauce that came with it. \n\nThe mushroom side was the best mushroom side i've ever had at a restaurant--and I'm obsessed with mushrooms and have tried tons of mushroom dishes at many different restaurants. the sauce (escargot butter) was the best sauce I've ever had and complimented the mushrooms well. I was blown away. highly recommend this side. \n\nThe potatoes were interesting-- reminded me of hashbrowns and tater tots. tons of flavor and I enjoyed the sauce that came with it. \nThe mac and cheese was very good as well. very cheesy and well seasoned.\n\nWe ended our dinner with the chocolate mousse. The coffee tones from the coffee gel was amazing with the chocolate. A perfect balance of sweet, nutty, and bitterness. So good. I highly recommend this dish as well.\n\nOverall, incredible dinner. Will be back again soon.",
        "author": "Jinhee K."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2019-06-22",
        "description": "Second time here.  5:45 Friday reservation. The place is practically empty.\n\nThe waitress recommended the Zinfandel over the \"cool stuff\" wine list.  Was very nice.\n\nFour of us order 3 appetizers and 4 main courses to share.  The Terrine de Campaigneu won the appetizer round, the Roasted Chicken the main course one.  It was crispy, excellent planate and veggie bedding, and tasty.  The special sea foods dish was second best.  I felt the sausage was a bit too spicy for the dish.  The short rib was a bit disappointing and pork-chop quite good as well.\n\nI was not really impressed by the desserts and would recommend skipping them.  The pine-apple was essentially  two slices of pine-apple scorched with some sugar on top.  I was not sure much cooking skills was required for that.",
        "author": "Sin-Yaw W."
      },
      {
        "reviewRating": {
          "ratingValue": 4
        },
        "datePublished": "2018-11-25",
        "description": "Good food. Nothing spectacular but solid. The flounder was pretty good. The beets were really good. The mac and cheese could use some work.\n\nDinner\n* Beets (Excellent)\n* Gnocchi (Excellent)\n* Mac and cheese (Ok)\n* Bone Marrow (Good)\n* Flounder (Great)",
        "author": "Kristofer E."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-17",
        "description": "I've been to Zola's a few time and should have written a review after my first visit. They have a creative menu, delicious food and service that comes 2nd to none. Zola's has quickly become my favorite place to dine in palo alto.",
        "author": "Farzad F."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2018-10-09",
        "description": "My BF and I came here for our anniversary on a Friday, and I will say that reservations were a must. The restaurant is located in a really cute area and there's a lot of stores around to check out. \n\nTo preface, the service here was great and the wines were delicious, but the food was a bit of a let down. \n\nPommes Dauphine & Ricotta Gnocchi: Both very very oily. I understand that the Gnocchi was suppose to be in a brown butter sauce but looking at it swimming in oils just wasn't very appetizing. \n\nTartare: Good in texture but definitely on the salty side. \n\nGame Hen & Foie Gras: The redeeming dishes of the night, but neither really stood out among other similar dishes I've had in the past. \n\nOverall, Zola gives you a great atmosphere, a great wine list and decent french fare. Great for a more intimate dinner if you're in the area but not something to drive out of your way for.",
        "author": "Jenny L."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-17",
        "description": "This place is nothing short of amazing! The food is delicious, service is  great and the atmosphere is perfect for a date or a night out with friends. Close your eyes and order whatever your finger lands on or order whatever the server suggests. Either way you can't go wrong. Just make sure you pair there amazing food with some of there amazing wine.",
        "author": "Alexandar P."
      },
      {
        "reviewRating": {
          "ratingValue": 3
        },
        "datePublished": "2019-10-14",
        "description": "I have been wanting to try this place for a long time so finally it happened. Unfortunately it didn't match my expectations, maybe we order the wrong thing! but really ? its suppose to be a good restaurant. We order the mushroom, salad to start: loved the mushroom, but that pretty much it for me.  I recommend ordering it if you love mushroom, we order short rib, and the pork chops, the short ribs was mainly potatoes and fat, in every single bite I took, its just big blubber of soft fat maybe one or two bite were meat( you can see the picture ), the pork chops was dry and tasteless, it was very disappointing for me. Also I found the wine list is over all  very short either by the glass or by the bottle for a restaurant operate in downtown Palo alto. I didn't like having to sweep a huge  table screen at a table at a Restaurant to choose a bottle of wine, in my opinion we have enough of screen already, but if you want to look at the wine bottle you have to read it from a tablet .\nThe services is not bad but not good either, we had a couple different people serving our table but it seems not very attentive. Over all disappointed and so I will not come back.",
        "author": "Jolie T."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2020-02-08",
        "description": "Wonderful spot with great food and service!  One of our new favorites in Palo Alto...",
        "author": "Amir A."
      },
      {
        "reviewRating": {
          "ratingValue": 5
        },
        "datePublished": "2019-12-25",
        "description": "Amazing Delicious food. kind service. the drinks are mostly wine, lots of whites.we had an amazing oyster special. the gnocchi was also amazing.",
        "author": "Suzanne S."
      }
    ],
    "servesCuisine": "French",
    "priceRange": "$31-60",
    "name": "Zola",
    "address": {
      "addressLocality": "Palo Alto",
      "addressRegion": "CA",
      "streetAddress": "565 Bryant St",
      "postalCode": "94301",
      "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media0.fl.yelpcdn.com/bphoto/WTDCmlvG9vj9Q9z1kvRg5w/ls.jpg",
    "@type": "Restaurant",
    "telephone": "+16505210651"
  }
]